{"new york edge": ["not much negative i can think of", "Room for growth is very limited.\nMost positions are part-time.\nTons of miscommunication. Upper management is very limited in support.\nA lot of petty high school minded mentally.\nHR is filled with people who are very unhelpful", "Make less for trainings and trips\nTrainings are on days off midday or all day\nSome schools are not well looked after\nThe job described to me is not what I do (I.e. the kids do not get to choose what activities they have day to day and I have students who don’t want to dance Monday-Thursday)", "Have to work hard to grow and sadly sometimes it isn't recognized.", "Just because you change the name and rebrand, doesn't mean a thing. The processes and systems are still the same.\nSalary not standardized or competitive (unless you kiss up to the right people)\nArchaic and backwards in terms of org development and staff development\nYou are expected to answer emails late at night\nUnreasonable"], "brightidea": ["There are growing pains like any company this size, the product is constantly evolving and licensing is changing and it can get confusing to sell and keep track of.\n\nSince the company is small internal growth can be challenging- but if you are proactive management will work with you on a career path.", "It can get myopic when viewing market.", "Constant feedback loops/cycles can easily get lost with minimum structure in place which makes it difficult to have high standards of quality.", "- Product is less than cutting-edge\n- Company feels slow to adopt innovation (ironic)", "With big impact, the problems we are solving are hard, and requires effort to continuously produce quality output. If you aren't up for challenge nor hard work, wouldn't recommend."], "turo": ["The demands of the job are stressful given the nature of the work (but I feel valued by my colleagues).", "While its not a con, it can be challenging, we change process to better suit our customers, so there are days of training that can hinder you from keeping up with the work itself.", "- Need to streamline department collaboration and maximize our opportunities for improvement and growth\n- Career path direction is up and coming along with internal HR policies", "Compensation is below market\nNo 401k match", "No 401k matching, hopefully in the near future"], "cherry creek academy": ["Hectic at times - can be overwhelming"], "nerdify": ["From time to time I have too much on the plate and work overtime. It's paid off, though.", "The job interview is hard. Heavy workload.", "There are a lot of requests and you need to work hard.", "None .. I truly can not think of anything negative .. Everything was good with no regrets .. Happy to have been there", "Don't have so much to say.. Maybe our communication with management could've been better."], "dropbox": ["Consensus driven\nChanging product landscape", "Weak Strategic Thinking\n\"Evolving\" strategy as each year's strategy proved to not work. Each year's strategy is based on models of the industry where either the model is unconvincing or it is not at all clear why Dropbox's approach is the winning one.\n\nPassive Aggressive Culture\nPeople are always friendly face to face but beneath the veneer there is a lot of jockeying for power. Power distribution is evident when prizes projects get done by in power teams even though the area is theoretically another team's area of responsibility. People assign overflow tasks to other people even though they are responsible for it. People initially promise to do work and then shirk it without repercussions.\n\nPolitics\nUltimately unsuccessful projects were created and pushed out the door to get people promoted. Many people jump on board early on and generate immediately ridiculous shoddy user research to back up the work. Shallow technology is hyped as awesome and weak initial indicators are seen as good. Many of the promoted people still remain or get promoted even further up to do more damage.\n\nPromotions are based on getting backing from managers and hopping on board initiatives that staff engineers or managers push. Each new set of staff engineers or managers disparages the work of the previous set and advocates for their own work. No one is willing to push back against what they say.\n\nLevels are uneven with some staff or senior engineers/QA who are anything but that. Long time mediocre people are accumulating. Some title inflation for new hires.\n\nThe attempt to make the culture more innovative is not working because the people who enforce and benefit from the culture are all still in positions of power.", "-People are churning out very fast in the past 9-12mo.\n\n-Busy work is rewarded. A lot of people put out a ton of \"work\", but very little has impact. The volume of work is often used by people to vouch for promotion, bonuses, or transfer to higher roles in other teams.\n\n-Reorgs. The company has had 6 internal re-orgs on teams I have been on since I joined. Imagine working on a project for 6 months, getting everything in line and then leadership decides to do something completely different. This makes it super hard for many people to actually accomplish something start to finish.\n\n-A lot of teams are made up mostly by people who come in through the Dropbox Rotation Program out of school. I find that these teams are highly tribal, not open to criticism, and often do not do very high quality work but know how to play the system very well.\n\n-Peer review process is hit or miss and a lot is open to what feedback your managers choose to include. Moreover if you move to another team you can often be \"re-leveled\" and miss out on promotions or career path opportunities.\n\n-Due to there being so much work to be in certain divisions, a lot of time is wasted on things that have minor impact. On one hand employees milk this because it makes them look like they do a ton of informative work, but on the other hand if you look at things from the big picture we learn slowly and can't scale ideas well.", "Some legacy code, but it is quite common for all company.", "Grow pain. Very heavy context switching."], "masco": ["Some management can be worked on", "There is no cons with this company.", "Not a lot of training time and must move quickly and adapt fast when first starting", "Honestly? Traffic and compensation for equal value skills -- this specific team is bleeding talent because their corporate leaders continue to bind their hands, in terms of offering pay competitive to other opportunities in the market.", "Long days, sometimes stressful, gets really busy at times"], "social standards": ["This is less of a con than a simple truth. To disrupt an industry with technology takes time and energy. You have to have a certain mindset to be apart of the company", "They need to hire more people to keep up with technology growth."], "clever": ["None, it was all good.", "- Education isn't a hyper-growth industry, and although Clever is one of the most successful edtech companies ever, it's not doubling in size every 6 months like a scooter rental company. That means you're less likely to skyrocket in title, and you'll spend more time developing expertise in your current role.", "8th and mission in sf isn't a great block, safety is a concern, but Clever covers that with their safe rides program and a secure building.", "- No 401k employee match\n- Neighborhood is not the best\n- Room for growth in terms of promotional movement within the company\n- Very young company, (we're making strides in hiring more experienced leaders)", "Back to school season is a very busy time that requires a lot of time and dedication for about 9 weeks of the year."], "china southern airlines": ["The commute is pretty far if you don't live in San Francisco", "I'm different culture, so is unacceptable to me", "company instruction is sucks in here", "too chinese centric higher managers are rotating in from china but english ability much to be desired, flight benefit is a joke but on par with other mainland chinese carriers way below industry standard, not very much training conducted leave more questions than answers, coworkers friendly but again very chinese mentality sometimes hard to communicate your point across, pay can be better", "Office politics with complicated relationships"], "red ventures": ["None that I have experienced yet", "The sales professional job is draining, boring, stressful, repetitive and probably headed towards automation.", "Good old boy network when it comes to being on the inside track of promotions.\n\nSome of it looks to be nepotism.\nSome of it looks to be favoritism.\nSome of it looks to agreeing to craft beer preference or what microbrewery they may be visiting this weekend.\n\nAll of it is bad for the future though.\n\n Not quite a purposely a racist, sexist, judge mental environment but, damn near close.\n\nLogistical placement of where sales is and where everyone else is makes it pretty obvious.", "they will place impossible metrics for you to complete, and when you are at the bottom of the center you get the worst possible calls.. nearly impossible place to be successful..", "Commission plans change month to month"], "aflac": ["Long hours leaves little time for family.", "No guidance. No training. Lack of communication from upward management. All commission based. No base pay.", "Not for those who are not self motivated.", "upper management isn't the most supportive", "None in my honest opinion."], "odoo": ["Access to information at the company level can be difficult.\nCommunication between headquarters in Belgium and SF office needs some work.", "Pay is terrible, everyone is leaving, managers have never been managers before and also lack training. There's no training when you join and no real HR. Company acts like it's a start-up when it's making excuses for why they don't offer certain things, but they are not a start-up in any sense.", "In a nutshell, if you are willing to have a less-than-thrilling work and take your below-mkt paycheck, you’re fine. The job is not that hard, and there’s no encouragement to do more. You’ll not be punished if you do the bare minimum, but will not be rewarded if you go beyond. You can easily arrive at 9 and leave at 5, take your lunchtime, hang out in the office. Motivation lasts for the first 2-4 months, and then you’ll realize it’s better to join all the other demotivated people and start looking for a better job. You’re a slave of your position, you can’t do, create, or try anything different if it is not explicitly demanded by your superior. Just do what your boss asks, and you’ll be fine.\nOdoo is best for:\n- Inexperienced people, who are willing to have 1st experience\n- People who don’t want to work hard\n- People who want to get into sales and then get a real sales job\nIf you do not fit in any of these buckets, find a company that respects people.\nBenefits are not that good compared to other startups", "After you've been here for about a year you realize that it's really a weak company in so many ways and you'll start looking for a new job.\n\nOdoo is a Belgian company, and most of the important decicions happen there. The belgian CEO has a huge amount of control over the product, sales, company direction, and he is even technically the director of marketing!!! As a result, working at Odoo in USA feels like working on a moon base that is totally separate. You never know why the company makes its decisions, where things are headed, what the goals are, what it stands for... For example, odoo just released a brand new version, but there was literally ZERO marketing about it. Instead they just sent out a ton of emails and push notifications to people in the us, canada, mexico and latin america about going to their annual event in BELGIUM. This is the kind of thing they do, because the strategy is not including this part of the globe.\n\nIt might not feel like a very bad job if it were not here in san francisco- but it simply does not even compare to other tech companies in the area, in terms of standards like salary, vacation time, WFH policy, equity, 401k, offsite company events, meal service, etc. They say they are growing all the time, but that just seems to mean that they are hiring more and more underpaid people instead of ppaying their current employees what they deserve. People are normally disappointed with their annual reviews and raises, THIS is why the job hunt tends to start at month 13 of the odoo carreer.\n\nthe partner system has flaws, we recruit partners but we are encouraged to just sign up anyone that might want to be a partner- it doesn't matter if they are going to be good at it or not. we try not to let really bad ones in, but still, the system leads to bad partners, and bad partners get disappaointed when they don't do well, and this spreads the word in a bad way. or, the partners don't do a good job of setting up the system for their customers and so their customers get disatisfied with odoo. Either way it's not good for spreading the word and getting a repuatation.\n\nAlso- if you are in any of the sales teams here (there are 3 plus a customer success team) then you will find yourself gradually getting fewer and few leads because of a few issues mostly involving overhiring and a tiny marketing budget. Seriously- do a google search on ERP SYSTEM ( which is what odoo is) and you will not find Odoo. The company does not spend money to advertise.\n\nOn top of the daily frustrations with the company and trying to do your job right, the vacation policy is really bad- it is two weeks maximum per year, and if you try to use sick time for something the company thinks is actually vacation, they will punish you for it , change your request to \"no pay time off\" and make the decision right when they cut your paycheck without even letting you talk to HR about it. This has upset so many people and even one of the best workers we had left in part because of this.", "-No access to equity\n-No profit sharing\n-No 401K or yearly amounts on top of salary designated to retirement benefits\n-No meal reimbursement plan, catering or free food\n-Dependency on Belgium Headquarters for certain decisions\n-Communication challenges\n-Leadership in some departments could improve"], "c3 systems": ["None that I can think of.", "Unfortunately once the company was set up, there wasn't enough work.", "more flexible with snow days", "The con was that the pay was just ok", "To the best of my ability, none. I enjoy working here and look forward to many years."], "accenture": ["Workload can be heavy and schedule demanding", "This is not an opportunity for those that do not want to work. At Accenture everyone has a load of work to do and often times under very tight customer time lines. It is a challenge that I enjoy but many might find it stressful.", "Typical roles require travel Mon - Thu each week, but this is the tradeoff for gaining experience with a broad range of clients.", "There is a lot of restriction and precise regulation of salary and promotion.", "Long hours, lots of travel, and a lack of respect for family life."], "guardian industries": ["Salary is not always most competitive with the market.", "Not a great deal of team work", "Changing environment. Must accept change from all sides.", "low starting pay, minimal raises, no training, high turnover causes mandated OT", "Hot in the summer, cold in the winter. Maintenance you gotta call-in on your scheduled overtime day. Some shift supervisors like to put harder work orders on others. And very common for workers to tell you they aren’t doing something they have been giving to do because they don’t wanna get dirty."], "starbucks": ["Its a big company so things move slowly and there is still a fair mount of siloing between orgs.", "If you work at a store worth their salt they will work you to the bone. Especially in a large or high-volume store there is so much to do, so much to clean. A morning shift person will have the absolutely insanity of a morning rush, but an evening person should be expected to handle evening rushes with a limited staff as WELL as get the place spotless in what I believe is not a reasonable time. We could get the place clean by 10:45, all right--if we broke the health and corporate rules about when to tear things down. And of course if that was ever found out we were in deep. And if we went over 10:45 we were also in trouble. Management sometimes has some very unrealistic ideas about what the job actually entails and what rules and boundaries should go with that.\n\nThe pay in my state starts near minimum wage. The ceiling for a barista is $10/hr, which you hit when you've been there about five years. But tips help, and some high-volume affluent stores will have tips up to $4/hr.\n\nThere's also a tendency to have fanatical management. Other \"kindly\" corporations like Whole Foods have this too--the managers drink the Kool-Aid and worship the company. I once spoke with my manager because my schedule was being changed with less than 24 hours notice, and that was against state law. She got this crazed look in her eye and spat \"Starbucks law goes above state law!\" But that's only a tendency. There are some pretty cool managers out there. Mine was insane.\n\nThe customers are spoiled rotten so they also get kind of unreasonable about their Starbucks. They will stand there and demand that you make a drink five times because there's still foam on that latte and they said NO foam, not LIGHT foam. This is a business model of Starbucks': everyone is special, and we will bend the rules for everybody. And I've had people scream at me and call me a (b) and promise me that they would make me lose my job. I've also had stuff thrown at me. But, that's also just customer service.\n\nThese last few years Starbucks has been obsessed with selling, too. There's a lot of pressure on the staff to make sure people go home with $15 bags of coffee and sub-par espresso machines. It's hard to maintain the relationships they want us to maintain while trying to sell stuff.\n\nOverall, if you can put up with the customers and the physical demand, and if benefits are more important than income, do it. It's rewarding in its own way. Wear insoles.", "Sometimes it would get really busy and there were not enough employees.", "Stressful environment esp drive through", "Work environment can get stressful, constant changes with product, unfrequent minimal pay raises, low pay"], "roche": ["-little mobility to be hired as entry level roles are limited", "I can not think of any cons", "A large company and it takes a long time to make decisions.", "Very complicated organizational structure and, as a result, too many levels of programs/projects management and people who actually do not produce anything useful", "Politics are crazy. It's who you know - not really how well you do that gets you promoted or a higher salary ... I wish it were not that way. Incredible nepotism in the Biometrics Programming Group (at least in Pleasanton, CA)."], "amazon": ["Peak season gets very hected. Plus work long hours.", "You have to be self motivated. NO ONE will hold your hand and tell you that you're doing a great job. If you need constant affirmations from management, this company isn't for you.", "No cons, so far - seriously. Like I said, I'm sure Amazon has some bad pockets in it here and there, but this is an amazing job, an amazing opportunity, and the biggest thing I have to complain about is that it's a little chilly in our building. I can live with that.\n\nDoes Amazon demand high quality, measurable results? Yes! Is it hard work? Yes! Is it rewarding? Yes! So I'm not calling that a 'con'. Work/life balance seems comparable to other places I've worked - not worse.", "The management process is abusive, and I'm currently a manager. I've seen too much \"behind the wall\" and hate how our individual performers can be treated. You are forced to ride people and stack rank employees...I've been forced to give good employees bad overall ratings because of politics and stack ranking.", "- You're responsible for your own career progression and finding the places and teams that are doing the stuff you want to do. No one is going to take you by the hand and help you with that.\n- Amazon is built, quite deliberately, to be Darwinian. The strong survive and the weak perish (metaphorically speaking) and the 'bar' is constantly increasing. The level of performance that would have been acceptable five years ago will get you canned today. It's a kind of crucible that'll help you develop a harder edge, if you can survive, that can serve you well in your career and in life, but it's often not a pleasant experience.\n\nI wouldn't recommend it as a place to work for just anyone."], "volt athletics": ["COO decided overnight that my skill set was what it was and let me go. No one in the company ever said anything negative about my performance. I consistently hit the goals they asked of me and frequently praised my performance publically.\n\nLeadership can change their minds overnight and what they say goes no matter what"], "chegg": ["No cons as of now", "Career paths are non-existent at Chegg", "Change the future of education, but unfortunately its by helping students get answers on their homework, quizzes, take home exams\nLots of politics, infighting\nOutdated systems that don't work", "Be prepared to be a \"yes man\" and work as directed. Politics are rampent.\n Ownership and accoutability are scarce!", "Have to be fast at accepting a lesson, some students give bad reviews for no reason, can spend hours looking at the opportunities and not get any lessons."], "quardev": ["none that I can think of...keep up the good work", "None that I could think of.", "No cons to speak of.", "Amazing opportunity but more attention is needed around commission payouts (calculations are not transparent), business development (support is limited), and staff turnover (it is disruptive).", "Still working out the kinks in their use of third-party payroll software"], "devcool": ["Not enough compensation for the work effort"], "cox automotive": ["- Lack of training to specialize the tool/software, but this is where reaching out to other coworkers & looking at other external resources play a major role for your success", "No downside, so far the company was doing so well", "Management needs improvement, Supervisors need improvement", "Periodic \"right-sizing's\" . They subscribe to the GE model of purging your bottom 20% via RIF's versus addressing performance issues....", "With each leadership change comes a revamping of technology reporting structure and division strategy."], "samsara": ["The company is constantly hiring so it takes away from daily productivity. However, time management is key to being successful here", "Very few qualms. Work culture is a bit male-centric due to our customer base but other than that it's a healthy culture.", "It’s your typical sales job.", "I genuinely can't think of any. Any complaints (even about small things like the catering) seem to get addressed very quickly by the company.", "Growing very quickly so typical company growing pains."], "womply": ["People who are ready to jump ship go out there way to discourage others around them. The hilarious part of this while they were here they would go out of their way for more responsibility to impress peers. My advice to the newbies is to understand your role and just do your job. It is easy and you will find the right people to help you. Just ask.", "Since it is a \"startup\" there are some growing pains. That is going to happen with any company. as you can see the people who are leaving negative comments they have made some hiring mistakes but that is really it.", "They dont value there employees they treat you like a number and kick you to the curb if you have even one bad day.", "--Chaos. \"Startup culture\" can mean a lot of things, but here it means \"oh crap we never thought of that we better fix it.\" The last year has been rough, as you can see from the reviews about huge sales staff turnover and people leaving. In my personal view, the people who have been let go were honestly not performing up to expectations or producing significant, measurable results. And naturally you can expect them to be bitter in some cases. But I would also encourage you to take the ultra-negative comments with a grain of salt. Not many people will write a glowing review after being fired. And honestly, if you're not meeting the expectations you were hired to meet, shouldn't you expect repercussions? But yeah, if you crave a drama-free, opportunity-free, worker-bee job where you just punch the clock and do your time, look elsewhere. At Womply you will be challenged, and the challenges are enormous and can feel insurmountable at times.\n--The \"open plan office\" is murder for people who prefer things quiet to maximise their productivity. Seriously whoever came up with this dumb-arse idea needs to be broken on the rack. So if you don't thrive with terrible pop music constantly on in the background and/or if you're distracted by other people's conversations/clicking pens/sociopathic whistling/loud chewing/flatulence/passive-aggressive typing/inane blather/whatever, invest in some quality noise-canceling headphones, or apply elsewhere.\n--Working remotely is discouraged. They do allow it but they expect it to be the rare exception, and from what I've seen it's usually when people are sick that they work from home. Management does want people on site whenever possible (and due to the \"focus on results\" company value and the and \"rise and grind\" mentality of some people, lots of people come in sick). So if you work best from a home office, look elsewhere or be sure to get whatever WFH arrangement you get them to agree to in writing so there are no surprises.", "It's a startup so things move fast, and are a bit chaotic..... but the advantage is that my input is heard and changes are made. You are not some corporate drone..."], "textio": ["Truly nothing negative to say. It's an amazing place to work.", "Difficult to get ahold of coworkers at times", "Genuinely don't have any cons at this point.", "The only thing I can really complain about is that we can't bring our dogs to work :(", "None really. Some guidelines are still being put into place with the company being relatively new still, but this isn't necessarily a bad thing. Having the flexibility to shape what it's like here is exciting!"], "everlaw": ["Like a lot of startups, the company sometimes seems to fly by the seat of its pants. Just typical growing pains.", "Pays less and has inferior benefits compared to other tech companies in the Bay Area.\nTough to sell annual SaaS subscriptions to law firms. Tough to make any money selling case subscriptions.", "Folks here work very hard. Work life balance is great, but the work is demanding, and not rote or monotone. High expectations of competence from all employees.", "I have no negative sentiments at this time", "There have been some (perhaps typical?) growing pains as we have scaled up, but I am confident that we will look back and see them as minor bumps in the road."], "insightly": ["Normal start-up issues that are to be expected.", "We hired too fast for a bit and as a result, hired some people we probably shouldn't have that were not invested in their own success and not a culture fit. These people are no longer with the company but are probably the cause of some of the bad reviews.", "Granted that not all startups are perfect, they can come close. There is always room for growth. A while back, each department aimed to grow its size to scale operations so PeopleOps team staffed each department in a fast amount of time. Teamwork, camaraderie, and a dynamic strategy got us there. Suddenly, we hit a snag with what we aimed to do: scale.\n\nWhen a startup expands, so should infrastructure, onboarding, ramp up time, and strategy. The people that have stuck around for the longest time can have insights, best practices, and experience so they can be the biggest resource. Uplevel the tenured people and show them how much you value their contribution to learning & development tools, new opportunities, and an exciting vision. New leadership needs to bring new energy to jumpstart the team rather than the feeling of shock. Then keep that energy going.\n\nNonetheless, Insightly shares the same growing pains as any other startup in a market that's saturated, competitive, and costly. After my initial months, I learned a lot through researching CRM, sharing knowledge, and asking questions about what I don't know in order to keep the edge at work. This is where a strong and continuous onboarding program comes in and needs the full support of leadership to execute. Here are some things we needed: an articulated company vision, domain expertise modules about SaaS CRM, catchy value propositions, and a robust mission statement are a few quintessential to show remind everyone why they come to work every day.", "Start Up and general Growing Pains", "Recent manager hires only have concern about themselves. Employees can't give 100% because management gets in the way. So why work hard? You DON'T want to work in CS- too much dishonesty, fakeness and rude treatment from the VP and her pets. Demeaning in every way."], "winkler web designs": ["- Being a young business, the leadership is still figuring things out along the way. This wasn't a problem for me, but if you're uncomfortable with ambiguity, it may not be the best place for you."], "adler planetarium": ["I had no reservations about the experience.", "Offices are below ground and its cold in Chicago", "Too much toxicity in the workplace and trust and communications between departments is lacking. The powers that be lord over their departments like a fiefdom from Medieval times. Human resources allowed too much inappropriate behavior over the years by employees and there is little chance of change until a major revamp of the department, starting at the top of the department. Plus, do not expect much advancement either. They are more likely to hire from outside than promote from within, unless you are a favorite of a VP or the president. It may be a non-profit, but smaller museums in the Chicagoland area pay better than this multi-million dollar institution.", "Can be annoying to get to/from when there are other events on the museum campus, but it's a fair trade-off.", "- unless you are in a science field (which there are few jobs) you will never move up or get a raise besides a small percentage each year. Dead end job.\n- also, the CEO has favorites. and they change. when you are no longer a favorite you might as well leave. when you are a favorite you move from volunteer to VP in a matter of five years.\n- unrealistic expectations. you're expected to work 60-70 hours for pay below the museum average but just be grateful you work for the Adler.\n- the Adler does not plan ahead for anything. As much as you try to plan out ahead of time, they refuse to work as a cohesive team and plan an exhibition, event, or even a gala and it's detailed out in advance. this brings so much stress across all departments.\n- you will end up taking on extra work with no job title change or compensation. And apparently should be grateful for it.\n- the benefits are sad. the insurance costs so much it hurts.\n- some director and VP levels take advantage of working from home - yet you can never get a hold of them strangely when they're supposedly doing so. and no one does anything about it.\n- the gossip is the worst and brings morale down. And some of the gossips come from the top."], "sapphire digital": ["Working from home and PTO depend heavily on which department you work in, so don't get too excited.\n\nThey made a game room and are making a quiet lounge area, so you can work even more hours and feel like you don't need to ever go home!\n\nUpper management is clueless, out of touch. The CEO talks about her 'golfing handicap' as if people are really concerned about it too.. We're concerned about our health, finances, and families. Get it together people.", "CEO is a narcissist and misleading bureaucrat. Can't pick a strategy and stick with it. Not a tech company. Toxic culture because management is rarely in the HQ's and doesn't share information", "Changing company from media to SaaS, different leadership, poor communication", "Upper management at this company is toxic and political. Nepotism is rampant at Vitals and the only people who are promoted are friends of the higher ups. Employees below upper management are not treated fairly or with respect. There is no flexible work-life balance and the open PTO policy only applies if you're manager \"likes\" you. No one is happy at Vitals and it's obvious on a day-to-day basis. Employees are no longer motivated and feel defeated.", "Teams have full freedom to self govern. The disconnect mentioned in other reviews is because since your relationship with your team is everything, the manager of your team has full authority over your satisfaction here, regardless of the direction of the company. If your manager isn't fond of you, good luck; if your manager is sexist, good luck; if your manager doesn't feel like you need the unlimited paid time off, flexible work schedule, whatever, because she is vindictive, temperamental, or spiteful because you stopped taking lunch together, got friendlier with other coworkers, or never went to the gym together... good luck. If you have an issue with that, you can see the door."], "maven recruiting group": ["The Mavens truly embody the \"work hard, play hard\" mantra which is why we've achieved great success. This is a team that works late if need be and communicates with their candidates after hours to ensure their experience with Maven is seamless. If you are seeking a job to simply clock in and clock out, this industry / workplace may not be the perfect fit.", "been here over a year now and nothing that is really a con. You have the ups and downs of any role.", "No negative things to say! I have had an overall positive experience with Maven they helped me get to where I am!", "I have had no negative experiences with Maven.", "If you're looking for a job where you can clock out at 5:00PM every day, this is not the place for you. However, staying late is not a characteristic that solely belongs to Maven- in general this is true of most recruiting agencies. The upside is that when you stay later and put in extra work, you see the direct results in the number of candidates that you place."], "decathlon": ["Salary\nNecessity to have the capacity to make the difference between personnal and professional life", "Can Improve their salary structure.", "The process is not very clear sometimes", "Upper management is more concerned with self advancement than performing their roles adequately or even competently. Complete lack of team spirit among management with several of the members hustling to simply make themselves look good.\n\nEnglish skills among upper management are middling to poor for a team spearheading a retail expansion to the US. This led to significant lost time due to inability to communicate clearly, and a feeling of inferiority American employees, as conversations among non native English speakers invariably defaulted to French or Spanish.\n\nConstant introduction of new top priorities created lack of focus and progress for the entire organization.\n\nAll decision making is at the whim of the CEO who provides no context to his outlandish demands, nor will he speak with anyone but a handful of the expatriate management team. This is completely at odds with their often stated ideal of a \"flat\" organization, where everyone is supposed to feel empowered to take the actions they feel will make a difference.", "1. Low wages\n2. The manager is not sympathetic\n3. Sometimes, have to work to 12 am"], "champro sports": ["nothing yet! Will let you know", "CEO is a \"numbers guy\" who is in the process of taking over from his father. That should tell you all you need to know.", "Takes too long for things to happen. Some of the people who have been there forever are just coasting.", "No cons. I miss the place very much.", "Both upper and warehouse management can be very condescending, everything needs to be done a certain way or else you get yelled at"], "chime": ["There are virtually no downsides to working at Chime. One cautionary note for engineers is that there's only mild support for external, continuing education. On the bright side, given that we are growing at 150,000+ users per month, there is plenty of internal work to feed your intellectual curiosity. You can see I am stretching to come up with a Con. This is a great place; if you have the opportunity to join us, you absolutely should.", "Work / life balancing is being eroded. Too much chatter on \"going fast\" vs. using a methodical approach to delivering new user experiences that are well thought out and clearly defined, and are of high value and quality. This is not always the case. Communication between teams is near non existent. The \"left hand\" does not know what the \"right hand\" is doing.", "None! Except the office does not have phenomenal climate control and can get kinda hot.", "Nothing for me - if anything, just the growing pains of explosive growth. Even then, they're really on it. Hiring, training, events, resources, etc.", "- The company is still going through some growing pains, but I can see this subsiding as teams are built out and processes are established.\n- Not a dealbreaker, but it would be nice to have access to FSA/HSA benefits. 401(k) matching would be great, too.\n- I took on a new role within the company, and it took 6 months to adjust my salary. Didn't feel great, especially as a female POC. It did get resolved eventually, just not as quickly as I would have hoped."], "c3": ["People noice breaks down side of communication", "Unprofessional, childish and immature co-workers\nLots of ignorant people\nFavoritism\nCliques.\nImmature Co-workers.\n. I suffered emotional abuse, harassment and bullying from my co-workers and it only got worse when I went to HR and to my supervisors to address the issue.\nIf you are that DESPERATE enough for a job, I HIGHLY recommend you look elsewhere. Don't come here. It isn't worth the heartache or the trouble. To everyone currently working there now. I feel BAD for you. This is the best job you are ever going to get.", "Oppressive workplace. Jealously rampant. Cliques. Unfair reviews. Constant write-ups. Negative work environment. Only 10% survive to 12 mo. mark from a training class of 27. Nice Supervisors who are fair and coach to help the agent succeed are the exception.", "Micro management and disorganized", "Company damaging employees futures with useless job titles. No future with this company. Long hours. Run by foreigners overseas. Layoffs very common and sporadic, often made by someone who has never visited the site in person. Would recommend to someone I dislike as a form of payback or revenge perhaps."], "great lakes psychology group": ["While you are working independently, it's sometimes hard to connect with other clinicians, making it feel very isolated. Waiting room is odd for clients. Not much opportunity to earn more"], "fareportal": ["Challenging clients. Occasional system issues but always corrected in a timely manner.", "Projects ar done and abandond fast\nDon't even think in working in other locations outside USA they will abandon the project and affect your carrier better wait for a formal anc compromissed Company", "Favoritism lies and total mess", "Company operates like a family business. No learning, no training, no management. HR team is a group of teenagers who know nothing and never of any help.", "* The company retention rate is terrible. Employees typically last 6-9 months\n* In the past 4 years there has been 4 different CFO's, 3 CMO's, 3 CIO's, as well as 30 or so different SVP's-VP's joining and leaving the company. About 75% through terminations.\n* CEO/Owner runs the company his way, doesn't allow much input. If you disagree with him you'll be let go\n* Any complaints to HR falls on deaf ears\n* Bonuses are not transparent, and take 4 months to get paid, raises and promotions are few and far between\n* Company is incredibly siloed, legacy employees are very protective of the work and do not like collaborating\n* HR/CEO frowns on staff socializing out side of work\n* It is 2018 and staff still use desktop computers\n* 2/3 of company is based in India"], "ad hoc": ["No training\nHigh turnover of staff", "- Commission structure has change near on every quarter since I have been here\n- Offices are not the best\n- Company cars are old and unreliable\n- Clients can be hard work to deal with given the 'rough' nature of the industry", "Waste of time. Awful management. No promises kept. Ever\n\nIf their clients only knew.", "Long hours. Could be better structured to provide to optimum balance between life and work.", "I suppose any 'niddle management job' or senior sales has it's 'honey-moon period but having been the principalearner x3 and establishing a good service relationship with major clients I found that as senior management changed I was disregarded and not given the bonus and remuneration promised in year 2. After year three things further slipped and..badly.\nBy year four/five we were in dispute, 30 % of regional staff had left: under new management."], "excell": ["I couldn’t even make one up", "Terrible pay. Horrible benefits. Bad management. No support from anyone higher in the company. No Raises. Cut in pay should you choose to add benefits (including Holiday and PTO).", "No raises or bonuses offered", "Poor management, lack of in touch", "More communication from time to time. I didn't need it personally but I know a few people who did. But as long as you have a good group of people surrounding you. You will do find."], "avispa technology": ["Cannot surf everyday...bummer dude!", "It's been more than a year, and so far no complaints!", "Do not have any at this moment.", "No real cons so far. AVISPA is growing and developing which leads to changing approaches and that can be challenging but every concern will be heard and you are able to be a part of a better solution.", "I've gained too much weight; this needs to stop (just kidding, I love it)."], "edcor": ["Management is demeaning at times and unprofessional when dealing with subordinates. In addition, nepotism and favoritism seems to be part of policy. There is no clear path to promotion and reviews and any complaints made by caller are one-way discussion and employees must consent. Performance number are hidden and expectation are inconsistent and often contradictory.", "No support nor leadership from management. Inconsistent goals and carpicious reviews monthly.", "It doesn't matter how well you do. They care more about a friendly office environment than they do productivity so your entire job depends on kissing up to management and being friendly. The pay is terrible as well as either a processor or phone rep. There is absolutely no chance of advancement. There are unnecessary rules like dress codes, no cell phones allowed and don't go on outside websites for no reason at all. There is a noticeable division between the front office and the hourly call center positions. You will frequently be told to do something, be told it's wrong, and then management will deny it moments later. This company has no loyalty."], "youth tech": ["Less Active and Less growth"], "airbnb": ["Office politics can be frustrating\nDesigners have too much power and many don't know how to build UX or be on top of projects\nThe quality of engineers is highly variable", "Nothing bad to say about the company", "Middle management is largely promoted from ops with little to no training.\nPoorly equipped and regular blockers.\nPoor organization management.\nLots of blocks for growth.\nRegular reorganization that accomplishes little and the lower level employees have to deal with ever changing landscape.\nHeadquarters engineers make a lot of money but operational people are often paid under market rates.\nNo pay transparency and poor management creates confusion.", "Typical growing pains for our size, honestly. For a long time, Airbnb was flat and you could grow your career quickly since the company was small. Now they're trying to add ways to grow your career and make it defined and achievable since there's not low hanging fruit from a flat org, which is good. There's also increased attrition for people who have been here 5-7+ years, but honestly I think fresh people who are excited and new have been better for my team personally. Many managers are also junior, but we've started to hire senior managers - my manager's manager has been doing a great job shaping and changing, which I appreciate.", "-Pay is not that great, I started out at $18/hour and after 3 years at the company, I was only making $20.65 after being promoted\n- Little room for growth in role and lack of transparency with how employees receive raises. My lead could not or would not provide me with a direct answer or explanation as to why I was making significantly less than other employees at same SL.\n- Metrics can be unreasonable at times due to the nature of the work. You are expected to close X cases a day and maintain a certain NPS, along with other metrics, although you are usually handling mishandled, escalated cases from external support teams that can take days to close. You never know what kind of call/ticket you will get, if it will be a case that takes days to resolve, or if it will be a simple account questions. You are also expected to answer questions with little resources for you and silo-ed departments, with the company motto being 'build the plane as it takes off'.\n-Along with having to be compliant with 'call controls' just trying to stay afloat making your 14 cases, you will get pinged throughout the day asking if you can take over other mis-escalated cases. Even if you are overwhelmed with casework and know you don't have the bandwith to take these on, you will quickly lose favor with upper management if you don't.\n-Casework can be very stressful, and while the company does it's best with trying to offset this with a fantastic food program and seminars, it emotionally drains you. CX work is more of a mediation role.\n-Within the 3 years that I was there, it increasingly became more like a call center, with more micromanaging of your time within the call controls, breaks, etc. Ultimately, this work environment along with poor compensation and lack of upward mobility left me no choice but to accept another offer at a different company, which was one of the hardest and most bittersweet decisions that I ever have made career wise."], "franklin fastener": ["Lies from management, disorganized, high employee turn over, benifits being reduced for no reason. ETC"], "rally health": ["Seriously, none. I love this company.", "Below market pay, especially stock\nAverage benefits\nNo clear career growth path, highly political, less about what you do - more about how you sell it\nLow quality/quantity food", "slow at times, sometimes feel micromanaged", "Compensation. Not much else to say - this is the biggest complaint. You're practically screwed with whatever you come in as. Do your best to fight for what's right when you get an offer (don't settle for over 10% under fair market value like my mistake). Also, do your best to communicate with your manager as much as possible about your career goals. The shadow of the big company (UnitedHealthcare) will probably still prevent you from really achieving it, but you can at least say you tried and can really see if your managers value and vouch for you. This is not to say that your work itself won't be rewarding - there are many opportunities to accept more responsibilities, take ownership of features, learn from a lot of the really smart people around you, etc., but be prepared for minimal compensation for those efforts. Even the engineers that I know have been there longer than me are not content with their compensation, and I'm sure most everyone around them would agree that they definitely deserve more for their efforts. You probably have a higher chance of getting a promotion/raise by applying to an internal job posting that usually lists a significantly higher compensation than to actually get promoted from your current role.\n\nSeems like hit-or-miss with management. Thanks to the culture pro mentioned above, I've got to meet so many people with different experiences: you seem to either get an amazing manager that makes you never want to leave or one that has opportunities to improve.\n\nTotally first-world tech problem, but the snacks could be better or at least restocked more. The snacks haven't changed much for as long as I've been here and even then, they are not keeping up with how quickly the San Francisco office is growing - fruit is only restocked every other day and they are all usually gone by 11am the same day of being restocked.", "Rally has basically one huge cons: they are extremely reluctant to promote people (and somewhat reluctant to give them market-adjustment raises).\n\nRally has a very clearly defined engineering career ladder. All of the responsibilities for a given role are clearly outlined. If you meet a certain percentage of the requirements for the next role up, you are supposed to get promoted. But it just doesn't work that way. In practice, privately, engineers are told that they have to meet all the requirements for the job title they want for a full year before they are eligible for promotion. Even then, it's a fight. We've seen team leads stuck at Software Engineer II for years while new hires on their teams are three or four career levels above them , people with 8 direct reports never given a management promotion, and numerous top performers who've left saying 'the reason I left is you didn't promote me to a role matching my responsibility.'\n\nFor employees with long tenure, this is particularly frustrating because new hires are held to a much lower standard than tenured employees. For new hires, we basically level you based on what you made at your last job, for existing employees, you need to be a hero to get a promotion.\n\nPay for new hires is very competitive, so you have to stick around a few years for this to be a problem. If you come in at senior level, you might not even notice it, because it's not that odd for a senior or principal engineer to take some time to move up if they do at all. But for midlevel engineers, it's kind of a trap."], "vonage": ["As Vonage has made many changes in the past year to really complete out the offering suite, it has shifted the culture in other departments -however I notice that the company is prioritizing repairing that culture and making it a destination work place overall and not just department by department.", "Vonage name not well known in B2B and Vonage relies on dysfunctional channel sales that are sporadic by region. It was hard to get people to look at Vonage over Ring Central, Mitel and even Cisco. The initial training is too short and lacks focus on use cases need to understand value prop. They are getting better but trail several competitors in New England.", "None that come to mind.", "Personally, I have not had a poor experience. I have read some of these other reviews and I am a bit surprised. The office I work at is very pleasant and everyone seems happy to be at work.", "Not for everyone! Vonage grew through acquisitions and now feeling integration pains. This is to be expected. After major surgery you don't start running right away -- this is no different. The people that will flourish in this environment are those that are gritty, self-motivated, and comfortable leading in ambiguity."], "avalara": ["Nothing to really speak of. Moving at incredible pace which occasionally presents its own challenges", "I've read some of the less favorable reviews and quite honestly, I'm surprised -- this has not been my experience. My advice to these folks is to speak up and make your voice heard. We are given every opportunity to do so. Be the change.", "Job will probably be fully automated by 2023.", "Upper management is running this place in the ground. Middle management were clueless", "Growing pains, comes with change"], "quantcast": ["As with any company that's growing and building new products, there can be substantial uncertainty. Taking risks can be uncomfortable for some people.", "Weak leadership and no new products in years", "Waste of time if you think you can make some money on equity as long as current CEO is present.\nCEO is selfish guy, doesn't want to sell the company or show an exit. I can also understand, it's very hard for anyone to sell/exit it's own baby/company. So, Konrad is not the right guy, he is too attached to the company to show any exit for the company. He needs to step down, have the new CEO show the path to the exit. Lot of companies in the valley do that usually, especially founders take the side role and new person take company to IPO, it's less pressure/burden on the founder as well.", "Team members are asked to participate in unethical business behavior including misleading clients on the details of their campaign set up and the products they are using. You are not seen as a team player if you don't go along with this type of behavior and thus become a target. Management is the root of this issue and it comes from the top down. Every year there is a new reorg or beta team setup that they claim is going to fix all of the issues, but these reorgs are led by the same people who made the decisions before and therefore will never fix the fundamental problems. The field west sales team is the worst of it and the teams around them suffer because of their behavior. Management duplicates work several times over by creating Gdocs and various trackers because they are so incapable of using their own management tools. They lay off their highest performing team members in reorgs, and those who generate the most valuable work are not rewarded or recognized for their contributions. If you see a high volume of job postings, it's because of the constant turnover. I would highly recommend staying away from working here.", "The company and employees are excited about where we are today. We need to reinforce our position and historically we haven’t done a great job at that. Our time to do that is now."], "smart enovations": [""], "d. e. shaw research": ["I don't have a lot of complaints personally. Some people might not like the lack of hand-holding that comes along with having a group of such driven, accomplished, capable people working at the company. Don't work here if you want to be micro-managed or blindly follow orders without question.", "The managers are as stubborn as (some of the) scientists are brilliant. The merit of an idea is worth nothing compared to the standing of the person saying it, so the managers fail to take criticisms of some of the company's main research efforts seriously. This leads DESRES to waste resources on projects that seem unlikely to lead anywhere.\n\nIt is hard to believe that such a risk-averse strategy will accomplish its goal of revolutionizing drug discovery. Granted, the scientific output is impressive and important, but as the company pivots its focus toward drug discovery and away from basic science, its relevance dwindles.\n\nOverall, I recommend working here as long as one is willing to work on a dead-end project in exchange for a large salary and a chance to learn some science on the side. Many would see this as a very fair trade-off, but I decided to take my chances elsewhere.", "There are very few downsides, and it was a very positive experience on the whole. The company's working on new technology so there's uncertainty as to how quickly the platform can be built.", "Difficult to blend in; growth curve can vary wildly.", "No job is perfect, and if you want something to be unhappy about, you'll find something. Yes, some of the managers are probably better engineers or chemists than they are managers, so the management part of their job can get neglected. But I'd rather pay that price than work under a bunch of people who are professional middle-managers but lousy engineers or mediocre scientists or just not very intelligent."], "clinical outcomes solutions": ["-Little opportunity to expand professional experiences\n-Polarizing political comments by leadership\n-Standard operating procedures often ignored between project leaders\n-Little performance feedback", "Higher management mean business and non supportive towards your efforts."], "trimble": ["Very aggressive growth mentality", "Still learning how to make the jump from a small company to a large corp.", "Lack of resources to do your job\nMiddle managers are overwhelmed/insecure and don't know how to lead a team or stand up for their team.\nBehind the curve on bringing new technology to market\nCliquey\nMeetings are managers talking at you telling you how things are great or glossing over issues that will be fixed.....someday.....\nPoor communication from middle managers overall, always in meetings, doors closed.\nSilos between departments. Unwillingness between departments to help each other.\nLack of clear strategy from top down\nSlow to evolve, not listening to the market", "HR Policies\nTransparency issues\norganisation structure\nNot having scope to shapeup Career Path", "Old school culture ( may be not a Con), decent compensation pkg\nNo fancy perks"], "exabeam": ["Not really any cons, as a fast growing pre-IPO company, the pace is fast. If you are waiting around for someone to tell you what to do, this is not the company for you.", "I wouldn't really call this downside (at least it is not for me), but if you can't handle a bit of chaos, can't think quick on your feet and don't like to work hard, this place may not be for you.", "As with the very few vendors who have been through this level of hyper-growth in the past, there will be teething issues across all parts of the organisation, bu rest assured everyone here is a AAA player and performer; we recognise our mistakes early and suffer fools rarely... Be prepared to work harder than you've most likely ever done in your career so far, but in return be prepared to leave a mark in the industry and few will ever match in your life-time...", "Low morale across many of the company’s business functions from Customer Success to Professional Services to Sales. The product is very complex and not stable (extremely buggy). Every team is feeling the pain because of this.\n\nIn fact, Engineering is slowing product innovation to focus on the quality issues. We are forced to constantly work in firefighting mode. Internal training is cancelled frequently, as support must jump on P1 customer cases due to product failures instead.\n\nBoys club culture at the top level. They brought an inappropriate comedian to a company event that made racist and sexist jokes. It was disappointing to see leadership standing at the front of the room laughing along.\n\nNot the “rocket ship” I was promised.. I hope they are able to turn things around.", "Dictatorial management\nCulture of fear and retaliation\nEmployees depressed\nDaily firefighting\nTerrible NPS"], "andromeda systems": ["None to report at this time", "Significant raises may be hard to come by.", "Sitting behind computer all day.", "You have to make your job interesting because it will not be interesting by itself. On the plus side, it is entrepreneurial enough where you get to do it.", "My office is in Lexington park"], "trunk club": ["benefits and no 401K match", "Not a ton of room for growth", "stylists not valued, comp structures always changing so we wouldn't get commission, employee retention VERY low, pay was laughable,", "The constant need to work after hours, unrealistic quotas", "boring work and harsh sales environment"], "seal consulting": ["all is well.small to medium size company", "No cons to report at all.", "Offer letter promised after interview... Never came on time...\nExpense reimbursement policy... Terrible is a subtle word for it! Basically you pay for the expenses with no expectation of return... Reimbursements come after 6 months!\nNo office location... Basically a home grown company", "growing pains include being unorganized in some aspects. Overall a great company.", "Took 4 months to get my travel expenses reimbursed even though the project was customer funded."], "trianz": ["Too many experiments, need to only focus on agreed strategy and not keep changing direction and structure.", "Hike percentage is not decided based on performance.", "Digital Marketing for brand awareness", "-Some managers/directors were more friendly than others\n-High employee turnover but is common in consulting\n-Industry focus was tech when I was there. Good for me since that was my interest but may be too narrow for some", "Can't think of any. Have worked with Trianz for over 3 years and have been immensely happy and satisfied with my work, pay, benefits, company culture and attracting the right talent into the company as part of the recruitment team."], "wargaming": ["Internal organization systems are confusing and need cleaning out and reorganization.", "Let's be honest, every company has its issues, coupled with gaming and some immaturity of the org, its demos of colleagues, and cultural issues you get a mix of what I can describe to be a place where things are awesome until they aren't, and no clear indication of why and changing just as fast to being awesome again.\nAs a con, its a dysfunctional family, But its a family I'm really happy to call myself apart of, maybe I'm crazy...", "1. Poor Management\n2. lack of skilled man power\n3. A lot of translation problem when your dealing with HQ people.", "Engineers gets treated like royalty where artist are simply VERY disposable.\nHorrible studio culture.\nAll you will be working is on World of Tanks games...\nNothing creative in that studio.\nCareer growth is impossible, you are pigeon hole\nFolks will take credit of your hard work", "Complete incompetent mismanagement at the company leadership level in East Europe. And in fighting from his subordinates create a culture of uncertainty in the future of Wargaming as a viable employer."], "k2": ["In the middle of a transition to Cloud product offerings and subscription revenue model...directionally exciting, but it has its growing pains.", "Some information remains silo'd but it's improving.", "Run by a venture capital firm now and you are nothing to them. HR doesn't follow through. Management isn't trannsparent and is always changing.", "The overall execution of the company was not good, and many of the decisions are made in the dark without the employees knowledge. Layoffs/people leaving became such an issue that we jokingly asked once “so i’ll See you tomorrow?” In that we just had no idea if that person would be around the next day or not", "After having joined K2 a few months ago, they do a decent job of onboarding new employees. But I feel their internal portals could be improved to help me and others with situations where we have questions that can be addressed through self-service."], "delphi technologies": ["it was a lil boring at times", "Low margins and high demands from Government Motors, Volkswagens, Audiis, make high stress environment.", "Nothing. Would be nice to have organic food options at the cafeteria.", "Slow HR department\n\"Revolving door\" of employees", "-HR is not helpful, hard to find, and unresponsive\n-on-boarding does not provide any training on the system use required for day to day success\n-management is only worried about the customer and the company stock price, does not care about employees\n-too many administrative duties placed on engineers\n-projects are not properly staffed from conception to finalization\n-processes are not followed properly due to poor training of new employees\n-purchasing system is broken and distant, difficult to meet immediate customer needs with sluggish bureaucracy"], "equus software": ["Not many cons. The work can be boring, but most of the time it's not bad at all.", "Sometimes you need to work evenings or early mornings, or buckle down on projects and put in more hours in a week than you would like. But ultimately, that comes as a part of any good job. The thing that makes Equus different is they make an effort to avoid having anyone work too many hours.", "Deadlines are unrealistic, micromanaging.. work hrs/load outdated equipment!", "Fast growth has resulted in some growing pains. For employees that are not comfortable with change, it can be challenging. But that growth also creates opportunities, which can stretch an individual beyond comfort zones. I believe that some of the negative comments are related to this.", "It is a small company, so not a lot of career paths, but is growing.\nAnyone desiring to work at Equus (especially from Global Mobility industry) needs to ensure there is a passion for software. This is not necessarily a con, but more of cautionary advice."], "accelerate diagnostics": ["If you want a job where you show up to \"do your time\" or don't want to take responsibility for the success of the company, this isn't the place for you. We are all expected to act like owners and this sometimes means taking on something outside the job description. If this doesn't energize you, it won't be a good fit.", "I am a remote worker and travel often but wish I was in Tucson more to interact with my co-workers more. But the Monday morning and Friday afternoon staff meetings where they review goals and projects keeps us connected and feeling like we are part of the culture.", "Talent management is self driven and relatively informal. Need to rethink how people's contributions and abilities are recognized/challenged. Poor communication as it relates to organizational changes.", "It can be off putting to work in a transparent company. If you are not used to working in an environment with minimal policies and open conversations it can be a little difficult to get used to at first.", "Brand new technology can take longer to gain acceptance."], "tapjoy": ["Communication has been an issue in the past, but I think the company is actively working on this by getting really clear about the vision/mission/values.", "hear more voice from the hands on guys, they are short of support.", "If you like your leadership with difficult personalities, condescending, and with huge egos, this is the right place for you. I have been in finance and it's really been the worst experience and job I have had. Zero appreciation. Bad company politics. Lack of diversity at the top. I have hard time with leadership in my area because of how we are treated. Forget about bringing up a new idea or ask any questions. Unless you like being talked to like a child. That's the kind of response you will get. Make you feel like your opinion doesn't count.\n\nTotal lack of support, respect and professionalism. It's been a very negative experience and most people are looking for a new job. Sinking ship. Stay away!", "- Poor onboarding\n- Poor visibility across the organization", "- Work/life balance was not always the best, simply because the teams are small and every person counts.\n- Communication between offices is always difficult, regardless of company"], "crestone peak resources": ["Organization isn't able to learn. See any business writeup for barriers to organizational learning for a description of Crestone. Long term incentive isn't. Org chart appears to be growing from top meaning no career growth. Leadership doesn't lead.\n\nI suggest finding (ie. LinkedIn) someone who worked organizationally near to your role to make sure it's the kind of job you will stay at.", "HR is nasty, spreads gossip and shares employee personal information. Most people don’t want to be here. Huge disconnect and discontent between field and corporate. Failing the PR battle with the community. Depressing. A lot of good people planning to leave."], "fundbox": ["Too many Bay Area kids who don’t understand what’s hard work and how to build a business. Management shouldn’t try to please the wrong people.", "Feels like mismatch between internal sf office cultures. Not the right environment if you want close mentorship and hand holding. Customers and revenue growing very very quickly which put a lot of pressure on the infrastructure", "Not enough job advice or feedback, management has no time for mentorship.", "Where do I start? Poor leadership with lack of experience. Smart people but not proper management for the stage of the company. Lots of turnover. Haven't raised money in forever. New products aren't taking off. Did I mention the turnover?", "Turnover is a real issue and concern. Especially on the sales, marketing, customer service and business development teams. We can't seem to keep any good employees. The new trend here is lots of female employees are now quitting. Executive team is not genuine or authentic. Only cares about themselves."], "western union": ["Takes much of your time", "Getting through compliance and regulatory loopholes within the company itself is not easy", "nothing, only thing is you have to work late.", "- Executive power grabs & lack of focus (i.e. teams will work on the same things)\n- Loudest person/team usually wins resources\n- No equity packages to all employees\n- SF office culture undulated with org changes; lots of org changes (and then power grabs)\n- Culture of 'lifers' in some areas, as well as occasional information/talent hoarding\n- Few Company Holidays\n- Underwhelming Talent Development Processes\n- Missed opportunities to do really cool work; market is quite niche, but cross-selling opportunities are high (but not prioritized)", "Senior management has no clear vision for future. Every 6 months strategy changes and they wonder why the sales team is unable to adjust to their ever changing expectations. The WU product line up has fallen behind the competition. We currently offer lower commissions to prospective agents and decent exchange rates with an annoying approach to compliance that will close new agents faster than they can begin to transact. New senior management feels that the best approach to sales is an antiquated car salesman approach from the 50’s. This new leadership has no clue how to run the US Market. Micromanagement has become the norm. While sales processes and activations are a struggle and out of the sales teams hands as the enrollment process is handled by a team in costs rica that is always understaffed thanks to the WUWay. Yet when there is a delay in the sales process you know who they are yelling at. This position in years past was an amazing opportunity, but the micromanagement has become a joke."], "automated business designs": ["Cons are how you look at them.\nIf you are someone who says this is the way I do it, then this is not the place for you. Group decisions / recommendations / advice from everyone are all part of this company.\nIf you are someone who is not self-motivated or a self-starter, needs someone to plan your day for you, then this is not the place for you. You need to know how to keep yourself going and know when you need to put the time in even if it is beyond office hours.", "Unprofessional, root management who does not know how to manage projects and people.\nThey are always, always behind schedule.\nConstant pressure. Endless working hours. Unappreciated employees.\nIf you want to be unhappy every day than it is the place for you.\nTerrible benefits, that cover employee only.\nNo flexible hours.\nAtmosphere of mistrust and fear.", "Management's approach to helping an employee and their unrealistic expectation in some areas", "To succeed at ABD you must be able to self manage, and you need to be proactive. It's actually what provides so much opportunity for the right person.", "CEO is insane, period. Prepare for no life but ABD, and they treat you like children. They have a signin/signout sheet, even for employees there for over 20 years. They drink after five which would be a pro except the expect you to work til 7,8,9 so you need to drink cause its your life. The culture is one of mistrust and constant observation to ensure you are not freeloading. Everyone is scared to death of the CEO."], "dolby": ["parts of strategy can be mysterious or indecisive at times. sometimes feels that the BGs behave like they are separate companies.", "Old technology, not cloud or AWS.", "Culture of shaming team members in public, no room for growth, frequent reorganization and layoffs (friends there were laid off without notice or severance). I was misled about role in interview and while the req was open, seems like certain groups under the CFO org bear all the weight while others are coasting by doing nothing. Happy to be on the other side, felt like I wasn’t valued and was a scape goat for a manager trying to cover up their own incompetences.", "- There can be a lot of meetings needed to move certain things forward. On the flip side, the processes feel thorough, and the right groups are usually involved in making decisions.", "2 camps that hold everything back. One are the long-time, entrenched legacy employees who are stuck in their old ways. Other group is the overqualified guys with PhDs and such who can barely communicate and hold the low level grunt jobs since Dolby was the only company to sponsor their work visas. 2 groups of bitter, disgruntled workers who rather not be here."], "raytheon": ["not much communication with your manager", "Work can feel a little less appealing due to workflow/processes. Most of your time is spent on PowerPoint Engineering versus your field of engineering.", "-Raises can be extremely competitive", "Have to move on to further career", "Government/DoD Regulations, Limited Office Space"], "blue canyon technologies": [""], "downriver community conference": ["Building is fairly old. Customers and get difficult on occasion. Most jobs are dependant upon federal finding year-to-year. Most senior level jobs are held by those with 30+ years with the DCC making it tough to really advance beyond middle management.", "Very low pay; it gets tiring repeating the same thing to customers day after day after day...", "Horrible for internal growth prospects unless you have internal connections with the CEO and his friends!!! Pay is absolutely below standard for this type of work and needs to be investigated. Staffing is always changing and have seen allot of turn over in the last 5 years - wonder why? Constant complaining from staff and customers takes a toll on one's person and energy", "pay is too low for the patience and diligence it takes to deal with angry customers. Offer more classes for career development for the patrons. workshops should be offered regularly and consistently", "Pay could be more, no real opportunity for advancement."], "box": ["Not many that I can think of", "None, great place to work.", "Not a stellar growth maybe due to the market in which the company operates.\nLot of pressure to get things done (GSD) but poor organizational structure to accomplish it.\nMany old timers left creating a vacuum", "No 401k match. In a transition period currently", "hard to sell the vision of an expensive \"nice to have\" in eyes of customers"], "chronicled": [""], "getaround": ["Sometimes people are too scrappy/inventive with how to get things done", "We work hard and we try to accomplish more than is possible -- this can be tough and means I need to take PTO regularly to prevent burnout", "Getaround is growing, and there will be pains that come with that process. However, for anyone with a spirit of adventure that wants to build something - this is a great place.", "Management has high expectations, not everyone will succeed here. To be honest, I really like Getaround because the company doesn’t tolerate lazy people.", "We could use more people on my team as there's a lot to get done. Hiring takes a while since we don't have recruiters."], "averity": ["Dont have any. Keep up the great work all around.", "None that I can think of!", "Unable to think of any cons", "-Need more diverse snacks", "You will be challenged every day to do your very best. (not really a con but a challenge)"], "topgolf": ["Long shifts from 9-5 or 5-close", "Was originally a food runner for several months doing the bulk of the work during my shift since minors really just talk and play on their phones. Management finally bumped me up to caddy. Just reward hard work when needed", "Lot's of work with popularity of venues.", "far, short breaks. tiring, uniforms", "The hours are long and on your feet the whole time."], "thumbtack": ["The company does have a decent amount of turnover lost to bigger companies which can create a times of unease.", "- Career growth (it's absolutely trying to be improved upon but it lacks strategic internal growth opportunities)\n- Transparency is half-hearted", "Hard to think of any.", "Haven't had an opportunity to mingle with engineering and product development yet. I'm on the marketing side, but would be nice to rub elbows with the folks building the product/platform.", "Benefits are lacking since they are a startup but are fine."], "piper companies": ["Cannot think of anything at the moment!", "Traffic from the Tysons Office can be tough. Luckily there is a free gym and a nice bar on the building's campus that you can utilize to kill time so traffic can die down.", "While I don't have any specific cons, it is worth noting that the Baltimore office has very high expectations in regard to work ethic and mentality. This is one of the primary reasons for the Office's early success. If you are not prepared to work in a demanding environment, this is not the right position for you.", "There are no real negatives to working here at Piper. The amount of success you have is based on the amount of work you put in, which is easy when you're consistently motivated by your coworkers.", "I honestly can't think of any!"], "atlantic group": ["-If you want a typical 9-5 job where you stare in front of a computer screen all day, this is not the place for you.", "i have no complaints at all - i love working here.", "-If you need to be micro managed to get your job done, this is probably not the place for you.", "-Horrible culture only getting worse\n-Tremendous turnover (over 15-20 people over the last 2 years)\n-They look through your private email if you access it from your work computer. They found out I was interviewing this way and it was extremely uncomfortable.", "Sometimes too many jobs to work on, gets overwhelming"], "etsy": ["Stagnant work and vision. Will be interesting to see what the future holds.", "The cult of Etsy could become a little overwhelming in terms of the social office atmosphere.", "1. Communication and data between teams doesn't flow freely but rather siloed and selectively. A handful of negative players appear to thrive here creating unhealthy friction.\n\n2. The PM role lacks a strategic outlook and there is limited growth opportunities. Most are essentially pushed to manage projects, not deliver outcomes.\n\n3. The PM org is being run by someone that never worked as a product manager w/ a management team that hasn't led product at scale for consumer tech businesses.\n\n4. It's not a learning culture. At the end of every quarter, for example, there is a freakout, reshuffling of teams, tactics, etc. because some unrealistic goal(s) won't be hit.", "Hire & Fire company. I worked for Etsy for 1 year, 1 week and 1 day. My management changed and the new manager never liked me. I had a mostly ok review and then one day I found out I didn't work there any more.", "Managers aren't always held accountable for people management - more emphasis on project management."], "slack": ["Don't have anything negative to say....", "- Typical growing pains of a hyper-growth company, things are changing constantly but it's an incredibly exciting time to be working here!", "No downsides of working for this company", "Only intern in my organization", "• Despite Slack's diversity PR, some women and minorities still experience horrible things/sexism/lesser treatment there just like any other tech company. There's more than one case of a perpetrator not only not being punished because of incidents but being promoted. Internal surveys continually reflect the dissatisfaction from URMs and virtually nothing is done. It feels awful when the company is telling a story externally that is divorced from the realities many employees experience internally.\n• Senior leadership is extremely hit or miss. You're as likely to find inspiring leaders as you are to find people solely focused on building their personal brand/driving readership to their blog instead of doing any real work.\n• There are management chains completely devoid of accountability, where a bad manager reports to and is close with a bad manager who reports to and is close with a bad manager… This is as demoralizing for direct reports/peer managers as it sounds.\n• Your Slack experience is highly dependent on which department/team you're a part of e.g. someone in CE or Design is much more likely to report having a far better experience than someone in Marketing or Product, but it also varies highly from team to team within each department. Do your due diligence on the team you're joining.\n• The monolith of a codebase has finally caught up to product/engineering. Everyone's heard about the recent weeks' long code freeze but development velocity has indeed slowed to a snail's pace. With more and more large enterprise customers coming in, a rumored IPO, etc, it's unlikely this will turn around in any substantial way. This is extremely tough if you work in Product/Design/Engineering.\n• Slack's culture is \"too nice\" — people tend to be passive-aggressive and avoid difficult conversations/feedback. Poor performers who make it past 3-6 months are almost never managed out. The foundational values of the company like Empathy/Courtesy were well-intentioned but not fully thought out and the consequences can be felt now.\n• The reward for doing well is typically being driven to burnout — many high performing employees are barely making it to their 2 or 3 year marks, let alone 4 years or beyond."], "rethink": ["contract based employment without benefits"], "technology resource group": ["None. Fun workplace with opportunities to learn and grow professionally.", "Don't pay in corp to corp contractual obligations.\nNo reply to emails or phone calls.\nNot trustworthy.", "They avoid paying until the very last minute. And even after they agree to pay you, it's still like pulling teeth. I needed to use the client to pressure them to pay me. Won't answer phones or emails. Don't think they actually have a base in USA.", "Have been sub-contracting with TRG Inc since late last year. Contract specified that payments were to be made in 45 days after month end but never have invoice payments been received on time. The accounts payable dept does not pick up the phone or answer any emails when asked about payments. Getting ready to take legal action against the company.\nBeware when working with this company they treat people poorly!!", "nothing as such, good to start"], "mintigo": ["None, great place to work", "unorganized employee management, lack of information sharing from high management", "CEO has no capability (or will) to motivate the employees, only care about getting more customers. And if you decided to leave (even after more than a few years), he may hold a grudge towards you.\nAnd the policy of chasing the competition is a joke. Instead of leading, we spent half the time doing what our competitors already did.\n\nVP R&D is a great person, but seems to be \"tired\" in the last few years, could have taken the R&D way up if he put his mind to it.\n\nUnorganized product management process, making developing new features long and tiring.", "Unprofessional team leader.\nhigh management acting like army unit.\nReally bad in employee retention.", "There is no underground parking.."], "compugra systems": ["In all the years I’ve worked here never have had a problem with anyone.", "Everything - No pay to employees - Will keep for 6 months and only give 50 to 60k and keep remaining 50k to 100k every year.", "- Compugra will make sure that you never get your hard earn money on time.\n- You get partial Payroll and the other half gets processed about 5 months late if you are lucky.\n- If you have expenses paid Project work it may take another 8-9 months for them to reimburse you. Good luck getting your reimbursement when you leave the company or your Project is completed.\n- You will not be able to have a goodnight sleep. You and your family will suffer with stress and anxiety due to the uncertainty of the payroll process… not sure if that is improved now.\n- On researching further you will find more complaints about this company. Just google it.", "Company will take money from Vendor and never pays to employees.Never pay salary on time and and delay for 6 months ..compel you to leave the company so that V Ram can eat your money", "No cons with Compugra Systems Inc.."], "atlassian": ["Can't say anything bad at this time.", "There are constant changes and the burnout can be high because of hyper growth - all companies in this stage go through growing pains.", "Maybe more parking for staff in building.", "No drawbacks really - Work life balance is excellent", "Inconsistent management styles, nepotism, and navel-gazing."], "career technical institute": ["Located in Downtown DC so parking is expensive.", "Management micromanage too much. Need to be more free", "This place wants you to follow the students for 30 days til the financial has been submitted and the students are on their own. They do not care at all about the students welfare just the money. You will not get a job in your field of study. This place is a REAL JOKE. RUN, RUN, RUN.", "Everything, unrealistic goals, management gives you bad leads for the first month still expecting you to make stuff happen. Poor training.", "Worst School Ever! Turnover is ridiculous which extremely effects the education of students. Especially the medical programs!!"], "sesame workshop": ["No cons, except hard for me to get there on commute", "Some mediocre employees at middle management", "Pay was below market, hard to advance, employees get content after a while", "Too much bureaucracy. Could be improved.", "Top-heavy organization with a lack of understanding by executive and senior leadership on how much of a burden is placed on lower level employees holding down multiple roles at once due to limited resources and constrained budgets. Significant gap in compensation between the highest and lower-level (levels 2-5) employees. Bonuses awarded only to levels 6+ (director level and higher) ; all employees regardless of level seem to receive an annual 3% merit/cost-of-living adjustment. Growth is stifled by senior executives, going 'above and beyond' ones role is not met with opportunities for promotion, which breeds a culture of apathy among those who have been there for many years and pushes talent out the door where they will be recognized. They are trying to diversify their staff, but there is still significant room for improvement, especially at the most senior level. Differences of opinion are not as welcomed as they would initially have you believe. Very meeting heavy, more often than not too many cooks in the kitchen, takes a long time for ideas and decisions to make their way through the proper channels."], "transwest": ["There was trouble finding the perfect fit for a manager, but only because it was a new store and new location. There was an adjustment period as there is with any business.", "This company is run with the “Good ol’ boy” mentality. If you aren’t “in” with the family, know someone in the family, have been there for 30 years or are a woman, good luck progressing. The sales environment is exhausting and you won’t get any positive feedback. Be prepared to deal with back-stabbing, being thrown under the bus and tons of disappointment. If you have a thick skin and aren’t expecting any type of advancement, you might be able to make it here. HR is pretty much useless and non-responsive.", "Many people in place that should jump on board to the current century and how you run an organization. Run old school. Managers do not defend their employees.", "Management doesn’t listen to the people on the floor. Promoting people that don’t have experience or knowledge into leadership positions. Not having the ability to schedule or run a proper meeting.", "Raises are often years apart, benefits are in decline. Old boy network that will leave you dumbfounded in 2018."], "qumulo": ["-As with any fast growing company, communication could be better across departments.\n-There is a ceiling to your career growth.", "We're growing fast and sometimes communication across the company isn't quick enough.", "No cons to report on.", "Qumulo is quickly becoming a mainstream enterprise standard. Fast growth is exciting but it also creates the need to build a full stack of revenue performance indicators and metrics to enable scale.", "-Tough product to sell given the market\n-Not much training provided for advancement opportunities, if you want to advance and improve, you need to start doing the job you want before they promote you\n-Hard to move to different departments once you're in one\n-Disconnect between finance and sales\n-Marketing doesn't generate many quality leads"], "dividend finance": ["None cons come to mind.", "I can't think of any cons.", "Job stability, lack of opportunities to grow, not a lot of communication between different offices on industry current events,", "Np cons to mention right now."], "sony": ["Hours can be long, but results have been showing. Small organization, running lean and mean. Career upside is present, but limited. Not for everyone.", "No upwards growth, only limited lateral moves. Layoffs every end of fiscal year, which makes it very stressful and uncertain every year. No pay raises (1-2% average). Additional workload and reduced workforce. Silo environments. Meetings for the meetings for the upcoming meetings. CYA is a staple of the day to day. Aging company.", "The vacation policy is not ideal.", "limited flexibility to work from home when needed, lack of growth opportunities due to combination of weak market for Sony products and dominance of international assignees in management structure.", "a bit too bureaucratic at times"], "roblox": ["Nothing particular at this moment.", "None come to mind.", "Open concept office can be distracting at times.", "I do not have any cons to report", "Kinda startup, but it's been around for a while and codebase was somewhat far from modern."], "zipcar": ["We are not a startup with VC funding and all the material \"perks\" that might come with that, we are a mature company with tangible constraints and real problems to solve.", "management seems unhappy with engineering output. they keep trying to hire more people, faster, but that isn't going to solve the problem of doing too many things at once. too confusing.", "Starved for funds by parent company keep Zipcar from being able to compete with Uber, Lyft or Amazon.", "Wages are low compared to other companies. Zipcar has done multiple rounds of layoffs through the years and has expected the remaining staff to pickup the work off the employees that were laid off.", "Too many snowflakes who don't have the hustle and grit to really turn it around. LT seems to be riding it out until it becomes just another logo for the parent company to manage. Starts at the top and when members and employees have concerns and ideas, they're all but ignored. Employees also have next to no career path making for an impossible leadership position."], "doran jones": ["Can't think of any at this point of time.", "- None at the time of my employment", "Didn’t find anything negative so far.", "It's a startup company and cannot provide with vast variety of benefits.", "Senior managers make promises (many, many promises) regarding pay, bonuses, vacations, and benefits and they managed to fail to keep ANY of them.\nThe benefits were outrageously expensive. At my new company, I am paying one fifth of what I had to pay at Doran Jones and I have a much lower deductible.\nThe management team appears out of touch with how modern tech companies operate. They have a dress code for developers who are working off-site away from the DJ customers. They watch the clock for when employees arrive and leave and do not look at the overall work being completed. They are quick to criticize and slow to reward.\nThe company does not have a sales team and rarely brought in new clients."], "taulia": ["There have been a few times that folks have left with a sour taste after being let go for whatever reason, or not agreeing with a leadership decision, which is bound to happen in any company. It can be really vulnerable to lose one's job, so the sentiment is understandable.\n\nSince it is a startup, it also makes sense that there are operational inefficiencies that have grown and needed work in the past (and currently) in most departments. However, many people find that part of it invigorating.\n\nResources are not always available in the capacity that everyone wants it to be.", "None at this point. So far, so good!", "No real negatives. Minor items - remote employees do not enjoy the benefits provided to office-based employees. No 401K match.", "Due to \"young adult\" phase, not all processes are built out (yet see above)\n\nSome teams are stronger than others\n\nNot enough resources to get everything done that you envision (but it's for a purpose...no more funding rounds, time for Taulia to be financial self-sufficient)", "- 401k match would be nice, but not critical as the pay/bonus/perks are pretty generous\n- Some department may need more head count as work is piling up. Company adding more people but not necessary at the right places.\n- Need more process documentation for each department. This includes department process and work process."], "zemax": ["The company often engages in multiple initiatives at once, which - while exciting - can make it difficult to juggle all of the work.", "The only con for me is that although the benefits package is extremely competitive (yay for 401k matching!), the health insurance isn't the best I've experienced in the Greater Seattle area. The coverage is great but the monthly premiums and copays are more than I've paid while employed at other companies (Full disclosure: I may be spoiled by having 100% employer-paid premiums in the past).", "- Lack of communication at times, promotions/changes sometimes happen with little warning\n- Few documented policies/procedures. It would be nice to be able to look up what the policy is on bereavement or medical leave, but I'm not sure where to do that.", "As with any small company, some may find resources not readily available and need to participate in building the resources.", "I haven't had many negative experiences personally, but I do think that the way the company approaches corrections to individual performance could be improved. It seems that if an employee isn't performing up to standard, in many cases that employee ends up being terminated or quitting, rather than actually modifying behavior to go on to be more successful in his/her role. There are also times where it outwardly appears that poor behavior goes unmanaged entirely."], "illfonic": [""], "snapsheet": ["Lack of realization that certain teams need more people.", "I don’t really have anything substantial worth mentioning", "When you start working at Snapsheet you are forced to work their horrible 10am-7pm shift. You are not given a choice when hired, if you want a job at Snapsheet you are reduced to working these grueling hours for over six months until they decide they can offer you a shift change. Six months isn't even a hard time frame of working the late shift, some employees are waiting up to a year for a shift change to be offered. At that point, employees have to request a shift change, but their managers will not respond right away with an answer.\n\nThe 10am-7pm shift made me feel awful and it messed with my lifestyle. When I wanted to work the earlier shift, it took management a month to tell me I couldn't because of the CSO team I was on. This took a toll on my mental health, I felt like Snapsheet did not care about the well-being of their employees. It was very insulting. I started to see it with how they treated everyone in CSO, not just me. It's upsetting that this company asks you to adapt to their ever-changing processes and business needs but they will not adapt to their own employees' needs.\n\nManagers in CSO are all different. They do not seem to adhere to the same expectations, disciplinary actions, or management style. Basically, you have cool managers and strict managers.\n\nPromotions seem to go to management favorites. You will see hard workers get passed up for promotions but instead see the person that doesn't know how to do anything get promoted because they know how to grovel to management. It's very sad and disappointing.\n\nSnapsheet treats their CSO department, for lack of a better word, like \"bottom feeders.\" We are not given unlimited PTO like the other departments. We have to log in when we use the bathroom, which is so demeaning and invasive. If we do request time off, it's such a racket with managers and department heads. They do not make it easy, which is very frustrating.\n\nQA brings down morale and does not align with good accolades you get from your managers. QA is not consistent with their audits and they are very subjective with their feedback. They do not like getting feedback themselves about how they run their department.\n\nThe work is easy, outbound/inbound calls, sometimes customers and shops are rude but you get through it. It is still a customer service job. Once you get used to types of calls you are assigned to do, they change your workflow out of nowhere. QA would then will give you a bad audit that first week of your new workflow, there is no grace period to get used to your new assigned work. It was unfair and upsetting to see QA tear apart your calls.\n\nThey had a Saturday shift rotation which was infuriating. I don't care if get a random lieu day off during the week, I don't want to be downtown on a Saturday. I want two consecutive days off in row to mentally decompress from the grueling days of Snapsheet.\n\nALSO, they don't give you desk drawers. you have you things just under your desk with privacy or protection.", "- Working in a startup-like environment can be stressful\n- Company is growing faster than roles are being staffed", "-Some of the depts are on different pages with minor protocols/processes. To be expected though... no company is perfect. Doesnt hinder work/productivity."], "chameleon power": ["None, other than it can be cold some times in the back area.", "Owner is a complete idiot! He yells at employees on a daily basis degrades staff and is unprofessional! Do not work here for any reason!", "Company:\n- Poor management.\n- Unwillingness to act on new ideas.\n- No project ownership by anyone, leading to dysfunction\n- Management dysfunction exacerbates issues out of control\n- Sales team doesn't understand what they're selling.\n\nOwner:\n- CEO watching you work via cameras (and Micromanages employees).\n- CEO doesn't understand products he's selling despite owning company for 20 years.\n- CEO doesn't honor 2 week notices.\n- CEO will try and stiff you on your final paycheck, or nickel and dime you out of money.", "-Uses demo/trial programs to complete client work\n-No design direction for projects\n-Projects often exceed deadlines\n-Contracts are incomplete/lacking enough info to complete projects\n-No competitive pay for employees\n-No honoring of two week resignation\n-No change in pay as job task are added to workload\n-Lack of managements attention during employee annual reviews\n-Management/Sales do not understand the process of projects they sell\n-Employees/management are micromanaged\n-Uncomfortably cold work temperature (Employees wear gloves/blankets while working)\n-Broken chairs/desks\n-No addressing of employee concerns\n-Non professional work environment/building (cracked glass/missing ceiling tiles)\n-Use personal accounts for work\n-Unorganized management and meetings\n-Outdated systems/processes\n-Owner is stunting company growth", "not very good pay compared to others in the same industry. too much favoritism. certain departments get more attention from management than others. very unorganized in many ways, all the time."], "square": ["Compensation does not always align with feedback, low focus on performance based compensation", "As with any innovative company, sometimes process struggles to keep up with the pace of growth.", "Very hard work, not a job you can just show up for.", "None - great mission, great compensation, incredibly well run company", "I feel that compensation could be better - a 3% raise every 6 months doesn't show that the company values the work I put in."], "vybrant": [""], "wheelwell": [""], "mixpanel": ["Mixpanel is an extremely technical product (hence can take some time to ramp up unless you have worked in the analytics space before).\nPlenty of competitors in the data analytics space so sometimes can become hard to stay competitive since we are not a very big company and still growing. It's crucial everyone who works here understands how to ruthlessly prioritize which can be challenging sometimes.", "There are a lot of things to learn and be involved in, but career progression and plannng is not a priority.", "Communication from top to bottom...", "The only negative at the moment is that the passion everyone has for the company and work can translate into long work days at times. Leadership is generally good at promoting internally, so there’s a payoff if you do well. Also, a larger amount of interesting and meaningful work beats being just another employee at a non-growth company, but that’s of course a personal preference and may not fit everyone.", "There were a couple past years of stagnation."], "ramp group": ["Progress of the employees on post delays so much from years and also they lacks labour satisfaction and employees duty time I'd day and night also", "Poor fund management, dependency on old and inefficient employees.", "Very poor support from back office and parent co.", "Top management not always very approachable", "There is no exposure to your career and they will not promote on performance."], "cockroach labs": ["Not much, to be honest", "Personally, I had trouble switching from work when I came home - kept on thinking about the problems I'd been solving because I found them very interesting (not sure if it's a con and the company's fault though)", "at a loss on this one", "- startup company with some risk", "No downsides at this time."], "the washington network": ["Some seriously insane coworkers at this company over the years. People who hid drug issues, came in late constantly, picked fights with management, stole company property. You name it. I suspect it's was/is a symptom of the local DC job market.\n\nThe CEO is an opinionated leader with a track record to back up his point of view. That can be challenging to navigate at times but when dealing with competent and hard working staff he was always very reasonable and open to input.", "Boss is condescending and the environment is not conducive to learning new technologies.", "Lack of middle management means that the employees have to answer directly to the CEO. CEO is pretty clearly a raging narcissist who is incapable of clear communication with staff; is verbally abusive toward employees when miscommunication arises.", "The owner of this company is verbally abusive, manipulative, and cruel. I lasted for less than a week and started to experience chest pains. He was charming and nice during the interview, and then the first day was less nice. The second day, he started to berate me and I had to spend hours listening to him talk about things that made no sense. He started to make offensive comments. I overheard him mocking a co-worker's accent. He asked me why I looked so scared and if \"I had ever been beaten.\" And many other really inappropriate comments. Horrible, horrible, nightmarish experience. He seems insane. I reached out to a former admin. asst. who told me the same thing happened to her, but she was able to stick it out for almost a year. She said she didn't know how she did it.", "No internal infrastructure, no leadership, arguments and miscommunication between president and staff daily, depend on a company in CA for training, president has no sales knowledge or philosophy, waited two months for medical benefits, never received them."], "crossroads christian church": ["Non-profit means you're underpaid for your job's market value"], "zapata technology": ["They are results focused, and employees are expected to produce and do their job well. I would not recommend this place for slackers.", "Working for a small business can be tough on some, so know that it's a big boy/girl environment, slackers are not welcome. Again, great for those wanting to grow and excel in their career with a company that is growing fast, but not for those that want a 9-5 with bosses telling them how to do their job.", "Terrible medical plan.\nNo tuition reimbursement. They may claim they have it, but when you go apply for it and you about to receive it, then they will terminate you, so they don't have to pay out the money.\nThey will lie and say you were fired, when it was a lay off.\nThe company is just a glorified hiring agency.\nDon't take the job. Just say no.", "I don't have anything bad to say.", "None that I can think of for me"], "breaking ground": ["horrible commute from brooklyn to manhattan", "Overwork employees and unexperienced upper management", "Where to even start... upper management doesn’t care about you at all and behind your back they’re all throwing you under the bus with HPD. Keep all emails cause they’ll blame you for everything unless you can prove them wrong. So many conversations where I’ve heard the assistant director and directors saying to blame the staff for not doing the correct thing that they tell you to do and they Refuse to take responsibility for anything. Pay isn’t worth the work load, they start about 36k a year and only give between 1-3% raise with no bonuses. They’re don’t make it easy to want to stay. This is just a little bit compared to what it’s truly like working at this place.", "Management in my building show ALOT of favoritism.", "Pay Rate Stays THE same. No raise"], "bleacher report": ["Sometimes too chill in the office.", "Can be very \"clicky\"\nPromotions are based off how you fit in more so than your merit", "no clear vision on advancement", "Management is hard to communicate with, hiring process for team members takes months", "At times a little clique-y but if you put yourself out there everyone welcomes you. Some positions offer more flexibility than others in terms of working from home, but that is the name of the game when covering sports."], "cecelia health": ["Client base expansion makes it challenging sometimes to keep up with requirements", "Like every company, there is the need to prioritize process improvements and technology enhancements.", "If you are even considering for one second putting your career, family and health on the line for this disorganized \"start-up\" that is going down faster than anyone wants to admit, then please stop reading this and move on to the next job opportunity. This company is the biggest contradiction to the Core Values it claims to live by than anything in the business world I have ever seen. Their incompetent lack of efficiencies and respect is quite frankly disgusting. The inefficient and hostile work environment includes being under a microscope 24 hours a day 7 days a week. It never ends and it will never be good-enough. There is no trust, and no adoption of new ideas. Be prepared to be on video calls ALL DAY long and into the evening. You must be an extremely amiable and agreeable individual with no bright ideas to be welcomed here. There is not an ounce of work-life balance, whether you have a child or a sick relative or get diagnosed with a life-threatening illness, it can't get any colder at this place. For a company that prides itself on caring about the physical and mental health of it's patients, it will run your own health right into the ground.\nIt is just really too bad that the leadership is full of unequipped egos that are constantly stepping on each other that this organization will never get their act together, and they've about run out of time.\nPlease note that this review is not from a \"disgruntled\" ex-employee... which is what they will tell you (also, make note of the generic nature of the positive reviews here) this is from a human who would honestly feel terrible for anyone else to go through what dozens of us have that have been let go in the last year!", "This is a young company. If you are not keen to building out your own systems or processes, then this would not be the place for you. On the other hand, if you don't mind starting at the beginning, and building your own infrastructure, you will have landed in the right place.", "The CEO micromanages everyone in the company. It’s is not only annoying, it is also inefficient and ineffective. Check the turnover rates of employees and you have proof of this problem. Ask anyone in the company (in confidence) what they think of the CEO’s management style, and you will learn the truth of the dysfunctional nature of the company. Changing the company name won’t change the way the company works."], "fred hutchinson cancer research center": ["- The cafeteria food is very healthy but also not very good. It's also overpriced.\n\n- No on campus gym or recreational areas.\n\n- Some projects are mind numbingly boring, and there are a lot of processes that are currently delegated to statisticians hat should be delegated to nonstatisticians.\n\n- The pay is what you would expect for a non-profit.\n\n- Initial vacation time is only 2 weeks. This is not competitive with the private sector for which 3 weeks is fairly standard.\n\n- Vertical advancement is limited.\n\n- The organizations efforts to implement new regulatory standards has created more bureaucracy, making it harder for people to do their jobs.", "I left because the pay was too low. I found something with better pay.", "nonprofit, so pay isn't as high as other places in seattle", "Difficult to grow out of a given post. Salaries can be low considering how expensive Seattle is.", "Currently none at the moment."], "virginia hospital center": ["Cant think of anything negative for this hospital", "Nurses are paid better at area hospitals\nER nurses have too many on call hours", "- Pay is not competitive\n- Lack of proactive approach to professional development\n- Work politics and lack of willingness for conflict resolution with personnel", "No night shift support, pays less than other hospitals in the area.", "Work life balance is exceptionally poor. 10 hour days are a regular expectation. Position is salaried with near 0 hour flexibility to leave early to make up even 30 minutes.\nUtilization review- you will be asked to approve base on md preference IP for cases that are clearly OBS on Medicare criteria.\nManagement can be unprofessional with interactions with staff.\nThere had been massive turnover in the department in the past year- more than 60%- not one thing has changed and HR has done 0 investigation or exit interviews.\nYou will work weekends and holidays for nothing alongside staff that are making time and a half.\nStaffing assignments are not equal and punish the stronger Staff.\nFeedback is listened to, but rarely any action.\nExtended time off is difficult to get- you may are likely to end up with partial approval of your vacation with the expectation you work the Monday’s or Fridays.\nThe morale in the hospital is horrible. Most staff is very unhappy. Most units have an average experience of under 1 year."], "tecture": ["It's a fast paced environment, and you need to be ready want to learn. This is not a job for those who are just looking for a job to \"get by.\"", "Haven't come across any yet!", "Long hours without compensation for it\nSmall company, so not so many large projects, but cool non-the-less\nA bit of a relaxed environment allows for other to goof off sometimes too much"], "northeastern illinois university": ["expectations are a little too high for university", "The hardware may need some update", "Very little room to grow and/or be promoted. Few opportunities and resources for professional development. The job security of those who have worked there for awhile encourages employees to do as little as possible and to be ambivalent of opportunities for improvement.", "Pay is very low, hard to live off salary", "Pay\nNot a lot of overtime"], "perpetual": ["Management structure, Lack of opportunities,\nOld clunky systems, Silo mentality", "Way too much office politics and us vs them mentality between teams. People often rewarded for poor behaviour (borderline bullying) with promotion. Management often treat teams as if they are students at school - immature mentality.", "older work systems need upgrading", "Should focus on strategy of business", "Terrible pay and very unstructured training"], "symbia logistics": [""], "empower": ["Increased opportunities for hourly employees", "NO diversity and lack of respect for employees.", "No compensated well enough to risk your life.", "everything else about this job is horrible", "Corporate environment, lack of defined vision amongst management to make impactful, quick decisions. Has a big company feel which makes it seem like things take a while to get done."], "braintree": ["Hard to have any upward mobility", "Owned by PayPal, more and more Braintree is losing it's startup identity.", "Your experience is going to different drastically by team; poor performing Managers can really break your experience there, and unfortunately Senior Leadership was often willing to not act on feedback about toxic managers. There's also very little opportunity for career growth; there are plenty of really smart and talented people who have nowhere to grow because their teams aren't structured in a way where everyone who is capable of more challenging work is given that opportunity.", "bad management, people are all over the place", "- No significant growth opportunities unless you are a dev\n- Underpayment is justified by benefits\n- Free lunch causes you to work more\n- Late nights working due to understaffing\n- High turnover across most teams\n- \"Unlimited\" vacation keeps people from taking vacation\n- The company is not yet in the mature phase so there are no standard processes and the key decision makers are often a \"clique\" within departments"], "smartlink": ["The pay is not so good, but for an entry level job it is.", "Some months salary will be late. Due to long term projects and when project is successfully finished every member gets bonuses, But only if project succeedes."], "microsoft": ["no Cons, its a great company to work for", "Brand on Your Resume: After many years of losing market share and struggling to be at the front end of innovation and the fact that there's 90,000 employees, don't think MSFT is necessarily going to be attractive on your resume to more agile and smaller companies.\n\nManaging Your Career: Make you say this out loud so it registers - 90,000 employees work there. Double that for vendors. It is VERY hard to \"stand out\" and move up in the company. Don't expect your manager to be much of an advocate or enabler to help you meet your career goals - they are basically trying to survive the stack rank every year too. Not familiar with the stack rank? Check out the 2012 Vanity Fair article called \"Microsoft's Lost Decade\".", "Lots of room to still grow.\nStill significant favoritism and politicking\nInconsistent middle management, misalignment between leadership layers", "good work life balance and benefit", "It can feel sometimes that there is too much of \"process\"."], "bully pulpit interactive": ["-Partners and Senior Management are great, but some directors could use development\n-Large portion of staff haven't held other jobs outside of BPI, sometimes leading to a lack of external perspective", "some interesting personalities work her.e", "Can be disorganized, but really it's based on how busy the office is", "Disconnect between senior leadership and everyone else", "-Start-up feel and fast growth creates at times has created growing pains\n-Long hours at times for client needs/elections (not a surprise in this industry)"], "gobble": ["- Because the company is moving fast, it's tough to document all the ongoing projects in a very detailed way. This can mean a steeper than average learning curve when starting work on a project.\n- The engineering team is now spread out over 3 offices, and working remotely can bring its own challenges (more challenging to collaborate, time-zone differences, reviews can take longer than expected).", "Should pay more and lacks communication", "Discriminates and allows sexual harassment.", "Sometimes, work done ends up going nowhere but that is expected when working with such dynamic startups. More planning and communication will always help.", "401K benefits are not provided yet."], "splunk": ["i have know cons now", "Scaling for the extreme high growth is weak. But, I guess it comes with the territory.", "Managers micromanage and sometimes treat us like we're incompetent.", "Improvement has been made in this area over the past year but it took too long to identify and move out employees who did not uphold Splunk’s core values. Many have since left the business which is good and has improved our culture but we need to see deliberate focus on maintaining good people and move quickly to identify employees who are poisonous to the team.", "Consider Improving the benefits. The fact that we don’t provide free health club membership is antiquated."], "samsung": ["Work comes first! Need better work balance", "There is little work/life balance. My life was all about work, work and work.", "Zero work life balance, unrealistic weekly work goals, everything is a fire drill, never knew how your schedule is going to change.", "Korean HQ micromanagement\nShort range thinking\nInternal procedures are horrible\n1990's IT technologies.", "Cultures are different and most of time to work with Korea in the night."], "venesco": ["I really cant think of any cons about this company!", "No cons, but Venesco is not for people who want to coast.", "The cons are the same for most contracting companies. You don't always know your management that well and you don't have many opportunities to get to know the other employees.", "I did not experience in problems with Venesco.", "None presently at this time."], "nurx": ["It's growing so quickly that you have to be a true self starter to keep up with the pace.", "That I didn't start working with them sooner.", "- We can use a microwave", "The company is new, so normal growing pains of getting SOPs, policy, stuff like that, can create some questionable times. Nothing I've seen that would sway anyone from working here though. I love it!", "With growth comes pain and the company is still in maturing. There is still a need for some structure and more clarity on roadmap but this is indicative of working in a fast-paced start-up that is growing very fast.\nCommunication can be improved amongst those is senior level management - but many are new leaders."], "cardinal intellectual property": ["Not much to complain about, if you are looking for a gig that is going to change the world, this place probably isn't for you.", "It’s a production environment so you’re treated like a number and graded only on the numbers.", "Paid by case. As a result, some cases are harder than others and take longer than other cases without the additional pay.", "depends on your relationship with your manager, pretty much have to self-teach yourself, so be ready to fall a lot at the start before you start to run.", "I can't think of any"], "taylor farms": ["Advancement opportunities can be challenging", "Takes a while to understand the business if coming from a different industry. There are a lot of moving parts. Projections are largely self managed.", "Don't know where to begin, could write a book", "Miscommunication, Disconnect, No accountability,\nAccusatory Atmosphere, Lack of resources", "Orders very sporadic. Sometimes throws the day to day operations off -balance"], "agentis energy": ["- Employees are all very busy and stretched thin....need to hire more quickly when need arises\n- Job descriptions are not very well defined...everyone does whatever needs to be done, but not clear differentiation between some roles", "Bandwidth - We've grown so fast that everyone is really stretched. The big hiring push should help a lot but right now its a lot of jam-packed schedules.", "I enjoy challenging work so I have no cons thus far!", "- None yet! It is a very encouraging environment!"], "eventbrite": ["Tough to stay on task with too many priorities and not enough resources. At time the right folks aren't in the room (and it doesn't always have to be the most senior leaders in the org).", "If you are in the support teams you're unable to take advantage of many of those features. We do not get holidays off, and the unlimited PTO doesn't apply to us", "Dev environment and release process need improvements. There's still a lot of work to be done to break out of the monolithic codebase.", "The internal development environment has been really difficult to work with in the past - lots of lost time and productivity.\n\nWe don't have an official QA department. That sometimes is a bit concerning.\n\nSometimes our internal culture isn't as cohesive as I would like - both SF wide and engineering as well. I do feel connected to other offices, as we have had opportunity to visit and work with each other which I feel grateful for. But I thankfully have friends across all the departments, which makes it feel a lot smaller.", "Nothing honestly, other than pay."], "roostify": ["Open plan setting can be loud at times", "Weak Management, No direction, no cooperation. In some of the hired people we don't know what they really do and some people take working in this company as granted and they just come to office on few occasions. Remote employees work way better than them, and some of the onsite people never do their job properly, one can't simply understand why we they need to hire an employee just for talking and even the talking to clients is not properly communicated. And yet these people are paid more than who worked day and night without any appreciation. In general, there is a lack of focus on the application and no global expansion.", "- A bit of indecisiveness around future direction\n- Cultural segregation between business and technical teams", "It would be nice if people from various teams spent more time together. Even just lunches here and there to keep everyone more up to date with the day to day of other work functions.", "Of course, not everyone will feel the same as you can see in multiple reviews here some people complain. However, in my experiences, almost anytime when I feel frustrated it's because I didn't get it right, either I took wrong approach, I didn't get the full picture, or I didn't make enough efforts to deliver."], "methodica technologies": ["Nothing specific. If at all there are any, the organisation is always ready and willing to rectify any such flaws.", "There is nothing Neg about the Company!", "Nothing much.\nMedical insurance premium is little high, but the benefits are excellent and overweigh premium.", "I did not find any cons.", "Sometimes work is too much and gets less time for yourself."], "west corporation": ["None at all , great job", "West gets bogged down by bureaucracy. Once you get outside of my section of the company, it gets much more difficult to make changes, even if they seem obvious and have been \"in the works\" for years.\n\nWest is a large company and it is not uncommon to feel that you are just one cog in a machine.\n\nUpper management has a tendency to make changes to benefits or programs and spin them to appear like positive changes, but which actually harm employees. The company has made 3 major acquisitions/mergers in the 3 years that I've been here (along with many small changes) and this has resulted in promises and policies made by the company not being honored down the line because the management team or our priorities have changed.\n\nThey do seem like they are doing better lately, but take everything you hear from the top levels of management with a grain of salt.\n\nAlso, sometimes work can be uneven. Overwhelming one week and very slow the next. Luckily, Christmastime and summer are the slowest seasons for my team.", "Trainer was ineffective- spent too much time on personal anecdotes that were irrelevant. Company also was too quick to bend to their client without realizing how their business/front line reps would be affected. Communication from top to bottom was poor, resulting in violations in policy.", "Unclear direction of organization, silo'd workforce", "Can get stressful during system issues"], "autodesk": ["My only complaints are site specific and not at all complaints I have with Autodesk.", "Not many except for the fact that i was the only data scientist intern on the team surrounded by software engineers so collaboration wasn't as what i expected.", "Experienced individual contributors and middle managers need more visibility and guidance about career advancement. We lose too many good people and hire too many senior roles from the outside instead of cultivating talent.", "there is not much culture except that everyone is nice, respectful, ... but company activities are not a priority here .. if you want fun and engaging this is not really the place", "Hard work does not necessarily equate to job security. Relavice is an overwhelmong factor that has adverse affects on moral and consistant organizational goals and direction."], "reliance one": ["While no company is perfect, management has been working diligently to adapt to changing market trends and listening to new ideas from internal employees to improve the overall work environment and streamline processes. This isn't a \"con\", but illustrates how open to change the company has become.", "While no place is going to be perfect, we tend to follow the old way of doing things sometimes. That's not always a bad thing, but we could look at our markets and adapt to change quicker.", "Nothing that wasn't a reasonable request", "- Arrogant senior management\n- Zero work/life balance - don’t want to work weekends, you’re not “driven” enough\n- Micromanaged at every level", "Long hours but you have to have a mindset of you work hard you play hard."], "billtrust": ["Important for product to catch up to some of the demands in the market. This is a fast paced business that is demanding. If you are not up for that then this isn't probably the place for you. But the rewards are solid.", "As a sales person, it takes time to ramp up. Some people don’t do the work and fail.", "None that I have seen so far!", "Lower end of the pay scale, Some of the bureaucracy gets in the way", "1. The only con - which is really a pro - is that we're growing at a fast pace - need top level talent to apply."], "lear corporation": ["None to share at this time", "Working 6 days a week,Senority,little chance of advancement, Management doesnt listen well,", "Low culture\nPoor communication\nNo advancement opportunities", "Great place but not for everyone", "In an attempt to appeal to Millennials and others, the dress code has gone very casual. Most of the time people are in jeans or sun-dresses. This is fine if that is your flavor, but dressing in normal business casual cloths should be the norm not the exception. There is also a disconnect between the C-suite managers and the events happening on the front line. Middle management filters what the senior leaders are seeing which only adds to the confusion. In addition, swearing and rude jokes also seem to be the norm. It was the first time I have ever heard all parties in a large meeting dropping curse words like it was standard procedure."], "alto pharmacy": ["I left the company because of school and I think they might have raised wages and even improved working conditions for employees. When I was working there, we had to drive all the way to LA which during traffic could turn out to be a 4 hour trip there and back. A lot of employees complained about this but I think they opened up a new office so you don't have to do that anymore.", "Alto has had issues with growing responsibly. Management does not communicate well/at all, and they started cutting corners with taking care of employees when the new HQ launched (promising things that never appeared, cutting vacation and sick time, etc.). Wages tend to be lower than other tech companies, but management doesn't recognize that when it's pointed out to them. They started firing a lot of people while I was there and never communicated to the team why or did anything to make people less afraid for their jobs. The culture has really gone downhill fast in spite of the great people.", "No senior leadership, morale is very low, tons of changes, no consistency, no real culture, bad internal comm's, and lots of attrition.", "- long hours\n- patient care is being moved out of state, despite what company leaders say\n- little recognition for good work\n- micro management\n- terrible company culture\n\nAlto was once a place where everyone seemed valued and heard. Ever since they opened their second office it seems like the staff located in San Francisco, who work in patient care and pharmacy operations have been forgotten about. Benefits have been changed with little notice. Pay increases have been pushed out so far that they dont even seem real anymore, with finally very few people getting any sort of increase, despite positive yearly reviews. Company culture is now if you speak up or share your opinion you will be fired. Very long hours that include weekends and holidays. At times there are not enough delivery couriers to make an urgent delivery so someone in patient care has to do it.", "The company has had some growing pains as it has scaled from ~80 to ~220 employees over the last year, and has expanded from just SF to offices in LA, OC, and Denver. It takes time to build infrastructure to support that kind of growth, and in certain areas the growth has outpaced the infrastructure to support it. But it's clearly catching up, especially in operations and customer support, where the biggest changes have happed in the last few months with the opening of the Denver operations office. This type of expansion is always a hard things for startups, and many other fast growing startups have had similar growing pains when opening their second support office. It just takes time."], "coffee meets bagel": ["Can't think of any to write", "Still some minor start-up kinks to work out\nCommute -but not severe", "None that I can think of.", "can't think of a thing.", "The office is small but we are moving to the new location which is much bigger! so yay"], "nasdaq": ["I do not see any cons for this company", "Limited opportunity for career advancements.", "There is limited upward potential.", "1) If you work in the LEGAL/COMPLIANCE area - you will not see any monies because the mgmt there does not believe in hiring or paying...You will be working the jobs of 3 people because NASDAQ is painfully CHEAP in hiring enough workers.\n2) Upper management are complete EMPTY suits - they have no understanding or appreciation for the level of detail and the amount or effort that is entailed in the daily duties - they only want the \"big picture\" or \"high level\" action items.", "Lots of hours are expeted"], "tableau": ["Has its own fair share of challenges"], "veolia": ["I found no cons at site", "No cons in my point of view", "Poor management, and loads of samples", "Not opportunities for advancement\nPoor communication", "Around 2013 there was a visible shift. Enter the good old boys club. Being a female in middle management it became obvious that diversity was lip service. Upper management entirely comprised of white men. An after taste of agenda started to become apparent in the newly promoted upper management. By 2016 the HR team had evolved into bullies. They created distrust between employees and employers, the are viewed as political players as they add no value to the bottom line. Management often gives everyone the same rewards, regardless of contribution or experience. Telling top performers that it wouldn’t be fair to others will do little to inspire additional commitment. Productivity is also hurt by poor information technology, employees have to navigate different systems and locations to find what they need."], "ilmor engineering": ["Expect to be continuously learning and developing your skills.", "Lack of structure/organization in several vital departments. Cold culture and little diversity in gender/race. High employee turnover rate, constantly hiring.", "Expect long hours as the standard."], "dependable global solutions": ["small business growing pains in big field", "On the lower level salary wise, benefits are handled via a website with little hands on by the staff. It is still a small company and this is probably the most cost efficient so I understand but it is so much nicer when benefits are handled in company vice a second or third party entity.", "When contract is up, contract is up. They won't even hold the insurance for 1 month"], "shippo": ["We are a startup, not a large well established company, so if you're not used to or excited about moving fast with things changing on a relatively consistent basis you may struggle some. Shipping isn't the easiest industry to disrupt so sometimes the job can be challenging, but on the other side of those challenges you'll often find that you walk away with a significant sense of accomplishment.", "There isn't a linear path upwards if that's what you're looking, for since the company is still quite small.", "Leadership, vertical movement (lack thereof), etc.", "Plenty of problems you should know about before considering an offer the following about the founding team:\n1. Lack of transparency: A number of folks were let go without due explanation to the rest of the company. In multiple (too many) cases the reasons listed were completely fabricated and did not convey the truth, just what was convenient for the founders to say - this is after hearing the other side of the story.\n2. Low retention rate: Folks are constantly quitting Shippo. Ask why.\n3. Poor hiring decisions: In 2017 ten new hires were let go before completing a full year at Shippo. A lot of the remaining new hires from that year ended up quitting/being let go the year after.\n4. Gossip culture: The founders constantly engage in gossip culture, once they hear something negative about an employee, they will use it as leverage against them.\n5. Not feedback-oriented: One of the main reasons many quit at Shippo is that the founding team does not take well to feedbak nor do they improve on it. So folks are either asked to leave or independently decide to quit after a long period of being frustrated.\n6. Blame culture: Founders typically blame their shortcomings on one of the departments, or individuals, that report to them. (They will probably try to blame this review on someone else).\n7. Brain drain: Due to the low retention rate, little knowledge is accumulating in the team and past mistakes are constantly repeating. When folks attempt to point out that mistakes are being repeated and attempt to offer a solution, they are singled out as bringing down the team spirit.\n8. Unfit CEO: The CEO never showed any real, leadership or otherwise, skills at Shippo - constantly engaging in blaming others and lashing out when someone disagrees with her. She seems too busy building her own personal brand and taking unexplicably long vacations. Her, otherwise admirable, public opinions/statements rarely translate to actual wisdom/leadership in handling difficult situations. After working at Shippo for some time, one is only left to question the authenticity of those public remarks.\n9. Unfit President: The President has chronic management issues - he is a big part of why Shippo has a blame culture. He very rarely takes responsibility for his own mistakes or admits his negative influence on teams' productivity and accountability. He constantly gives the impression that he wants to know he's the smartest one in the room. Presidents usually compliment a CEO, not this one; he takes equaly long vacations and does not seem to stand up to the CEO. Every department he has ever managed has failed: Engineering (big layoffs), product (big layoffs), design (big layoffs).\n10. Founders in denial: CEO & President have often said nice-sounding things like \"if and when the company outgrows us, we will step down and find better-equipped leadership\". Funny thing is, they've been holding back the company for a long time, and it was brought to their attention, yet they are still there and in denial.\n\nShippo founders lucked out with hiring good folks, so don't be fooled if your interviews go well. In many cases those interviewers themselves might be quitting soon, as evidenced by the low retention rate. Of course they cannot disclose that in the interview, so don't expect them to.\n\nIMO most folks quit at Shippo because the founders constantly turn their back on those who built the business for them as soon as they ask for improvements that would inconvenience the founders or diminish their role, even if said improvements would help the company overall.\n\nI recommend you do not join if you're currently considering this for a full time role. You will quickly reach a ceiling where you need either the CEO's or President's approval for everything that you do, and you'll have to decide between quitting and leaving what you worked on behind or putting up with two inexperienced first-time finders who are not willing to follow your lead in your area of expertise. This applies even to executive positions - you will quickly realize you are expendable the moment you disagree with the founders, simply because they can.", "I had considered writing a longer review than this to share feedback about the executive leadership team, primarily the co-founders, but the review from 3/29 titled “Immature Founding Team” does an excellent job at summing up many of the pervasive issues crippling this organization.\n\nFor the most part, my experience working at Shippo was defined by many talented, competent, and empathetic colleagues I had the opportunity to work with on a daily basis.\n\nUnfortunately, executive leadership had and continues to have no interest investing in their people professionally. They anticipate that you’ll come in and do the work asked of you with little to no guidance or vision-based leadership. Retention rate, because of this, is incredibly low and it shouldn’t be surprising to anyone within the organization that talented people are leaving on a fairly regular basis.\n\nThe co-founders operate from a very closed door, “top-down” approach, with the assumption employees will make up for their managerial shortcomings through hard work and a general lack of appreciation for that hard work.\n\nLack of product-market fit is another puzzle piece this leadership team has been unable to solve for some time. It’s unclear how they see this organization growing in the long term if they continue failing to understand where their business fits into the shipping ecosystem.\n\nIn general, there is great promise for both this team of people and the business they’ve built, but executive leadership needs to develop pretty significant self-awareness if they want to see Shippo succeed.\n\nThat success will require different people who understand how to lead, motivate, and innovate for significant future growth to be possible."], "cloudreach": ["- Colleagues travel for projects a lot, so sometimes it can seem like people are coming and going\n- Growing pains that come with every org growing at this rate, but leadership is working hard to implement processes that help the org scale", "New people fundamentala seemed rushed new levels were all over the place\nFinance and expense operations need work should be better for a consulting company where majority of us have to travel on a weekly basis and are the bread and butter of the organization\nvision is all over the place\nLeadership is disconnected", "used to be fresh and bold, now just feels like we are trying to be every other giant boring corporation. too by the book. new people from big corps with no understanding of what made cloudreach special seem to be the only ones with a say on anything anymore which is a shame.", "The leadership team does not know how to lead. There are many biases and disriminatory practices by cetain 'leaders'. Instead of addressing the issues, these people continue to get reassigned to newly created positions with goofy titles and fake responsibilities.", "Mere certification does not help. This, they fail to understand. The Cloud Architects and the Lead Cloud Architect I worked with might know only about AWS cloud., but, they lack to have a whole Application knowledge, Application Integration knowledge, Data structures, etc.. and will not be able to help for refactoring Applications. All young folks with certifications and they think they know everything. This is wrong. They lack manners, rude and unformattted behaviour."], "zendesk": ["Regional subsidiaries still very far from the Global team. The processes are still being created.", "tenderloin can be scary\ntoxic team environment\nfavoritism and change based on favoritism\nlack of strategic business plan for said team", "Life-threatening office location and not offering a lot of remote working opportunities.", "Growing pains.. Company is doing everything it can to keep up with the demand", "Departments felt totally isolated from one another. At times the Creative team felt like a production house for the rest of the company. Lots of meetings."], "retensa": ["No salary for associates, just a stipend. Unclear career path.", "No cash flow. Underpays employees + payroll delays. Technology is not impressive.", "Low pay if any, long hours, little or no direction for interns who are DOING the work, no career path.", "In service industry where might not have the project you want all the time. Unclear career growth. People can move up, no clear open positions or departments to fall into.", "Little opportunity for advancement and career progression. Compensation."], "envision technology partners": ["- Learning the business is hard without healthcare knowledge\n- Opportunities for advancement are limited because everyone reports to two owners\n- Leaders are there, but sometimes had mixed messages on how to do things or who controls what\n- Trying to adopt scum or agile but was doing it wrong", "-No control over any aspect of your job. While the owners are generally nice people, the company is dictated by the opinions of a single self-appointed manager. Any requests and insight that you provide to the owners of the company will be completely disregarded if you are not in the good graces of the manager. Over time I provided direct feedback to ownership about ideas for product improvement, processes to help improve our development efforts, and legitimate concerns about employee morale yet these were all completely ignored because I wasn't liked well enough by the manager.\n\n-Incredibly cliquey environment, favoritism is blatantly expressed to a small group of testers and product owners. There is a small circle of \"liked\" employees that are not held to the same ruleset as the rest of the company. If you are not within this circle you will see yourself and your peers being reprimanded for the same behaviors that are freely exhibited by the \"liked\" employees.\n\n-No personal autonomy to speak of. Your worth as an employee is completely derived by the literal time that you spend sitting in your chair at your desk, not by the quality of your work. You are classified as \"lazy\" if you do not put in overtime every pay period, regardless of the workload that you are given.\n\n-Pay rate far under market value for the given benefits. You receive \"small company pay\" yet you will be given far less vacation time and you will not be allowed to work remotely. These policies are very antiquated, almost every large software company in the area will offer more pay, more vacation time, and allow remote work when reasonable.\n\nI struggle to see any reason to recommend this company to developers looking for work regardless of their experience level. I've written this entire review and haven't even mentioned the numerous downfalls of working on their technologically outdated code base. Simply put, the work environment here is toxic, you will certainly be treated better at most any other software company in the area. The experience that you will gain here simply isn't worth the pitfalls that you will inevitably endure."], "ripple": ["Product is new, company is young. Some hard work and late nights to get the work done, but it’s a startup, we are working towards something bigger then ourselves", "We're doing everything we can to change highly regulated and conservative industry. Much of how things play out with issues like policy and regulation are completely out of Ripple's control. If the thought of that stresses you out, this may not be the place for you!", "Some growing pains that would be common at any high-growth company, as systems and processes that were designed for 50 people have trouble scaling to hundreds. Snacks/drinks in SF are so good that the (still pretty good) pantry in NY pales in comparison. Travel policies could be less stingy.", "There are really no cons since the company is growing and learning how to adjust and scale along the way but doing it in a way where employees feel like the culture is not shifting and that they are making an impact for which they are being recognized.", "Steep learning curve in this industry but the company does an amazing job of onboarding to give you all the necessary resources to get up to speed quickly."], "mavenir": ["you need to be reachable and there is some weekend work. diversity is non-existent. everyone here is male and either indian or white.", "Lack of standard procedures and enforcement leads issues to re-occur.\nLack of defined ownerships leads to chaos sometime.", "Little training, Long hours, little bonus/raise", "Hero culture, less of processes", "Best people are leaving. CEO is a bully and management teams are copying this behavior. Products are not existing. Indian development teams are not under control and delivering bad quality. IMS deployments are replaced by competition, Traditional MVAS business is neglected and put in maintenace mode and 5G and RCS are not delivering successes"], "university of texas at austin": ["Lots of grading (depends on professor)", "Sometimes you have to work weekends", "there is no Cons and all are benefits", "Nothing is perfect. Overall, I enjoy doing my research here.", "Parking, no windows in offices"], "manhattan neighborhood network": ["zero cons in my view as a producer", "Upper management is intimidated by anyone with actual experience outside of MNN, and will go to great lengths to protect their hierarchy. A very difficult place to get promoted, it's an unsatisfying experience if you have ambition and creativity really isn't rewarded. The people who work the hardest are wildly underpaid.", "No room for growth, inexperienced management and poor media skills from upper management. Micromanaging", "-HR policies are ridiculous and HR overall simply need to be fired.\n-They do not promote professional development or promote within so be prepared to feel burnt out and over your position within the first year.\n-Upper management are bullies.", "upper management micro-manages\nnone of them have any experience with producing media\npower hungry supervisors"], "team tube": ["Floor staff worked too hard"], "lightning bolt solutions": ["With growth there has been some changes in leadership. I see this as a plus however and the company predicts growth in their overall team.", "-TOTAL compensation is alright. Kinda low for the Bay Area in a tech-focused skill role. Salary is comparable, but no bonuses/equity (almost worthless)\n-Consultant work is very, very support focused. Technical aspect >>>>> Support aspect in terms of intelligence, but you spend time doing about 35/65 (possible pro, if you really enjoy client success focused work)\n-Work, in my opinion, doesn't feel rewarding. Seems like your job is to literally just prevent fires (make sure clients don't cancel/keep them happy)\n-Growth paths can be kind of arbitrary depending on what the company needs, unclear if a position for what you want will be available\n\nAND THIS ONE.\n-The software...Conceptually, it's a great idea but the execution of the UI & back end codebase is SO poor.\n-I'm pretty sure the UI won't be even half updated until 2019-2020, at which time half of those features will probably be defunct. What is the UI/UX guy actually working on? Everyone's unsure\n-85% of your job as a Consultant ends up having to help clients because 1) UI is so god awful that it's too confusing for clients to do work on their own or 2) bugs, bugs, bugs everywhere-- which have an insane life cycle before they get fixed. Causes unintended, confusing results that you spend hours troubleshooting, only to realize it was a bug", "-There have been some bad apples who created a toxic environment for the team (I believe they've left some reviews here). I see this as a growing pain, but the company has addressed this as needed (thank you!).\n\n-Team hierarchies are still getting solidified. That can be tough as the team grows and the company tries to accommodate growth for the staff.", "Very lax work from home policy made it nearly impossible to collaborate with crucial team members as they literally never came into the office. (Even on days that are not \"work from home\")\n\nTraining is a joke, you essentially train yourself.\n\nCompensation & benefits are abysmal, especially for the SF Bay Area.\n\nVery cliquey work environment, if you don't fit in right away you are ostracized.\n\nSeveral employees are given preferential treatment, they literally have a say in every aspect of the company within all departments.\n\nMicromanagement is the norm at Lightning Bolt, it kills all motivation/momentum.\n\nVery little appreciation is shown from management or senior team members.\n\nAbsolutely no room for career growth or development. Dead-end positions at a dead-end organization.\n\nLightning Bolt has been in \"start-up\" mode for the past 15 years and doesn't seem like it will take off anytime soon.", "Some internal processes could be streamlined but massive changes have already happened and others are currently in process."], "levy": ["I was only hired for Superbowl", "Management's decisions and execution of events", "Short hours and low pay", "Setup is usually understaffed, so more work is needed from smaller setup crew.", "Management was a bit unorganized at times and understaffed at times."], "robin healthcare": ["Having to pay for parking every day", "-Lack of communication on how to move up in the company, which seems to frustrate some people. This is not a con for self-starters who are not afraid to ask for more responsibilities\n-The company's mission sometimes gets lost in the daily grind, so it would be great if we were all reminded of this company's mission to improve patient care!", "We're always looking for more and more ways to get to know each other and bond outside of work hours. Office culture can be a challenge since we all wear headphones while working. But leadership is listening to feedback and making positive changes all the time! We've started doing monthly volunteering events, LARGE monthly social events, monthly guest lecturers, etc. Many of these things are planned by scribes, for scribes. At Robin, we have a unique cultural advantage in that we have everyone under one roof instead of spread all over the place in separate clinics/hospitals. I'm really excited to see what 2019 has in store as we continue to grow as a company.", "Parking: If you don’t live in west campus and have to commute, parking can be a bit of a pain. The garage next door is expensive and street parking can be hard to find. However, they’ve been really receptive to parking feedback and have recently started reimbursing employees for 50% of parking costs through an easy-to-use app. If you live in west campus, you can easily walk to work.", "Management is a complete joke, just a bunch of medical school rejects who tell you that this job makes up for its pay by being an amazing asset on your medical school application, which is a lie. Long hours are a con and so is a COMPLETELY UNPAID TRAINING PROCESS that you have no guarantee of getting through. If you do decide you want to make a maximum of $9.50 an hour working ~35 hour work weeks doing work that should really be done by people far more qualified, and you want to neglect your school work this might just be the workplace for you!"], "radiant solutions": ["None at all - you’re great!", "poor communication, no business guidelines", "Having gone through the recent round of mergers the HR department and over all business practices still have a lot of kinks that need to be ironed out. It seems like no one knows what the right process to get approvals is and things take longer than they should.", "There are no significant cons that I can think of", "Lack of work leads to a reduction in force. Better planning would help them retain more talent."], "salesforce": ["There is no cons for working here.", "The rapid growth and the pressure around quarterly metrics is starting to come at the expense of cohesion and quality. The annual reorganization of the business is quite disruptive and is particularly problematic in business areas where the sales cycles are longer, like the more heavily regulated verticals or larger enterprise environments where aligning stakeholders and building vision takes time. You can work your &#$# off here and have all that worked handed off to someone else in a new fiscal. Happens a lot.\n\nAbove the mid management/senior director level, the political environment resembles the Hunger Games. The lack of capable management and the lack of transparency around career progression / promotion are a drag on the business and a significant business risk. The departures of more tenured people should be very concerning to leadership; just look at the difference in the reviews of new (<1 year) employees and those with 5 or more years of experience. It's not a positive marker. There is a reason that the employee survey now asks about the \"psychological safety\" of our workplace. Leadership should be commended for recognizing that this is a problem, but now needs to actually do something to fix it. Just adding a feedback app and calendar reminders to use it are probably not going to get the job done.\n\nOnce you are hired, progression within the company can be difficult. There is a policy that all internal transfers should be lateral in terms of grade and compensation, even if an external candidate with the same credentials would be offered significantly more compensation and a bigger title. There is a sense that the only way to get a promotion is often to threaten to (or actually) resign and unfortunately, plenty of evidence that this is an effective strategy.", "Your manager/territory/account list will have a huge impact on your success, so relationships are key to protect yourself on those factors.", "No Free Lunch for Engineer", "Salesforce is a large company, but you can find an entrepreneurial spirit and freedom in many of the smaller divisions in the company."], "pierce washington": ["- need to build as strong a culture in Chicago and London as San Francisco\n- need a broader base of service offerings (beyond CPQ)", "Looking forward to a more diverse firm as the years go by. Gender/ethnic diversity is a shortcoming at most tech companies, not just Pierce Washington. I have seen the diversity of the firm increase since I started, but it's still something that should be focused on and intentionally improved. If the majority of our hires are references, they'll typically share similar demographics to the person referring them. Diversity of experience, gender, and ethnic background makes us better, stronger, and smarter.", "Company is growing and it is trying to keep structure in place which I feel will improve over the years."], "digital intent": [""], "eaze": ["- Highly regulated market with regulations that change very quickly: the direction could change rapidly and it's harder to have long term plans. This could be a bit frustrating for some people, very exciting for others.", "- Not really a negative, but given the nature of the industry, things can be a bit chaotic at times. People who are excited by that challenge will thrive in this environment.\n- Split offices have led to a bit of split culture. Need to spend more time focused on uniting the two offices.", "Volatile industry creates thrash in priorities.\nUnderstaffed leads to a lot of thrash in priorities.\nUncertainty leads to a bit of \"shooting from the hip\" from management at times (which is what on the same token, creates the opportunity for autonomy to thrive) but still, creates thrash.\n\nMost top level priorities have been too product focused for a while, and engineering hasn't had the proper chance to really address issues with legacy systems.\nTech debt persists despite relatively small initiatives to alleviate it.", "- Regulations and restrictions on cannabis can be frustrating to deal with, especially as regulators can change things without much warning.", "* Lots of technical debt due to how the site was originally created, which slows down development\n* Lack of brand direction and marketing leader\n* Needs work on diversity of employees (although people are aware, care, and trying to change that)"], "rocketrip": ["- There are always challenges in any startup, especially as you move upmarket quickly into the enterprise. The hours are relatively long but it's well worth it - if you grind it out and work hard you will be rewarded and noticed within Rocketrip. Plus, the product has come a long way since 2-3 years ago, and a lot of the enterprise market is seeing the results of our efforts.", "- It is a sales job so there is cold calling and a lot of outbound outreach but nothing too monotonous and there are ways to make it fun", "- Office is bit colder, and lights are brighter. But I think we are moving to new office soon, so 🤞", "- No company is without growing pains. If you can’t be self-sufficient there’s a chance you’ll struggle. However, the company partnered with a consulting firm that specializes in organization development to make sure that managers have the right tools to successfully lead their teams and support those who might need some extra attention.\n\n- 7 people were let go at the end of 2018 (this is the “massive layoff” that the other posts refer to) and morale took a temporary dip but bounced back and everyone here is focused on the future.", "-Not a good fit if you don't like change."], "sandata technologies": ["Commute\nOffice / culture a bit bland, old / old-fashioned\nSome of the old guard work ethic / talent level not particularly inspiring", "Like any new job, you have to adjust and it takes some time. If more people were open to getting to know the new employees it would make things a lot better", "If there is a con, at Sandata the employees voices are heard, and typically things get rectified.", "Transportation without a car is problematic.", "Can't think of any! Great team, great attitudes!"], "fastly": ["There's still more work to be done paying off tech debt from the early years.", "Growing pains, political, inexperience middle management", "Management team has been cleaning up the dead wood from startup mode but isn't done yet (includes people, processes, technology)\nBrand recognition is poor for a company that has grown to $100M+\nNo 401k match", "The org has a lot of cruft from 7 years of growth. We're all working together to fix it but it is painful. This can be found organizationally, architecturally and culturally.", "- Some operational tasks are still managed with Pacific Time in mind, so getting things done in a timely manner on the East Coast can be difficult"], "alpha supported living services": ["No one to really cover if you are sick. And if there is coverage, they tend to irritate the client. Since you are working at the clients home. You are usually alone and the support from the supervisor isn't there.", "If you're ever sick, it's difficult to have someone cover. There's a high turn over rate due to some employees who do not know how to deal with the clients."], "red caffeine": ["With it still being a startup there are definitely some growing pains, but everyone is committed to mending them. This can range everywhere from internal operations, to career pathing. The pros definitely outweigh the cons here.", "Some people around the office don't always clean their dishes or help stock supplies.", "The limited time off policy kills me. Also, we suffer from shiny object syndrome, which makes it hard to follow our primary company goals and direction. I think those are my primary gripes and every company has some issues like that. RC has made leaps and bounds of improvements in processes and management structures the last year or two, so that's encouraging.", "Occasionally, projects will change last minute, and you'll have to adapt just a quickly as they changed, all while working on a tight(er) timeline. I wouldn't say that it's a total con though, because it can be a good challenge to be flexible and work under a tight timeline.", "I haven't run into any cons of working at Red Caffeine."], "streamlabs": ["The only downside, is that I can't tell people what we're working on most of the time. Though that is to be as expected with most any job when working on unreleased things.", "At the time, they lacked a company vision. From what I hear now, they're doing much better.", "I haven't had any bad experiences. It's literally fun reaching out to clients, helping them grow, seeing the satisfaction they get with the results we help with. I'm very blessed to be with this company and be led by this team.", "Can't think of anything at the moment.", "Major projects and crunch time can make you step out of your comfort zone. The market space contains some pretty toxic competition you'll have to grin through. If you need your hand held, that doesn't happen here. You are 100% responsible for your personal and professional growth. Everyone has projects and tasks to complete, and while they can help you from time to time, during major pushes is not the time to try to learn the job you were hired to do. This can be a huge change for some. Travel from outside the city and even in the city can make for a headache of a commute."], "loyola press": ["There will always be an adjustment period when you have new leadership, that's to be expected. However, it seems (based on some of the previous reviews) that new leadership was very much needed.", "I came to LP after a lot of management changes took place, so I can't speak to what it was like before, but you can definitely still feel some uncertainty around the office.\n\nThe new team of upper management is still learning how to work together and sometimes that stress can trickle down and affect employees, but it seems like they're aware of it and are trying to work through it.", "Many of the cons listed by other reviews were related to previous senior leadership.", "Should you take a job here, do so because you need income and plan on immediately looking for something else. There's no shame in taking their money from them. Sometimes you have to do what you have to do.", "It's disappointing to read that this organization has not taken heed of valuable feedback from its employees. If the same issues persist year after year, why not take action and make it right? Have you not learned from the Church's errors?"], "springshare": ["It's a small team and everyone multitasks so sometimes it gets a bit hectic. When working remotely you must be well organized and self-starter as there is not much dedicated training. Career growth somewhat limited, with it being a small company.", "you will be working remotely so for those who need the office culture, this is not the company you should be looking out for.\nYou will have to put in extra hours of work compromising on your work-life balance.", "A little frenetic at times, understaffed.", "After fast growth for several years, the sales stalled, and the party is ending. Previous benefit were cutting, rules were restricting and people are start leaving or laying off.\nsupports were overloaded in summer and techies were over burned in fall\nlack of personal growth\nmicromanagement"], "chartio": ["- First 3 pros above can be seen as cons by some; depends on your perspective!\n- BI industry is crowded; competition is tough", "- The CEO/Exec team has too much misguided confidence in their own understanding of the market. Has difficulty navigating the very competitive market/landscape. The whole company has really struggled against competotors. Has not prioritized any real Product Marketing or market research.\n- Heavy confirmation bias amongst exec team. Only recognizing outcomes that confirm personal opinions has hindered productive conversations and impactful decision making. There was a perception amongst the company that the exec team will push out anyone who challenges them (had concerns about their ability to maintain healthy conflict).\n- Not very open minded. Unwilling to hear alternate approaches or creatively collaborating to solve the challenges ahead. Also quick to point a finger or blame another.\n- Very male dominating culture. However, a female VP of People has been added so hopefully this will change!", "- Provide more career growth opportunities\n- Share knowledge across engineers", "There has been a decent amount of change in some of the departments recently. Those departments are still finding their equilibrium but over the past couple months things seem to be stabilizing.", "Recent (and overdue) changes in the leadership team have resulted in a few disgruntled employees and reviews, but the company is already seeing the positive effects of these changes."], "metabiota": ["Prioritizing so many promising opportunities and projects while balancing them against funding, timing and resource challenges", "-Annual bonus could be higher", "If you need and value stability, especially in the Government side, ethics, or advancement due to merit, this isn't the place for you. There were no opportunities to shift within the organization, regardless of the efforts you made as an individual. It is also not a place you want to bring or leverage your network with, as they will be used and burned as other people see fit. The value was always the short, cash-grabbing win, regardless of the cost in reputation, relationships within the community, or professional ethics. After leaving, I and a number of colleagues have had to work against this negative reputation, and I have personally been called out on it in interviews for positions with their former USG clients. And yes, some of the high level leadership (C-suite) has now changed since I left, but that reputation has held true years later within the community.", "- Typical pressure to achieve milestones that comes with being a start up\n- Lean and mean, which means the company is frugal", "The former President ran the DC office into the ground by expanding into a ritzy neighborhood and adding a bunch of people without revenue to support it. Within 9 months, the founding CEO resigned and the DC office was shuttered despite most of the clients being located in DC after not landing a single new client in a year and losing their largest client. It's a shame because it could have been something special. Now the SF office survives on the left coast with orphaned east coast clients. Sales turnover was 100% despite leadership 101 issues making it a lost cause from the beginning. At least the board eventually fired the President (Robert Mann). Not that this helped the people who were hired/poached only to be laid off a few months later."], "adaptive financial consulting": ["none at this time, keep up the good work", "Very slow recruitment process. No managers from Spain (may be this is from pros)", "As Adaptive are a growing company, they are evolving in their management structure to adapt to the growth and size. Sometimes they don't get this perfectly right, but on the plus side they recognise this and are constantly taking steps to change things and make things better all the time.\n\nFor the same reason, Line Management is somewhat 'light' at Adaptive. Some people prefer this of course, whereas some perhaps more junior members of the team may feel a little lost. Again, it is something they are aware on and working on, which is very refreshing.", "I really can't think of any...", "Frankly, not much. I really can't think of anything."], "gusto": ["-Lots of information for new employees (can be overwhelming)\n-long \"boot camp\"", "The main cons with Gusto are honestly the best parts - it really just depends on what you like. i.e Scaling at a crazy rate and still experiencing startup growing pains. If \"Change is the only constant\" does not sound appealing, then Gusto may not be the happiest place for you.\n-Super fast face growth - this can be a lot to handle and if you take part of interviewing it feels like you have two jobs\n-There were higher cash offers out there so if you do not value equity you can likely find better offers\n-Start up \"quirks\" - i.e no shoes, unique terminology (employees = gusties, PE = manager, etc) - Not a con in my book but if you looking for somewhere conventional then Gusto may fall short", "With growth comes a lot of change - which is not necessarily a negative thing! We have very open communication around what change is happening and people empowerers will explain the 'why' behind it.", "-Being new during the peak season can be stressful", "We've grown from 150 employees to over 850 employees in 3 years across two headquarter locations. Gusto is scaling quickly and with any scaling company there are growing pains. The specific growing pains that I have experienced is that our internal processes and tools are always catching up to match the size and stage of the business."], "riskonnect": ["Vacation time could be more generous. Work hard, but allow time to recharge.", "Confusion resulting from merger. New management still getting up to speed", "pretty volatile environment, with lots of changes, missed promises, and lack of transparency. revolving door in management ranks", "Room for improvement regarding benefits.", "The managers in Client Services and Implementation would benefit from additional training and/or coaching on time management, professionalism and leadership skills. Fortunately, this was actually already in the works when I left, so I have confidence that this will turn around soon. Given that Client services and Implementation leadership is truly the only complaint I have, I wouldn't count Riskonnect out in your job search. Leaders change - there is an ebb and flow to leadership at any company - but the company itself and the product offering is solid. When I left they were starting to hire for new account managers, both senior and junior."], "christensen animal hospital": ["Hours worked in the VetMed industry, as any medical industry, are often long. It is a matter of satisfaction from our work and being able to mend broken pets and their families that makes it all worth it. Not so much a \"con\" as just part of the territory, we kind of all know what we're getting into with healthcare."], "marsh": ["lacks technological innovation - slow to change", "repetition and silly work practices", "Little to no advancement for high preforming young talent", "Very difficult to get change through this company due to their being risk adverse", "culture\npeople\nmanagement\ninclusivity\nNo one cares about your well being\nRacist environment"], "schryver medical": ["They are growing through acquisition, so there is a bit of dysfunction that comes with that process. However it is no fault of anyone... Just the nature of their business model. That will all get sorted out in short order.", "LAID BACK MANAGEMENT\nimpossible deadlines\nimpossible expectations", "everything else. no breaks. MANAGERS SUCK. Brown nosers Punished for others mistakes and written up. sent home without pay for those mistakes.", "Uncertain hours, long term lab techs engage in bullying", "No opportunity for cross training into other modalities."], "doximity": ["- No 401K matching, but other than that I haven't found any", "Not AS flexible on working from home, but we do work from home once a week. So give and take. each of our teams seem to work in silos, so would be great to make sure everyone is connected and on the same page so we can grow together.", "None that I can think of.", "- too many company off-sites, difficult for those of us with families", "- Number one is lack of trained management/leadership. High-growth company hadn't figured out the gravity of training leaders well.\n- Related, no clear path for growth/advancement.\n- Also related, though the culture is positively tangible, it can seem like numbers/success come before people. Sometimes perks act like a pacifier, but developing employees takes dedicated, hard work.\n- Secondly, expectations for individuals are unclear.\n\nAll of this revolves around a lack of self-awareness among management. It's one thing to put your head down and get the work done. Having fun here and there is great. But when leadership doesn't learn how to truly put people first, employees burn out."], "yelp": ["Dont have anything negative to say about yelp", "***IMPORTANT***\nLet the record stand that in September there was an attempted SHOOTING at Yelp in SF and NOT A SINGLE MESSAGE was sent out until 3PM three days later after employees were panicking/gossiping about it.\n\nOur stock plunged nearly 30% in Nov. Business owners were talking about it on our calls and not a single person in management or leadership addressed it.\n\nBuckle up, because there are many.\n\n1. Culture- This company is ran like an elementary school or a dysfunctional summer camp. There is an ongoing joke about how we're surprised we don't have to raise our hands to use the restroom. I totally understand things like being mindful of breaks and your phone, but there have been times were I took my phone out to check on a family emergency and got publicly called out for it. The culture at Yelp is shoving it down your throat that you LOVE Yelp and you are SO LUCKY to be working at Yelp. Our monthly meetings would involve bashing other companies (ex., the head of the office mocked Google's walk out against sexual harassment) and avoiding obvious issues within the company. You are HIGHLY encouraged to attend happy hours frequently and majority of the well performing teams, such as the one I was on, go out multiple times a month. Most of it comes out of YOUR pocket and can fall on weekends and Friday nights. Successful managers at Yelp consider Yelp their life (date within the company, have only friends within the company, etc.) I know more about my managers sex life than I ever should.\n2. Job Itself - It's cold calling, you know that when you apply so that shouldn't really be a con, HOWEVER, it's how they approach cold calling. At exactly 8:30 you need to be at your desk ready to go. At exactly 12:00 everyone takes lunch (HR says you can take it anywhere between 11-2 but good luck trying to tell your manager that). They have no flex when it comes to a sales cycle. If it's the day before Christmas or the day before Memorial Day weekend they expect the same despite the obvious fact that sales globally decrease. Your managers get on your calls and feed you line for line what you should be saying. Essentially you are a puppet to your manager. It takes zero skill. (For reference, I was putting up 30k a month which is 10k higher than quota.) No matter how much you do in a day/month/week/etc. it isn't enough and even when you do well, no one is happy there, they just can't tell you that. I know several people who have won the most esteemed awards at Yelp and all HAVE QUIT. You're forced to stand and your desk and \"bring the energy\" like we're 12 year old cheerleaders. The \"rewards\" they give you for closing deals is hilarious. Sometimes it's things like \"dare your manager to do a push up!\" or \"one free breakfast sandwich!\" Again, elementary school. There is also nowhere to go up. You can either cold call, manage people who cold call, do higher volume cold calling, or pray to get into Mid Market/National. I quit the leadership development program because the mission of it is to teach you how to brainwash employees and use what they say against them. Why should managers be asking me questions like \"Are you closer with your mom or your dad?\" \"How is your current relationship going?\"\n3. Management - Possibly the worst part of this job. It's amazing how they haven't been sued yet because not only is management known for being incredibly unprofessional, but there is NO DIVERSITY. Every single director (in my time I've seen 8 different) is white. Every. Single. One. This is a company of 1200+ employees and you're telling me there isn't ONE POC you can promote? Managers are the same and they're all 23-25. They promote people into management extremely early and they are managers for training classes so you're forced to learn from someone who doesn't even know how to do their job. In addition, management is incredibly immature, power hungry and an overall mess. I went though 4 different managers, all equally problematic. One time there was a bad snowstorm and they were closing down Port Authority and suspending trains. I was told I should \"stay at a friends house\" or use my PTO if I wanted to leave. I wound up staying, it was extremely dangerous getting home and I didn't get back to my house until 2AM with work the next day. Another time I was in the bathroom with a stomachache for FIVE minutes (sorry TMI) and my manager texted me \"Hey where are you?\" I've been told by countless people in power that we should 'of course' take our LEGAL 10 minute breaks, but make sure we earned them. This has been said to me at the end of a week where I've closed 21k. Seems like I earned it. Oh, and one more thing, keep an eye on your managers and directors because they're sleeping with reps and doing obscene amounts of Adderall.\n4. The pay structure - Yelp went from contracts to non-term length commitment so the client can cancel anytime. You have no connection with your clients after you sign them up, and it's frowned upon to check in on them. Yelp pays you out as if they stayed signed on for 6 months so when they cancel (which they do because the product is outdated and doesn't actually work) you wind up owing the company back money. They tell you 20% of your sales needs to stay on for 3 months which seems easy but is not when they can stop and start at any time and you have no control.\n\nHonestly, not the worst place to start for recent grads but check yourself and realize this is not a real job and other companies are laughing at us.", "None so far in my department", "Product vision can seem incremental at times, and appetite for risk is quite low. Design and user research teams don't have enough bandwidth to execute on projects at a rapid rate.", "None that I can think of."], "cresco labs": ["Not an easy commute. Driving is pretty much your best option. Public transportation is not close."], "trading technologies": ["Going through some pains as they still host a legacy platform while migrating to the new cloud based platform.", "If you work in infrastructure (or Networking/operations), stay away. The man running the show is a visionless man who's expectations are not realistic. He will make sure your life is hell...just stand by the revolving door and observe. This man's ideas of moving forward and progressing is circular.", "Seeing good working colleagues leave.", "The leadership is pretty bad! They do not know how to utilize their employees, a lot of great people are leaving and they have a hard time filling positions. They are constantly rebuilding features because the people who take over do not understand the technology nor the product. So much wasted time and money on useless meetings and constant rebuilding of applications.", "Days can be long at times...."], "allied wealth partners": ["No sugar coating here; the job and industry itself is very, very difficult to start. Don't expect to ride a rocket ship to the top. This isn't really AWP itself but more the entire financial advising world. Then again, building a business from scratch is never easy.\n\nThey have a lot of marketing materials to use but in my honest opinion, they are a little outdated. The firm also is a little behind on overall marketing strategies, but compliance makes it difficult to begin with (thanks FINRA).\n\nLearning how to sell products and your services is good, but there is no follow through in the training process on how to handle the steps afterwards. It's more of a \"trial and error\". This often delays pieces of business from getting done sooner. Also, potentially makes the advisor look foolish in front of the client.", "Company is an insurance brokerage firm and not a wealth management firm. Support staff is meager and advisors have to pay for everything including computer, office supplies, platform fees, and office support. Company does not really care about its clients rather it really cares about top line revenues. Payout percentage is substandard.", "No cons really, just wish there was better communication.", "Lies, snakish and scummy behavior are common place, as it is with most financial advisory, consultation and wealth management work places. Training is a waste.", "No salary. There is a subsidy but it's only active if performance numbers are hit. Tough to build from a p200 to hit those numbers. Also you have to pay for all licenses, e/o, and technology."], "centura health": ["Some of the people that work there are not very nice to you.", "Restructuring/changes, high turnover in some areas", "Lower pay. Big organizational structure changes going on.", "-Some hospitals are very neglected - there is a drastic difference between operations and overall employee satisfaction between locations.\n-No training or on-boarding process set by IT. I was thrown into working with no training and with no one able to train me. Luckily with prior hospital experience, this posed barely any issue but if it was someone new to the IT industry, they would've felt so lost they would've quit.", "Lacks good on the job training for positions"], "curbside": ["Company operates in a though market", "Business model wasn't as strong as it could have been, issues with stores' inventory and staff made for unhappy customers, I felt bad for the customer service team. Customer retention was a challenge, and getting new users was even more difficult.", "As an associate, I always felt like I was missing out on certain news from what we were doing as a company.", "No coordination or communication from higher ups. Feel left out in the cold by the rest of the company. Management stops by unannounced to threaten firing you if you are on your phone or sitting. No moving up in the company according to the manager.", "There was sometimes a lack of direction. There's always a chance for growth but you're largely left alone to find issues, fix them or improve services. There's a lack of coordination between marketing, ops, and engineering as well. I feel like it could be a more tightly run ship."], "credible": ["There are none for the company", "There is nothing I can say negative. Good people.", "*Response to a previous review*\nFavoritism- There is absolutely no favoritism! If you actually come to work and on time and excel past the expectations of your regular daily duties you will get recognized. People are so used to things just being handed to them instead of actually working for it. Welp news flash at Credible you have to work for it. I personally work out of the Durham Office and I LOVE going to work.", "Favoritism\nDivision\nNo room for advancement\nUnder paid\nAckward interaction with other departments", "- Need to have more salary bonus"], "flexport": ["Insane growth means that we can occasionally get ahead of our skis. And we need to continue to push for better internal communications to make sure we're all aligned.", "Really none - we work hard, but it is worth it!", "Operations grinds and sweats to keep clients happy.\n\nMake sure you know what you are getting into.\n\nWould definitely encourage finding a mentor who cares, but I think that's hard/close to impossible, as most are just trying to stay afloat.\n\nKnow you have other options. This place is well marketed. But things just seem off when people are scared to sit at lunch for more than 30 minutes. Maybe that's beautiful grind?\n\nThe people who have left after a year have done much better for themselves.", "Something is wrong at the top. For a few years now, the women at the top keep leaving.", "If you are not top talent, this is probably not the place for you, at least at this point. The people here are extremely smart, talented, hard working and customer focused. If that's not you, that's fine, but Flexport may be a difficult environment."], "beta cae systems usa": ["- It is located cold Michigan weather", "Should bear at least 4 months of cold.", "It is located in cold weather Michigan. Career wise is mostly limited to technical work, marketing and other opportunities are not present. Company size is small compared to competitors, limiting some resources for large expansion.", "1. Open ur mouth, speak- Since u might have to deal a lot with customers, u have to be able to speak open and clear. (and I guess this is how it is with any organization in the world) Customer obviously isn't ur love interest to understand the language of ur eyes.\n\n2. Patience is a virtue- I wouldn't lie, but at times an unsatisfied customer can get on ur nerves and u still have to act like the monk who sold his Ferrari."], "computrols": ["Healthcare for a family is expensive", "Zero training or interest in giving it. Understaffed and unwilling to hire the qualified numbers needed to operate effectively. No maintenance staff, so no matter your position scrub toilets or get a 20 minute scolding about it. Random firings with little or no explanations to remaining staff. High turnover. Reactionary and unstable business practices where sales are king regardless of ethics, stock, or staff to implement proposed contracts. Capricious management and owners that treat employees like indentured servants. And finally, \"parties\" with mandatory attendance.", "- Healthcare plan could be better", "- Formal training is inconsistent, you have to want to take the initiative yourself\n- Small company, so you will wear a lot of hats", "You will get fired for the most minimal thing"], "opendoor": ["unclear career trajectory due to nature of it being a start-up", "Normal growing pain of a company experiencing our growth rate. Nothing major.", "Upper management in San Francisco with little to NO actual real estate background (most are IT, Google, etc., backgrounds) and they don't listen to the \"boots on the ground\" individual marketplace Managers. It's all about increasing numbers (employees and markets) and NOT about buying and selling real estate.", "no cons to report on", "- Engineers don't match Tier 1 company caliber. They don't care if you do something right, just that it gets done and shipped. I haven't yet met a truly passionate individual who I can learn from\n- Engineers look out for themselves. They won't go out of their way to help you. It's each one for themselves\n- Managers don't care about your career growth or learning or you as an individual - only if you have delivered on your OKRs. They provide almost no support in career development. As long as you get your work done, that's good enough for them.\n- Management counts on one or two individuals to do all the work. The rest of us are backup dancers, figuratively speaking\n- Lack of clear future looking goals and vision. C suite level leaders are good, but mid to low level management is overworked, lack direction, lack transparency, and is totally uninspiring\n- Company only cares about moving the needle on business metrics. Developer experience and ensuring good engineering practices is at the end of the priority list. Don't waste your time on that \"useless\" stuff\n- Pay is on the stingier side\n- Not a fun culture. Polite small talk is the extent of friendships here"], "argonne national laboratory": ["Nothing negative I can say about the lab", "Some managers/supervisors have no experience managing people and it shows.\nManagement plays favorites and employees are promoted depending on who yu know instead of experience.", "Slow moving, old fashioned, projects sit for years with little progress. Lack of investment in mission support departments. People stay for a short amount of time or for decades with little in between", "Universities have more interesting events", "Senior management and leadership teams spend too much time shuffling deck chairs, reorganizing departments, promoting folks with poor leadership skills, and allowing short term thinking to guide their strategy. Everything is a crisis. Too many fiefdoms. And if you cross an age-barrier, you are suddenly part of the problem needing to be solved."], "plymouth district library": ["Interns have limited working hours"], "curology": ["Not a Con but we are a rapidly growing company and sometimes there are no processes in place but that's only because Curology is a startup company and we are literally improving processes as we go!", "Not a con, but this is a newer company so you need to be ready for change! Always in the right direction, though!", "Company is still relatively new.", "Need to have good time management, but that’s a given when you’re able to flex your own schedule.", "They are doing everything right! You need to be open to an evolving environment but they only get better!"], "prep sportswear": ["Health benefits for your dependents get really expensive.", "Quite a few at this time.", "Poor communication between teams, sometimes causing toxic environments. Little room for much personal growth", "On a weekly basis the customer service department was verbally assaulted by customers that were angry and frustrated with the company's poor return policy. Each department was cliquish to the point that no one communicated to each other, thus creating a toxic environment.", "tedious, boring, counted the time until i was out, no room for growth, never wanted to hire warehouse employees as FT- kept as contract so they didnt have to pay benefits"], "outreach": ["-none so far, which is great!", "no 401k matching right now", "• Many folks work long hours to get their work done\n• Sales is not everyone’s passion and the culture is strong here", "I like what I do so much that I work long days. Not the greatest work-life balance.", "I don't know that I would list any"], "the joint chiropractic": ["Coverage is hard to find", "No lunch break, no benefits, no room for advancement or promotion in most cases, incentive to up-sell wasn't enough, patients love to not listen when you explain terms and conditions of membership.", "Not much room for promotion", "Horrible wages and lack of patient care", "Feeling undervalued, unappreciated, overworked, underpaid, with no job security. Apparently, quality of care is a much lower priority than one's willingness to work as humanly possible for the least amount of pay."], "artifact uprising": ["Fast pace but I like it!", "AU is not the high growth company it was sold to me as in the interview process. Company model is simple and easy to scale, but unfortunately the mismanagement at the top has disrupted the progress. Turnover is extremely high with many key positions and historic knowledge walking out the door. Pay is below market and equity is not an option to offset the lack of career path opportunities. Company does not promote from within and the over staffing of executives is leaving an environment of more talkers than doers.", "- Absolute zero trust between the most of the company and the CEO and vice versa\n- CEO is more focused on employees punching a clock than output; you’re only valuable if he sees you working in the office\n- Company organization is incredibly top heavy, close to ⅓ of the company is in a leadership role, the recent talent drain is causing burnout and with a lack of individual contributors the CEO is focused on hiring more executives to make up for his shortcomings\n- No equity in the company\n- No opportunities for career growth\n- Work / life balance is hit or miss and largely dependent on the team / manager", "-Increasing divide between senior leaders and the rest of the team has negatively impacted the culture and resulted in a recent talent drain\n-There's an underlying lack of trust and respect between leadership and the rest of the company (goes both ways)\n-Leadership is making more decisions motivated by short-term financial gains often at the expense of what's best for the customer\n-Emphasis on in-office \"face time\" and top-down micro-management leaves many employees feeling undervalued and burned out\n-Pay is generally below market and compensation review process is opaque and inconsistent", "- Leadership is not trustworthy and does not have the employees best interests in mind.\n- Culture of micromanagement and butts-in-seats\n- If you disagree with any of the CEOs ideas, expect to have a target on your back\n- The company is convinced it’s normal to lose 33% of your workforce within a 4 month period\n- Pay is subpar and morals seem to be missing at the top of the ladder"], "ridecell": ["Management - A post further down gets it spot on, though perhaps is a little too critical. There are issues in any organization, and Ridecell is no exception. I have not found in my experience that there is any problem being heard, but actually enacting change is quite difficult - those that can are typically busy doing other work, and I believe that to be the single greatest issue the company is facing.", "- Easy to burn out\n- Lack of process and communication\n- Work ethic imbalance\n\n(hey, it is a startup though)", "The engineering department has been seriously mismanaged. After some much needed management changes, the environment never course corrected.\n\nThe result is that there was no cultural change and the department was left rudderless for a long time while it retreaded the same broken practices. The current management practices include a command and conquer approach using various levels of micromanagement and a healthy dose of poor communication. Management is more interested in attempting to wear the engineering hat and dictate solutions down to their reports rather than building up and supporting the engineers under them.\n\nThe result is a pool of talent that is suffering a major brain drain as the all-stars seek jobs elsewhere. Jobs that once held more opportunities for ownership feel more like mechanical/non-creative work.\n\nRecently, a re-organization doubled down on this direction. This leaves an impression that the management woes are either not understood at the highest levels or they are being actively endorsed.\n\nThe remote team has more or less been decimated through refusal to hire more coupled with poor work/communicate strategies. Lip service is paid to how important that aspect of the company culture is with no actions to back it up. I can't foresee remote work being sustained long term.\n\nThe organization as a whole can't stick to any consistent set of priorities. The results of which leave the engineering department thrashing wildly from project to project while not actually completing any of them to any degree of quality.\n\nThe result of this is that anything that requires a long term strategy such as tech debt or complex feature creation is nearly impossible in the environment. The whiplash of these changes is frustrating. Anybody who tries to act as a stabilizing force to combat it is frustrated, worn out and inevitably quits. There will be some serious fallout when it becomes evident that this is not sustainable.\n\nTech debt is willingly embraced and it often leads to more problems than it solves. Tech debt is rarely addressed. The product quality is embarrassing and getting worse as the talent declines.", "Some management inefficiencies create problems for communication between teams.", "New employees are joining almost every week and the company's infrastructure is playing a catch-up to accommodate to the growing number of employees. The new office building in February might address this problem."], "kortx": [""], "palantir technologies": ["None come to mind at the moment", "- No review system in place at all. This makes merit-based raises difficult to obtain for exceptional impact and allows a large number of coasters to thrive in the company. There is very little room for career growth for senior employees, and promotions are a mysteriously vague process.\n- Overly competitive environment fostered by inexperienced leadership via aggressive behavior towards direct reports and members of cross-functional groups. Bullying and jockeying for power is a serious problem at Palantir.\n- Below market compensation package. Palantir issues stock options that are illiquid and slowed growth over the years has limited their upside potential.\n- History of cutting perks such as the housing subsidy which in many cases are pitched by recruiters as a significant component of the compensation package.", "The kitchen operations analysts didn't appropriately plan for my gluten sensitivity, and they offered genetically modified food! NOT acceptable.", "Palantir is a truly flat structure, meaning you have to get used to finding your own path.", "execution-oriented to a fault; leads to management deprioritizing human capital development."], "syapse": ["> Tackling a challenging problem like precision medicine isn't for everyone; requires flexibility to switch gears and re-prioritize as the market evolves\n\n> The company is in a growth phase and performance expectations are very high; not a place to come and coast\n\n> It's a start-up environment so things can change quickly", "- Terrible work-life balance - 90 hour weeks and 2am phone calls are common\n- High attrition of engineers means that most are unfamiliar with the code base\n- Middle management is cold and distant; they act like they're above the engineers\n- Upper management is given to flights of passion, with shouting, public shaming, and other leadership-by-fear tactics commonplace.\n- PMO is significantly under-staffed, with sprint management falling to already overstressed team leads\n- Unreliable cloud systems lead to wasted development and testing time - which, as an engineer, you're ultimately responsible for.", "• Leadership is full of folks who love to point fingers, put people on the spot, and play the blame game. Is it too hard to hire people that are nice?\n• People generally don't smile. Like, ever\n• Too many meetings. I've never worked at a company with this many meetings as an individual contributor\n• Lack of structure around career growth and progression\n• Not a true software company (please hire more competent leadership with software experience), no real users of the product, and no iterative development", "> Some roles are really mundane such as the interop engineering role\n> Too much nepotism. A lot of former Relay Health employees are invading the company and culture has been degrading\n> Dominoes! People are constantly leaving. High attrition and management hasn't really helped with retention\n> Not a lot of IC roles, too much management roles", "- Team matters first nothing else, let there be no birdheads with manager in their titles running the show.\n-Most people are previous collegues at a specific big company, I find no falut with referrals but Syapse's reality is that this is simply corporate nepotisim, idiots bring idiots along.\n-Earlier Scrum meetings are run by tech savvy people who speak sense.\n- Servant-Leader Scrum Masters are good in general but in the case of syapse this was the worst decision ever made."], "sentry": ["None it is a good company", "Health insurance is a little on the expensive side.", "Very repetitive and you're expected to be an emotional punching bag for all customers. They can say anything they want and you're expected to have no feelings while people cuss you out back to back all day. No one is happy to be in a car accident so the calls are all pretty draining.", "Bit of boys club, specifically in Sales. Insurance sales in general is that way.", "The worst HR organization a company can have."], "sojern": ["No cons to share from me!", "None really. Unless moving fast and learning something new every day is not your thing.", "-Unlimited PTO. There is flexibility to take time off but would prefer a set amount of vacation that is earned and builds.", "Cross team collaboration can be limited at times but is definitely improving.", "There are no downsides to working here."], "great american restaurants": ["Long hours but it’s worth it", "slow to promote, required to work 6 shifts, dry cleaning expensive", "Inflexible scheduling. Management needs to work with employees who have circumstances that warrant rescheduling", "GAR is a system built to support the profit of the company while treating individual employees as being completely replaceable clogs in a machine. They exploit their hard-working members and make them pay for things that legally should be included with employment - you know all those tables that love to steal pens? Well, GAR forces it's serving staff to pay $2 for every 5 pens with THEIR logos on them and you are not allowed to use any other type of pen or you will be 'in trouble' or scorned for not following the GAR standards of service. The teenage hostesses are paid upwards of $16/hr (a portion of which is paid via tip-out of servers who are making less than $3.00/hr), while the extremely hard-working dishwasher who slaves away in the nasty dishroom cleaning up for the entire restaurant, if offered barely over minimum wage. The entire GAR system was built to make sure guests remain happy, despite the inherent flaws in the system that leave hard-workers high and dry but are always reminded to put on a smile. There is so much potential for a team service method in the restaurant industry, and GAR is completely failing at it.", "No room for growth. They would rather hire someone fresh out of college than promote from within.\nUpper management constantly hounding the staff, especially at corporate location.\nLong hours, bosses would guilt you into working shifts.\nNot much consistency with policies overall.\nPromotions based off how much you're liked instead of how hard you work.\nHosts make more money than kitchen staff.\nCompany is sort of living in the past."], "asurion": ["You get paid biweekly instead of weekly", "You have to start from the bottom", "Pay scale for coaches is less than the experts", "I have no cons. This place is awesome!", "Promotion frequency for engineering vs management tracks seems far too slanted towards the management side\nMerit pay increases seem to be below industry average\nAsurion is a very fast paced environment at times which is not for everyone, and can be difficult to get a good work/life balance. However a good balance is achievable and carries a lot of weight as to why I’ve stayed with the company over the years. That balance took me some years to figure out, and I’m ok with working at odd hours and spending time working on weekends when needed. A lot of stressful years were put in before I reached a balance so I need state that for clarification. Also my first few years with the company the growth rate was really straining the employees. Employees are far less strained overall these days, but the pressure and flux can be overwhelming for some."], "radley james": ["I never feel like leaving the office ever", "1) None as of yet", "Haven't been here long enough to comment.", "There are not any cons to working for this company", "1) Could do more social events\n2) Long hours but you get rewarded for the hours you put in"], "uber": ["Tough work load for everyone during that.", "Space... we're growing so fast, it's difficult to book conference rooms when needed.", "Start-up type issues on HR side with lack of information or process\nSteep Learning Curve (If External)\nPay is on the low-side for what a Team Leader should make", "Lack of autonomy. Lack of organization and structure.", "There is a lot of work to do here - while we do have opportunities to take time to ourselves with PTO - you can easily find yourself behind if you are not good at time management."], "bolt": ["sometimes they hire not the best people, but at the end they fix it.", "I can't think of any", "The company has values but they are actually not followed, especially by top-level management. It's more talk than anything else.\n\nThe salary is not good compared to other IT companies. You can be in charge of a lot of things and still earn less than in a non-managerial role somewhere else.\n\nDon't expect to be only doing your own job and that your responsibilities are not going to be changed (increased). Don't expect your salary to reflect the change in responsibilities.\n\nYou will get used to people being let go randomly on a day-to-day basis\n\nDepending on your department, you don't have much career opportunities", "Too distant from the matrix (Estonia), business decisions are taken locally with autonomy, but support on product or brand is not priority.", "Lack of communication between execs and local teams and no room for career growth"], "ricoh": ["Main business is shrinking globally.", "Senior Management has no sense of direction", "Management can sometimes be unclear about expectations", "The pay could be better", "Move around to much to get settled"], "glu mobile": ["- Office location: While the office space itself is nice, it's located in a neighborhood that can be a bit sketchy at times, particularly in the evening (not a huge con, but it's a factor to consider if you're taking mass transit)", "Corporate greed runs deep. As an employee you will suffer the consequence of leadership actions and get laid off. Don't worry. When you are either shut down or laid off, leadership will say, \"we didn't get large bonuses this year.\" Their words, not mine.", "Poor management that is disconnected from the development process and the consumer. It feels like a bunch of old men in a high tower deciding what they think mobile game users want (spoiler alert, they usually don't), deciding on unrealistic timeframes and expectations without consulting the devs and locking them into that deal by pitching it to shareholders so that there's nothing you can do but crunch to make it happen.", "Lack of upward mobility, compensation overall under market value", "Pace can be a little bumpy but its always headed in the right direction"], "cerium networks": ["No cons to work for this comany", "Management can be over bearing at times", "My manager changed over and over again.", "The pay is below the standard for the area and it seems the comp plans change every year to benefit the company rather than the employees", "1 word - Junkermier. Anyone that has worked here knows the meaning"], "riderflex": ["Nothing I can think of", "No cons to speak of.", "I have nothing negative to say about Riderflex.", "There are none to mention.", "They put other recruiters to shame, which is obviously a con for everyone else, not RiderFlex."], "arrow solutions group": ["No negatives besides what goes on in any technical staffing company in general"], "experian": ["I have no complaints about working for Experian.", "Long hours / pay on low side", "- Parking garage is running out of space\n- Sometimes takes too long for approval", "Raises are limited\nLayoffs are frequent and there is high job instability\nLayoffs have impacted company culture", "Very conservative in business practices. Averse to risks limits innovation and ability to be creative in meeting the needs of the customer in a seamless and smooth way."], "samasource": ["-constantly shifting priorities\n-too many hats, which sometimes made it difficult to be successful in specific functions", "Pay is not that great.", "-lots of turnover and some politics", "The office location is not my favorite, as 16th and Mission can get pretty rowdy, and the building itself is a bit old, but it's something I can definitely live with, especially since there is flexibility to work from home more often than other jobs I've worked at.", "My job title, manager, and responsibilities changed frequently due to turnover and shifting priorities. I was constantly taking on new projects and putting others on the back burner. It sometimes felt like we were chasing things rather than setting a strategy and pursuing it."], "stride consulting": ["I have face any cons yet.", "In order to attract talent and new business, Stride seeks to parallel product companies by boasting a strong culture, values, as well as a diverse and cohesive workforce. However, being a consultancy that sends its employees to client offices to work, Stride struggles to practice what they preach in regards to strong company culture.\n\nEmployees often identify more as an employee of the client than of Stride, or, conversely, Stride employees can feel isolated at a client since they aren't always able to fully participate in company culture and activities that the client offers.\n\nFor such a small, \"flat\" organization - it takes a long time for change to happen. This is because management is always focused on landing new clients and ensuring current clients are happy.\nThis makes getting a promotion, raise, or training very difficult at times as it is always de-prioritized in order to deal with client issues. Of course,this is not an easy issue to fix and has a lot to do with Stride's business model.\n\nStride is a difficult place to work if you are NOT a software developer as there is very little room to grow and there is little support for you. It is difficult for leadership to understand your value if you are not billing at a client and directly making Stride money. For this reason, employees who work at HQ are under pressure constantly to prove their worth. Because management is focused on clients, employees who work at HQ don't get the mentorship or support they need .", "I can't think of any.", "There can be some uncertainty around assignments, but this seems par for the course of consulting. It's just something to be aware of in thinking about if its right for you. Stride does a lot of work, however, to reduce that uncertainty and make sure your consulting engagements are rewarding and appropriate, so that is appreciated.", "Health insurance options are not up to par with similar tech companies."], "ultimate care": ["Ultimate care spoils their employees!!!!!!", "No 401K and no other cons", "Sometimes there’s no hot chocolate in the lunch room!", "There is cons to write down about UC.", "There are no cons to write about."], "skillz": ["1. the area is not the best which has been taken into consideration by Management and we are moving locations soon to a location that is MUCH better", "* Bro Culture still improving from top-to-bottom HR practices, ongoing conversations, and redesigned events\n* The focus on trying to hire more women has created long-standing vacancies currently being filled by multiple employees doing their best\n* Deliverable and results-driven culture makes it a demanding workplace for people used to putting in 3 hours of solid work, then reading Kotaku articles the rest of the day\n* Gym rewards/stipend still in the works (but at least we know it's being addressed)\n* 401K matching still in the works (but at least we know it's coming)", "Bad office location (not the nicest neighborhood in San Francisco)", "1. I personally don't eat lunch at the office (I'm an extremely picky eater, I make my own food), I see that a lot of people like to have lunch at the office so, it'd be nice if they provided lunch everyday instead of providing lunch a few days a week.\n  2. It would be nice if they could increase the amount tax deductible for traveling and parking. Caltrain is getting very expensive.\n  3. More than one company off-site a year would be nice. This is only a nice to have.", "- High employee turnover\n- Not an ideal location\n- Occasionally can be hard to push through new proposals as there is still a lot of executive oversight into most decision-making (which is not necessarily a bad thing as the C-suite level employees are all very intelligent and experienced, it just can make progress feel a little slower)"], "inspire home care": ["Difficult case managers on occasion - persistent calling to have shifts filled despite well defined availability. Failure to address client behaviour that was unacceptable and insufficient supervision/training.", "The pay is low, seems to be no room for advancement."], "nexleaf analytics": ["Nope. Everything was good and smooth."], "applecart": ["Growing pains of a startup but nothing major.", "Because it's a young company, some of the internal processes are still in formation. That means that there is a lot work to do, but this is also what makes it exciting", "- The engineering talent leans toward the junior end of the spectrum. Currently hiring more senior members but the current ratio means that some degree of process or architecture can be pretty green.\n- The current office is overflowing. Limited call and meeting space. Moving offices in July so this should be resolved shortly.", "There is a lot to be done. You really have to exercise and balance that decision-making skill of what's best to do overall versus what's most important right now. The growth has been a bit of a pain point, but I wouldn't consider that a con.", "1. Sometimes you will have to put in hours after work.\n\n2. This isn't necessarily a con but you are given a lot of freedom to complete your projects. Sometimes you will want more direction but will be forced to lean on your expertise."], "remote-learner": ["At the time of my employment there was not a lot of room to grow within the company.", "Micromanagement overkill.\nLack of tools to do the job being asked of us to do.", "The Leadership team does not make the best financial or management decisions. The future of the company is very unclear.", "Remote location is difficult in building relationships with peers", "Too much politics and poor organizational struture."], "turbine labs": ["- None that I can think of at this time, it's been a perfect fit!", "poor leadership\nbad treatment of analysts & employees\nculture can be toxic\nhigh turnover\nlow pay", "- The work-life balance can be challenging. However, it is in our company's DNA to do whatever it takes to meet deadlines or to help a teammate, making it worth the extra time commitment.", "Noting major, they are always trying to improve our environment", "Subject to largely scale in the next couple years (Positive) and is inevitably subject to associated growing pains – employees need to be prepared and buckled in.\n\nCompensation for certain positions is not highly competitive –however this tends to be balanced in good compensation for overtime work and equity packages in the company."], "plenty": ["Since it’s a mall job it does get slow", "Communication between head office and store management is not streamlined. Outdated systems.", "Small company and stores\nDoesn’t pay that well", "Busy sale season\nStores get hot in summer", "- not a lot of room for growth if you want to move up in the company\n- HQ not very consistent with store policies when it came to customer issues\n- not a lot of support for store manager when they were going through a hard time"], "systimmune": ["Management is very conservative with funds on purchasing equipment and salaries", "leadership is out of touch with realistic expectations and constantly changing goals means slow net progress. pay for everyone but entry level is at the low end. non-salary benefits are well below industry standard.", "-Upper management is inexperienced in the full process of biotech drug development and it shows. Constant requests/demands to shorten timelines and cut out developmental milestones, with no justification offered.\n-Scientific integrity is becoming questionable, with senior management asking for \"tests to prove X will do Y\" instead of asking a question and seeing what results the tests produce.\n-Little time is allowed for documentation, both in daily work and in writing larger reports and other supporting technical documents for transfer or later filings.\n-Strange budgetary decisions - OK to buy a new mass spectrometer, but not OK to pay for a day's parking at the airport for an employee flying to a seminar and back in that one day."], "crawford group": ["I wish the benefits were better / less expensive.", "Little interaction after contract signing, little feedback on performance.", "May not have as many strong relationships due to restructures inside their clients.", "Not a lot of opportunity once project is over.", "None at all, extremely happy with Crawford Group benefits and the affordable prices, benefits and support you receive around the benefits I have chosen."], "palantir": ["None come to mind at the moment", "The kitchen operations analysts didn't appropriately plan for my gluten sensitivity, and they offered genetically modified food! NOT acceptable.", "Palantir is a truly flat structure, meaning you have to get used to finding your own path.", "execution-oriented to a fault; leads to management deprioritizing human capital development.", "by default, women are not taken seriously here. it is possible to transcend this attitude by ignoring every interaction and demonstrating \"grit\", but it takes a toll."], "facebook": ["Some of the teams are moving too fast.", "- If you don't learn to make the work life balance work for you, it can be exhausting. But you'll also be given lots of support with this if you ask for it.\n- It doesn't matter how good you are at your job, chances are you're going to be surrounded by a ton of other people who are just as good if not better. Imposter syndrome is real, but if you got an offer, you probably belong here too.", "Like any tech company, the work is big and complicated so work/life balance can suffer from time to time. The difference is that it's the passion within the individuals that drives them to work long hours and forego time off. Of course there can be times when schedule demands force the imbalance, but it's not such that 10-12 hours days become commonplace and expected regardless. We do what we do to get the job done; no one is killing themselves because there's an order to do so.\n\nBeing able to eat to your hearts/stomachs content can be dangerous to the waistline, but that's a self-control thing and not the company's issue.", "Lack of support staff, too guarded of brand, lack of benefits", "My country is far from here, and would love to come stay over."], "kiva": ["you will not earn any money", "Leadership - they don't seem to truly hear the voices of the staff. There's a lack of value and appreciation - not appreciating who has been there and done the work before they swept in. Hiring from the business world can be great - we need diversity and strong skills - but operating like a corporation in a cold way is not what we came for. There's a total lack of trust in the leadership. They get rid of people, who they say aren't needed, then hire for the roles again. This has happened multiple times in different departments.", "Small company, little room for growth.", "The 'new' CEO and the leadership team are incredibly cocky. They are in a tearing hurry to get rid of everything that is 'old' instead of honoring it and building on it. This has led to deep discontent within the organization, that has led many to question what is valued around here (despite our new values).", "As a non-profit, the pay is obviously less than most for-profit tech salaries in the area. There was also a fair amount of turnover in 2018, but I feel more confident in Kiva's future growth than ever."], "octo consulting group": ["Highly touted benefits are just average", "A few bad apples spoil the bunch. Several in management with their own agendas purposely gave false/bad review of good team members ultimately affecting their bonuses and causing them to leave the company. Those members went on to be extremely successful elsewhere.", "They have a culture of insiders and outsiders. If you're not an insider, they don't care about you as an employee and your only function there is to make them money. If they lose a contract they will find places for people based on personal relationships, not on skill level. It doesn't matter if you won contracts for them in the past and are highly skilled, if they want their friend on a contract, they will force you out by moving you off the contract and promising work on another project, which doesn't exist.", "Long hours, micro-management at all levels, acting too fast to win and doesn't care about burning out people, all profit driven, good old boys network at the top. There's def an in-circle and some execs will get rich when others won't get a whole lot for working so hard. The bonus plan is off balance and there's def inequalities all around.\nThey go after every single work but can't keep current customers happy. Kinda hard to do when customers see constant change in management and teams.\nThe work is interesting but it doesn't have to consume all the hours in the day, nights, weekends.\nSome execs are approachable and very reasonable (like CTO and NS) but not so much with others who've been with company for over 10 years. Gossip and internal politics is constant and toxic at HQ. Ask yourself why they can't keep their people.", "may not be a good choice for a long term career move"], "sema4": ["Growing so fast much work to do!", "The organization has grown very fast and the workload can be high but process improvements are happening fast and will truly help productivity. Best environment for those who enjoy challenges, changes, care about patient care and want to learn everyday and feel part of a team that relies on each other with accessible managerial support. Transparent metrics are needed and hopefully coming soon which will provide more clarity on how individuals can improve to make steps towards personal performance objectives.", "There’s plenty of work to do so best if that environment is stimulating to you. Not for those looking to cruise by.", "Health insurance is terrible. Not ideal for families or people with chronic health conditions.", "Top-down managerial culture, like feeling insignificant? join\nLack of coherent strategy\nIncompetent leadership"], "adobe": ["Not much to complain. No free lunch?", "There are no negatives so far", "Nothing major comes to mind.", "Benefits are not great at Adobe.", "- 10% of the people do 90% of the work\n- A lot of people have been there over 20 years and are stuck in their ways. They have no idea what is happening outside of Adobe and are building things with no vision.\n- Teams are built without being staffed properly. Too many stakeholders get involved which make every extremely slow\n- People are extremely fake. They are going to be nice to you and then talk behind your back. Alliances are everything.\n- Management work based on fear. Unless you follow your manager blindly you can't get anywhere. They want change but they don't really want it.\n- Creativity and ideas are not welcomed unless it is aligned with what leadership wants.\n- Lots of people are there for a paycheck. Lack of talent\n- Extremely slow paced environment\n- The tech stack is surprisingly bad. It is not a tech company, it is a marketing one.\n- Product managers don't have sprint teams, they are consultants for the most part.\n- Most PMs don't use their own products and build without a vision or innovation\n-Growth is impossible as they are already so many managers and people get promoted on time spent on the Company vs impact."], "comscore": ["fast-paced, many procedures to learn", "Odd shift hours, Poor KB discipline", "benefit is not the best, bonus is not the regular meal", "A company not worthy of the talent that has decided to stick around while they shuffle business models and rotate CEOs like a bad card game. Then you come to the realization no one on the decision level has a clue and the level of dysfunction is beyond repair.", "Very poor pay and slow growth. Far below industry average. They want great people to do great job but with low pay. How's that possible???"], "churchill navigation": ["I wish I started my career at Churchill. For young professionals, I can hardly think of a better place to start. But to hire and retain more senior engineers, the company needs to match compensation packages offered by large players on the field. CEOs make 100x more than junior engineers but can't deliver more code than 100 junior engineers. Still, the market recognizes their unique value added. Perhaps a similar trend exists across the entire continuum of experience levels.\nMake sure you negotiate your employment contract well.\nPragmatism is the strength and weakness of the company: PhD types do not do well.", "Company employees better learn to suck up to Bill", "-Some growing pains as the company figures out how to transitions from cowboy small development to a larger company. It's a good thing the company is growing though! Until this happens, be prepared for spending a little extra time guiding yourself.", "The benefits aren't as good as a large company. Specifically, there's no 401k match and health insurance is only partially covered.", "Nothing I can think of at this time. Any con would be pretty minor"], "blue apron": ["Short breaks , breaks are too short", "Salary is below average for management.", "40 degree working environment\ncompany is still unstable\nlayoffs tend to happen yearly", "Very cold and long hours overnight, too many missing ingredients.", "They don't tell you when you're no longer needed\nphoney managment"], "hi clark": ["Still an early stage company so there are some growing pains and things to figure out but leadership absolutely know what they're doing"], "leidos": ["- Not many PTO holidays given (must use PTO for Christmas Eve, NYE, etc), but fairly generous with PTO\n- Late night and weekend work does happen, especially if you work on proposals\n- Does not provide a large amount of tuition reimbursement (oly ~5,000/year)\n- Awful paid maternity (only 2 weeks!!!!!!!!) - this is my biggest disappointment in Leidos!", "The retirement account match could be better, currently 5%.", "Slow to find contracts to move people onto sometimes, but also part of the nature of the business.", "• Too many managers are managing up instead of managing their teams\n• Too much micro-management\n• Too many silos\n• Saw too much juvenile behavior among senior managers\n• Inconsistent or selective application of corporate policies", "Office politics and no clear route to advancement other then have friends in the right place"], "michigan united": ["Weird race issues. Most upper leaderships white and- working in non-white communities, and tokenized blacks and Latinos. Trotted them out for pictures but not let them have much say in what's happening. Senior staff surround themselves (including board) with \"yes men\" so if you want to stay, you better be a yes man too. Part of the job is stroking the executive director's (immense) ego. They also blatantly, routinely, stole credit for other community's organization's campaigns and tried to take them over so they could claim it as \"their\" campaign and get more grant money. Really unethical but I kept my mouth shut for fear of getting fired, but it has such a bad rep in the community. It's unfortunate, because they could do a lot better. They have a lot of resources that could do so much good, but they operate in sneaky and unethical ways and burn so many people and communities. Goals are really good, but way they are doing things is bad."], "affirm": ["I can’t think of any.", "Priorities shift often and there is not enough accountability", "Growth stage issues, concern for long term success", "No 401K match - yet! There are GREAT benefits outside of this!", "Typical high growth start-up with a lot of first-time managers. With much success also comes politics for individuals to navigate. The company has had a hard time living its core values internally, externally, though, I believe the product continues to deliver on the company's values."], "synack": ["Not a huge fan of the location and commute.", "Haven't come across any yet", "There are no cons at Synack.", "I have not come across any cons!", "As with any startup resources are limited. People wear many hats and budgets are limited."], "symplicity corporation": ["Need to make sure the focus is placed on the strengths of the product and the culture of doing right by customers now and in the future.", "If you want premium processing on visa application, it is up to the employee to pay", "low salaries, limited growth opportunities, any open management position they hire externally, lack of interest in employees", "-Typical of a smallish company: not as much support or resources as you would find at a large company\n-Would like more connection between international teams and offices", "Dying organization. Handshake is definitely the route here. This product is soon to be irrelevant\n\nLow pay\n\nTries to instill fear"], "hudson river trading": ["The amount of perks everyone has can create a culture of privilege among a few people.", "Most positive feedback is implicit. On the other hand negative feedback is actively given.\n\nIt is difficult to gauge expected performance even with quarterly reviews. It is even harder to figure out how to exceed expectations.\n\nIndividual growth comes from within. There isn't room for hierarchical growth. This isn't a con for me, but might be for you if it's something you look forward to.", "can't think of much.", "The interview can be very difficult; it's hard work to measure up to your peers.", "Sometimes if you don't do the right thing, you get blamed very quickly. You must be able to keep up in a fast-paced environment."], "johnson controls": ["None at the present time", "Culture , Medical benefits , Job security , Employee events, Safety policys", "Lower level management does not work with employees for opportunities to advance. Reviews and personal goal setting are just an exercise required by corporate that have no meaning or worth to most managers unless it effects there personal agenda.", "The safety policies are over the top.", "No cons that I can think of"], "intrepid control systems": ["A weird and hobbling lack of structure given the company size", "The company is growing too fast that there is limited office space. Working on multiple projects at one time.", "Location, out growing the office space available", "location, traffic, commute, space, parking", "Perhaps it was just my experience, or maybe it was just me, or perhaps it was a lack of curiosity, but I found that there was little direction or pressure on me as an intern to really accomplish anything."], "asana": ["- You just have to be flexible and a self starter, no one's going to hold your hand or micromanage you, so its on you to get work done...which I actually love but some people could see as a con.\n- It's a start up, so new product releases, new processes, trial and error and again just the ability to adapt to that if you're not used to it already could be seen as a challenge.", "• People managers are generally inexperienced and given way too much trust\n• \"Transparency\" existed for a minute and then was wiped out of the organization\n• Overly serious about itself and how playful it is, but never really feels adult\n• Conscious Leadership Group never stops feels like a Corporate Philosophy\n• Compensation is way below market and receiving positive adjustments to that in a way that feels \"timely\" is almost impossible\n• HR/People Ops problems rarely get fixed and are swept deep under the rug\n• You will work more hours a day than you'd probably expect, partly because there some how aren't enough people to do the work and the work will still be expected of you.", "Because so few people leave, many of my professional connections are still at Asana instead of spread out throughout the Silicon Valley like if I had worked at Google for example.", "Thoughtfulness can breed slow decision making at times, you need to have strong conviction in order to weather the storm at times. The engineering-focused systems that were set in place during the early years of the company can be difficult for business teams to gel with. Cross-functional processes and teams can be bottle-necked by one employee or key decision maker, hopefully, this will be fixed with more hiring and scaling of internal teams. Product team can portray a superiority complex at times, but when you understand that it's in the companies best interest to make sure the engineers are happy that's ok.", "The reflective/mindful culture can sometimes be a drag on quick action."], "invexer technology": ["not high salary, benefits are not good"], "google": ["no cons at the moment", "1) Work/life balance. What balance? All those perks and benefits are an illusion. They keep you at work and they help you to be more productive. I've never met anybody at Google who actually time off on weekends or on vacations. You may not hear management say, \"You have to work on weekends/vacations\" but, they set the culture by doing so - and it inevitably trickles down. I don't know if Google inadvertently hires the work-a-holics or if they create work-a-holics in us. Regardless, I have seen way too many of the following: marriages fall apart, colleagues choosing work and projects over family, colleagues getting physically sick and ill because of stress, colleagues crying while at work because of the stress, colleagues shooting out emails at midnight, 1am, 2am, 3am. It is absolutely ridiculous and something needs to change.\n\n2) Poor management. I think the issue is that, a majority of people love Google because they get to work on interesting technical problems - and these are the people that see little value in learning how to develop emotional intelligence. Perhaps they enjoy technical problems because people are too \"difficult.\" People are promoted into management positions - not because they actually know how to lead/manage, but because they happen to be smart or because there is no other path to grow into. So there is a layer of intelligent individuals who are horrible managers and leaders. Yet, there is no value system to actually do anything about that because \"emotional intelligence\" or \"adaptive leadership\" are not taken seriously.\n\n3) Jerks. Sure, there are a lot of brilliant people - but, sadly, there are also a lot of jerks (and, many times, they are one and the same). Years ago, that wasn't the case. I don't know if the pool of candidates is getting smaller, or maybe all the folks with great personalities cashed out and left, or maybe people are getting burned out and it's wearing on their personality and patience. I've heard stories of managers straight-up cussing out their employees and intimidating/scaring their employees into compliance.\n\n4) It's a giant company now and, inevitably, it has become slower moving and is now layered with process and bureaucracy. So many political battles, empire building, territory grabbing. Google says, \"Don't be evil.\" But, that practice doesn't seem to be put into place when it comes to internal practices. :(", "* It *is* becoming larger, and with it comes growing pains: bureaucracy, slow to respond to market threats, bloated teams, cross-divisional tension (though nothing remotely approaching that of Microsoft's internal tension).\n* The quality of the engineers is possibly dropping, but possibly not. It's hard to get real metrics, because as the absolute number of people grows, naturally the number of bad apples grows; as a percentage it's supposedly the same as it ever was, but with larger numbers of poorer quality engineers it just _feels_ like things might be changing for the worse.\n* Also with growth means more internal-confidential data leaks (again, because of the raw numbers of people) -- product announcements being ruined, etc. That means the company has to be tighter-lipped internally to avoid leaks, which makes things less open. It's still an amazingly open place, but less so than it was even a couple years ago. The good thing is they recognize it and actively look to improve things because they know how important it is to keep the good culture.", "I live in SF so the commute can take between 1.5 hours to 1.75 hours each way on the shuttle - sometimes 2 hours each way on a busy day or rainy day. That means being on the bus for 3-4 hours PER DAY. It's a wired bus though which means you can work on the way to Mountain View. But it can feel brutal.\n\nYour first year or two are really important in terms of your career at Google and they affect how you're viewed, and your ability to be promoted. You should always ask to work on high profile projects. If you don't get them, don't expect to get high ratings or get promoted. Always volunteer for cross functional group work for maximum exposure, and then work hard at those things.\n\nYou'll likely work on something that no one will explain to you and it will take you at least a year to be comfortable doing what you're working on, even if you're super quick at learning. No one has time to train you or teach you what you're doing - which is kind of hard.\n\nAfter two or three years, people you started out with at Google start to get promoted. If you're not one of them, you'll wonder why and how it happened, and that process is somewhat political and not always clear.\n\nIt's a big company now. And super political. So don't be naive. Expect some people to be catty, some people to be territorial, and be prepared to be mentally tough. Don't let people see your vulnerableness. It's a Darwinistic culture with a huge dose of 30-something idealism on top which can fool you into thinking that people are easygoing - they're not. They're driven. If you're not driven, you're not going to fit in.\n\nWhen you start at Google, it seems like peer reviews are super important - they are, but they are the sprinkles on the fro yo. The important thing is that your direct manager knows your work, likes your work and likes you, and then you can get promoted. If your boss doesn't like you, all the positive peer reviews in the world won't help you. Make sure you know what your boss wants, and give it to them. You will have weekly one on ones, and make sure you are addressing your performance at each one, asking if they have questions, how you can improve, can you work on cross functional projects, etc.\n\nIt's really hard to find work life balance at Google. The workload is huge. I hardly have time to work out. The commute is brutal. My family sometimes needs more from me and I can't give it. I'm still trying to find the balance. I think I need more down time than most people so I have a hard time being structured every day to fit all the things I want into my day, so a lot of things slip, like working out.", "It's a big company. Not all parts/teams/people are good.\nIt can be hard to \"assume good intent\" when interacting with people you do not know across the company.\nIt can be hard to get things done because the company is so big that you have to find your own roadmap."], "the washington center": ["Some of the upper level managers, directors, and VPs, have different visions and conflicting goals for the organization, thus creating a lack of direction sometimes. Some people in managerial or director positions don't have any management or HR training and don't know how to properly manage staff. If you were in academics you might get burned out quickly.", "Long hours with a lot of juggling necessary as there are multiple projects constantly in progress.", "Having a demanding full time job limits the part time work done at TWC, leading to sleepless nights of administrative work and students emergencies. Prioratizing and scheduling before time is the key, as it is team work and not being ashamed of asking for help went needed. But all the hard work for a purpose is worth it.", "-Organization has fairly high turnover due to mediocre salaries", "Can be a high-stress job during parts of the year. Some colleagues are territorial over their contacts, projects, etc. Need an advanced degree to be promoted beyond senior coordinator. Work culture can vary department to department depending on your manager/director."], "oktana": ["1. No workflow at all\n\n2. No room for new ideas\n\n3. No transparency on anything\n\n4. Not tolerant of opposing views\n\n5. No onboarding process - I had to use my colleague's cellphone hotspot to connect to Gmail for the first time\n\n6. No budget for anything company related, including company toiletries or office snacks\n\n7. No real office, we use a shared-office space for mail but work out of an apartment\n\n8. Terrible benefits, if you can even consider it a benefits plan...\n\n9. Expected to use my personal phone to make business calls\n\n10. Both owners micromanage every aspect of the company and do not trust anyone else to make any decisions\n\n11. Owners are constantly measuring the worth of each employee to see where they can cut back\n\n12. At the end of the day, the owners are brothers, if either one makes a mistake, the blame will be placed on whoever was conveniently involved. Accountability is not a value here.\n\n14. The turnover rate is through the roof", "This company can never be successful under the current owners. Wildly mismanaged. There is zero infrastructure, and no job security. It’s complete chaos. There is no strategy or any procedures in place. They refuse to take constructive criticism. I was forced to send out work that I was embarrassed to have my name tied to it. The head of the company micromanages every aspect of your job while simultaneously not knowing what to do. They actively prevent you from succeeding. I wish I read the reviews before accepting my position because all of the negative reviews accurately depict exactly how awful it is there. I genuinely can’t imagine any of the positive reviews to be actual employees, and not just the two men who are failing to run the company. The boss will tell you to do something, and then yell at you for doing it. His main strategy is gaslighting his employees, and avoiding any ownership of the deep seeded problems within the company. They have no consideration for people’s time, nor do they have any respect. Highly incompetent leaders with big egos. Truly an embarrassing organization.", "Constantly changing the expectations and office rules.\n- Contractor contracts to avoid paying taxes and offering a bit higher pay (because they dont pay taxes on it, they still make a higher margin than what they offer)\n- No real career path or growth.\n- Growth means taking more projects without a real benefit , just extra workload for a few more bucks.\n- Owner is very hands on and very controlling, has left many workers crying due to pressure and veiled threats.\n- Higher role developers always leave for better companies, never stay to make the company grow.\n- This company not exist in Uruguay, just give to us a \"name\"", "- Constantly changing the expectations and office rules.\n- Contractor contracts to avoid paying taxes and offering a bit higher pay (because they dont pay taxes on it, they still make a higher margin than what they offer)\n- No real career path or growth.\n- Growth means taking more projects without a real benefit , just extra workload for a few more bucks.\n- Owner is very hands on and very controlling, has left many workers crying due to pressure and veiled threats.\n- Higher role developers always leave for better companies, never stay to make the company grow.", "Not clear career path.\nNo benefits.\nContractor employment.\nHitting the ceiling to fast (career wise).\nLack of internal processes (everything is in the air)"], "cloudflare": ["Would be nice to have a 401k match.", "The company is growing fast and not everything is perfect.", "If you like a lot of structure and a defined focus, you will be made to feel uncomfortable. We are building out structure and accountability, policies and processes, etc., but we are not entirely there yet. We need people who want to help build those controls but don't need them.", "Like many fast growing companies we have our growing pains. I don't know that I've got enough information to diagnose what the biggest challenges are. Still, in the conversations I've had it's clear that people are engaged, interested in understanding where we can improve, and will to expend the energy to make things even better (and they're already pretty awesome).", "Can't think about one right now. There is definitely a lot to learn once you are in, but I would put this as a positive aspect."], "mattersight": ["I cannot think of any cons.", "The reality is that a very specific set of attributes is required for the solution to actually produce positive results, and most companies did not fit that profile. So we had lots of initial interest but very few conversions.", "Lack of transparency with regards to company goals and product development", "silos group in three locations", "Lots of silos, many due to 3 geographically separated, functionally disparate offices\nLip service to being/trying to be a software product company while continuing to entertain high touch engagements that distract teams from organizing around products\nVery few deals, low market power with customers"], "upstart": ["It often feels like we still want to be a small startup culturally but after a few years of success we've grown to the size where this is always possible.", "sometimes need to take a step back and ensure the foundations are in place to support it in say recruiting, managers, systems, etc", "Lack of upwards growth potential. It's difficult to move up and I don't know if moving up is worth the amount of time required", "Intensive training for most analyst positions", "- There is a lot of office politics. Only office favorites get promoted or raises consistently.\n- Upper management does not take the input and advice from employees seriously if it is outside their own opinion. They will say that Upstart is a meritocracy but this is simply not true. Do not drink the koolaid.\n- Raises/promotions realistically only happen once a year, and only if you do extremely well on your peer review and enough of upper management likes you.\n- Your workload will increase beyond the initial job offer but your pay will not. If anything you may get a title change and simply be expected to work more.\n\nAll in all, this is a great place to start your career but not to stay and work long term. I am, however, grateful for all the life friends I have made. Recently a lot of people have been leaving at a rate of one person per week. Don't stay longer than you have to if you can help it. They have been known to extend job offers for new hires and then take back offers last minute based on the needs of the company. Management has recently been trying to host more events to boost company culture and moral. This was after receiving poor results on an internal happiness survey. It may be too little too late for some."], "zymergen": ["Doesn't seem to be as positive for those in manufacturing production or development. For those, it depends on your team lead", "Some cons are communication between departments. This is a work in progress, but nonetheless at the very least it is being addressed.", "A Parking space is not guaranteed. No 41k so far. Long hours to work.", "Growing quickly so beware if you’re not used to flexible responsibilities.", "None of what I mentioned above seems to apply much to the manufacturing or development jobs at Zymergen, which live in a whole different world and get paid much less for harder work. I keep hearing stories of people who are eating their first food ~8hrs after starting the day, and are planning to go back to work after their break as I am leaving for the day. They get paid less, they work longer hours, and they seem much less happy than the technology folks overall. That's why you see the huge gap between 1 and 5 star ratings on this site. It's probably a bit of Zymergen pumping their own reviews into the mix, but it's also some people like me who simply don't experience a lot of the problems that people are upset by on this site."], "wicket labs": ["To make a new idea exist you need to displace an old one. This takes time, commitment, and persistence. An established company will offer you consistency, sometimes better compensation, and a predictable order. Start-ups are the opposite, and that is the nature of what makes them great. Its high risk and high reward but you know that you are doing something new and fresh. That said, if you are in a high risk environment and you want to make a change, there would not be a better team to help navigate this uncertainty than Wicket Labs. They are committed to success and have the experience and drive to win. Work is fun.", "As a smaller team, projects can be dependent on a single individual, which can be stressful.", "The ongoing construction in Pioneer Square can be loud and distracting, but there are options to work in different areas in the building or at home if it becomes too much of a problem.\nThe offices are snug, typical of what's expected from a startup. I find that I have enough space to be comfortable, but it might be a big change for someone used to having their own cubicle or office.", "Love the location right now (Pioneer Square), but I fear congestion in the area will worsen due to construction on the viaduct tunnel.", "Being in a (currently) small team can sometime delay projects if they depend on only one person. Sometimes it’s an opportunity to learn skills you wouldn’t normally encounter in your role."], "kaplan": ["Too much turnover; managers frequently come and go", "None. It's a good place to launch a career", "Well, it was a really good opportunity, not much to complain about.", "A lack of guidance can be difficult if it's your first time teaching.", "No full time work"], "silicon systems": ["Management gave me the responsibilities but not the rights so there where so many disputes during management"], "nuna": ["Ambitious agenda, a lot of work!", "- There could be an improvement in cross-team communication\n- Priorities can shift and change quickly. This also comes with the territory (being at a start-up) but it sometimes means your time hasn't been used effectively", "Changing things in healthcare is slow and the impact of your work is not always obvious or immediate.", "regardless of how much you get paid, who would not like more pay", "The company is lacking some basics: a product lifecycle that provides a common baseline and vocabulary for communicating status; an emphasis on budget and cost awareness that is driven down to all levels of the organization; for new products and services, a crisp vision of how they will be packaged, licensed, and sold."], "khoros": ["* Still a lot of unknowns\n* Disparate systems make for challenging day-to-day execution", "Just acquired by Vista Equity, so working through a number of pains related to the merger", "Lunch isn't served on fridays.", "- The politics and gossip here are insane. In general, anyone in a management role is way more focused on managing up then they are helping grow and support the team they manage.\n- Middle management is a joke, personally speaking, my manager had no experience in leading (director level) and could care less about employee growth. I constantly asked for feedback and what I could do to get to the next level in my career and received no support or advice. I even took initiative and put together a growth plan for myself and walked him through it and it was pushed aside.\n- Prepare to be chained to your desk or given the side eye if you leave to work from home or work from a coffee shop. There was little to no trust in employees to work autonomously.\n- No growth opportunities.", "the merger/acquistion resulted in an inordinate amount of lithium leaders staying and a huge amount of Spredfast leaders being shown the door. It was publicly stated in meetings that the newco by the new president and CEO that they wanted young , inexperienced (and cheaper) people to grow into roles...smacked of agism across the company"], "dattner architects": ["Civic work can be a challenge in terms of finding opportunities design exploration.", "Small annual increase. Poor family insurance. Hard to transfer from one studio to another.", "-Management capability between studios is extremely inconsistent.\n-Certain PMs in the Housing Studio don't do much work in terms of architecture, client, or team management. Zero CA knowledge. Would never be able to find a job if they were to leave Dattner. Spends most of their time monitoring their colleagues to see who he/she can rat on in hopes of promoting his/her own self worth.\n-Management in the Interiors studio is usually seen making personal calls or chatting about his/her personal life, and can be heard throughout the studio. I've never personally seen him/her perform work-related tasks. Not sure what value they serve to the firm.\n-Principals need to identify and appreciate those who work hard and care about doing a good job, and recognize those who just talk and don't actually perform.", "The success of the firm has made it very large in size. This can be a negative depending on what type of firm you're looking to work for.", "weak communication to staff about firm management's decision process/reasoning"], "trifacta": ["Internal processes are somewhat disorganized, and you sometimes get requests from random people within the company to do stuff. Product deployment and integration is complicated.", "very disorganized making leadership teams working separately with no sync between them", "Not a lot of process, sometimes feels chaotic", "Hitting a fast moving target in an emerging and evolving space can be frustrating [especially when you're understaffed]. It can sometimes be difficult to get these teams all working in unison -- but it's quite magical when it happens.", "Needs to iron out its path forward"], "mission data": ["Most work is conducted through Slack, some projects can get disorganized due to employees in different time zones.", "- The company is split between Louisville and DC, with many people working remotely or often from home. While the option is great, it can limit company culture.", "Sometimes could not get as much guidance as I needed"], "b2b soft": ["would love to have more company events outside work", "office infrastructure needs improvement", "Slightly shifted the work-life balance", "nothing negative. in the period of rapid growth need to keep more focus on customers and employees.", "Benefits are awful... Company encourages \"throw your co-worker under the bus\" environment ... be prepared to be spoken down too and belittled on a daily basis. Reminded me of a daycare for adults ... Do not waste your time. There is no room for growth, no one respects your opinion and they favor those that do as they say and bring no innovation to an already broken work environment."], "richmond university medical center": ["Stand alone hospital, not really financially stable", "Poor reputation among medical professionals.\nShort staffing is constant.\nManagement doesn't value the staff.\nLow pay. RUMC pays less than other area hospitals.\nBuilding is very old, needs major renovations.", "Leadership and executive management do not consider the staff or patient needs. Their only worry is staying budget neutral.", "No room for advancement, no yearly raises at all, and a lot of office politics.", "None I can identify at the moment"], "wellpath": ["Heavy workload Patients not always available to see", "Don't focus on client care, poor benefits", "Shady stuff goes on, management show favoritism", "Medical benefits aren’t the best", "Not enough training or support from management"], "vertafore": ["I really don't have any", "No promotions, no competitive salaries.", "It seems that there's effectively a system of classism amongst developers here. A few developers get decent equipment from one brand. Everyone else gets low quality laptops and monitors from another. The team you're on will dictate whether you're properly equipped to do your job or not. It's a blatant system of inequality that will set you up for frustration at the very least.\n\nThere were retention problems which managers openly admitted in the past. What this really means is that there are few colleagues who are well qualified or motivated still here. You'll be working with leftovers or a few developers in positions of power or higher status for the most part.\n\nIt seems to be process heavy. You'll knowingly be doing work that serves no purpose or will be replaced soon after. It's an exercise in insanity.\n\nNot at all a meritocracy.\n\nIt seems to me that they practice waterfall here in all but title. Yes there are sprints. Yes there are scrum masters and various Agile ceremonies. But. Everything is planned and committed to 12 weeks in advance. Meetings are frequent and feedback is ignored. It's a \"process over people\" society here.\n\nFrom what I've heard and seen, it seems that generally a promotion will not be offered unless someone with a higher title quits or you put in your notice yourself. There have been a few exceptions. Note the word \"few\".\n\nToo many other problems to list.\n\nLimited growth opportunity. Non-existent career advancement opportunity.", "Lack of decent equipment. Seems like people get cheap PCs or used macs. WiFi cuts in and out all day, making it difficult to get work done. There could be much more flexibility in remote work.", "Too many to mention, but the big ones include low compensation, no direction from management, and constant moving goal posts. Don't expect to move up here."], "getty images": ["My focus is generally shifted to short-term thinking; probably because my role doesn't always require me to think longer term. This is a con for me because my strengths come in when I think about things more broadly.", "Some of the lowest pay in industry.", "Growth Targets are aggressive and unattainable\nComp plan is set up so that it’s best to be only at 100%\nIn 2019 you have contracts from 2017 in your base\nSome managers micromanage\nLots of admin duties", "Top heavy management, not tech focused, new CEO is very political, too many management layers, mediocre talent.", "Little opportunity for advancement. High turnover as a result. No training."], "fitbit": ["high turnover, always feel behind the curve", "- Existing executive team still around from the start up days, even after poor market performance, massive attrition, and major complaints from employees\n- CEO who is still way too deep in the weeds of product instead of providing the strategic direction and leadership needed to sustain the business\n- lack of commitment to a vision and direction creates major spin and time wasted on work that never makes it to market\n- Disempowered product and marketing teams unable to make even the smallest decision on their own without an executive approval", "- Opportunity to roll up your sleeves... because you’re constantly fighting fires and cleaning up messes.\n- No clear path for growth; results in in-fighting among middle management\n- Lack of innovation/always feeling behind the curve\n- Unclear strategic vision from senior leadership.\n- Lack of alignment from senior leadership", "losing momentum\nlots of disorganization of upper management\nnot a clear vision anymore", "I’ve never been anywhere that felt more like a sinking ship. Everyone is scrambling to get off.\n\nContinual layoffs feel like peeling off a bandaid very slowly. It is public knowledge that execs want to shed headcount. Just get it done already."], "formation": ["\"When companies grow quickly, there are more things to do than there are people to do them. \" -- Sheryl Sandberg", "It still is a startup, so there are a lot of lower-priority things that need to be done can't be done right now", "- Some typical start-up growing pains like changing priorities\n- The workload can be challenging at times", "A lot of work, but I have a sense of accomplishment when it is all done\nGrowing as a team can be overwhelming at times", "- Dysfunctional and inexperienced founding team that wreaked havoc\n- CEO that gets knocked over with a feather and listens to whoever has his attention\n- No product or product strategy\n- Manipulative and backstabbing culture"], "averna": ["Growing fast and acquisitions means processes are constantly being adjusted and refined to accommodate new business needs\nWorking efficiently means you may never get everything done on your todo list, so you have to focus on high impact objectives", "No career growth as an engineer\nLow salary\nShortsighted management\nProcesses are confused and sub optimal\nSome low performing employees are kept in place just because they are family", "Growing fast and processes are constantly being adjusted", "Unfocused growth. Business plan is primarily just to make more money. Senior management have little technical background and little understanding of the core business. Pay raises typically below COL. Stingy profit sharing. Few people who have been at company longer than 10 years.", "Confusing place to work. I did not see any possibilities for growth and development. It's like someone already posted- a good place for transitioning between jobs."], "webpass": ["None. Keep doing what you are doing", "Pay trends on the lower end.", "Management overall is approachable but if you get on the bad side of sales leadership you’ll be bullied and given no choice but to leave. Hostile work environments should be addressed but that wasn’t the case in my particular office.", "I haven't come across any yet", "No comments. this job is perfect"], "stanley black": ["micro management was the most difficult", "Reorganization due to financial headwinds did not allow employees a chance to relocate or take alternate role within company.", "Long hours and little breaks", "Insurance is kind of expensive and doesn't cover much", "Driving is half the job, in 18 months I traveled over 40,000 miles to different Home Depot’s in the area. You work directly with Home Depot associates who don’t really care for what a vendor (which is what you are) has to say. Very competitive to move forward, especially in a city you would like to live in.\nYou are in a different Home Depot every day, on hands and knees and in overhead grabbing boxes and stocking shelves. For the first 9-10 months it seems ok but soon after it begins to just be repetitive.\nDecent first job overall, but know that it most likely has a means to an end and is a stepping stone to another company."], "delaware north": ["None really to report. Great job", "DNC managers for the premium bartenders showed obvious favoritism and unkindly belittled the intelligence of some employees openly. Training could be better explained throughout the season and during shifts, not just once a year.", "Management and other workers can be a bit meh. Honestly the consistency of enforcement was missing when I worked there. But juli know some management has changed.", "Hours(I work overnights and weekends)", "Seasonal work during the summer...HOT"], "sonder": ["- Not always all the resources needed to build must maintain scrappiness, but thats what a startup is all about", "Sometimes we deal with difficult vendors/landlords, so if someone isn't experienced with those situations it can be a challenge, that being said, whenever I'm not comfortable with a certain task, I'm never forced to do it, rather, offered support to get through it and resources to make it easier.", "I can’t think of one thing, really. Maybe just the lack of office space/private meetings rooms lately but I know we have solutions in the pipeline.", "We have no infrastructure to train inexperienced engineers. Which works fine for now as we do not have any inexperienced engineers. But, at some point we should invest in avenues for junior engineers to join the team. Obviously, this is a startup luxury.", "At times it can be overwhelming given the rate that we are growing."], "sasquatch talent": ["Wish they worked in multiple markets such as San Francisco and Austin as I have a hard time finding credible companies in different locations that I am open to relocating to."], "honor": ["Sad when you have to leave your clients (or if they pass away)", "There is always constant change in the organization. I don't mind the change but sometimes people in the organization can be a bit resistant to change, but as a start-up tech company change is inevitable and necessary for growth.", "The challenge of working in a highly unregulated and somewhat antiquated market (small local business owners) is that standard marketing channels don't always apply. This isn't a con so much as a challenge. It is an ongoing challenge to reach our target audience, do so effectively in tandem with our sales organization and ultimately continue to find new and effective ways to reach our prospective partners.", "It is really hard and sometimes exhausting work. We are invited to be an intimate part of the team providing care to someones family member and the responsibility to do well is immense.", "It's a startup, things break and that can be tough to deal with at times."], "arup": ["Difficult promotions to leadership levels (much easier to get into leadership as direct hire, than as career progress). Almost no demotions whatsoever, which translates to lack of liability for mid level leaders.", "the base salary isn't that great and there's slow career growth in terms of promotions", "Remuneration between peers not transparent\nAdmin staff can be unhelpful at times", "Usually lower salaries than competitors", "Management, salary, no learning opportunities"], "red carpet valet": ["no cons, nuthin to complain about this company", "Good Locations are assigned to full time Valets who have worked with the company for several years", "Pay not good enough for the area. NO benifits", "Managment, High Stress on occasion", "The base salary is only ok"], "liventus": ["I do not have any issues with Liventus", "Office location is far from Downtown Chicago.", "Even if there are cons on any workplace I would rate this as a very good team to be part of.", "Workload can be a little too much sometimes but if you want to go up the career ladder that's kind of expected of you.", "Work load can sometimes be over bearing. No clear career paths are defined. It is more of if you are a great performer or can create your own opportunities, you will succeed. Some times work is created with unrealistic expectations. Which are some times seen as a failure instead of understanding why it is not possible."], "alloy": [""]}