{"New": ["Fun working Environment, great staff members", "It's a good stepping stone if you are looking to build your career", "Make decent money\nKids can be good (depending on where you are)\nSupportive work staff (depends on where you are)", "NYE is a good place to grow if given the chance.", "Great peer group and mission. The programs and the Site Directors are great."], "brightidea": ["great working environment\nteamwork and collaboration are valued- you won't be thrown to the wolves or feel like you're on your own\nexecutive team are always available\ngood product\nhigh profile clients\n\nWould recommend to anyone to come work here!", "great people and fun vision.", "Career-defining roles, favorable market position, expanding team, passionate people, innovation-driven culture, methodical & thought-out business strategies, and trustworthy management.", "- Rare hybrid of startup/corporate culture\n- Fantastic people\n- Company has an incredible future", "The mission of the company has a significant impact on the world.\nThe top 5 quality people I've ever worked with exist within Brightidea.\nPeople care about quality and each other."], "turo": ["Fascinating work surrounding by genuinely kind and talented co-workers in a mission driven company.", "It took a couple of years however, our department has built processes, and consistency that has allowed many of us to be promoted and empowered to make changes! My co-workers are AWESOME, the benefits have significantly improved including gym reimbursement, and Leadership has created an open and honest atmosphere.", "- great company culture\n- transparent leadership\n- job promotions or movement for those seeking and willing to put in the effort and initiatives\n- amazing growth year over year\n- strong leadership in the board of directors and overall vision for the future with company execs\n- cell phone and gym reimbursement", "Great work life balance\nAwesome culture\nFun people at work\nAmazing people to work with\nWeekly catered lunch\nRecognition for work done\nFlexibility for work from home", "Great salary\nHelpful and nice coworkers\nHealth benefits are top notch"], "nerdify": ["Started as a part-time tutor, I shifted to full-time after graduation. People are really nice, the salary is higher than the market average and the office super-comfortable.", "I've worked at Nerdify for a year as a tutor. It's a very lovely place, people are very nice and the senior management really knows how to get the job done. Salary is good, but sometimes you have to work long hours.", "I've been a freelance tutor for almost 2 years until one of my students told me about Nerdify. I decided to check it out and see what they could offer for an experienced tutor like myself. Turns out to be a great opportunity to get good payment for your work.", "Flexibility and so easy to work with .. great experience .. great company .. Happy to work for such a fine company .. can not think of any bad experiences", "It was a pleasure to work for Nerdify: nice people, great product, comfortable work space and tons of food."], "dropbox": ["Ambitious mission\nComplex problem space\nKindhearted, collaborative culture\nTransparent leaders\nLow ego\nDiverse teams\nDiverse customers", "Great benefits\nTuck Shop food is really good. The Wellness Benefit is large and you can use it on a very wide variety of equipment and services. Company matches donations up to a certain amount.\n\nWork Environment\nNewish building with many different work areas. Day to day functions are well organized so that you have relatively little administrative unpleasantness. An awesome Dropstop on every floor takes care of IT needs promptly.\n\nPockets of Engineering Excellence\nSome parts of the engineering organization are strong: Magic Pocket, sync, and machine learning stand out. Hack Week lives on.\n\nHelloSign Acquisition\nThe company may have realized that it is organizationally/culturally not equipped to grow organically and now seems willing to acquire for growth.", "-Food\n\n-Work/life balance\n\n-Benefits\n-There are a lot of chances for ownership and a ton of work still to be done.\n\n-The people are great. Dropbox is incredible at finding a diverse range of high quality people.\n\n-Diversity.\n\n-The company culture is very inclusive.\n\n-Still has the feel of a much smaller company.", "People are nice and willing to help each other.\nLots of learning opportunities and able to make a real impact.\nGreat benefit and perks.", "Great culture. Tons of opportunities to learn and grow."], "Masco": ["Great job and great team", "Great benefits and a lot of room for self improvement.", "Good pay, lots of overtime", "You couldn't ask for a better team\nGreat space to try ideas out\nSo much support from the team\nBrilliant colleagues", "Nice management, good family style work environment"], "clever": ["Loved it, great community to work in.", "+ Education is an amazing space to work in, you feel good about everything you work on\n+ Massive scale of impact - over 10% of US K12 students use Clever every day (and growing)\n+ Very thoughtful and intentional culture - everything from the culture tenants to seating arrangements to the order of entrees in the lunch line is thoughtfully done to do best by employees\n+ Everyone who's here is here to help improve education, and show it by being super collaborative and putting aside ego for the greater good.", "the 3 founders haven't sold out\nfoster a great work environment, lots of company events\nsocial outreach programs and positive impact in our community\nfantastic perks and benefits\nplenty of opportunities to grow at a ed-tech company\nopen PTO\nA-grade hiring\nsafe rides program\nmanagement cares about personal development", "+ Typical start-up perks -- catered lunch every day, unlimited snacks, open floor plan\n+ Good benefits including a professional development budget, unlimited Amazon learning credits, health & wellness activities, unlimited PTO, and much more\n+ Culture and community is a very important element of Clever's foundation\n\nEveryone here is united around a mission of improving the K-12 education experience; but more importantly, I love coming to work every day knowing that I am surrounded by people who support my growth and care about me personally.", "Clever is very intentional about helping employees to grow. I've learned a lot in my position and have been provided with many opportunities to take on projects that interest me. The managers of the Customer Solutions team have worked to build out \"career pathways\" that help people on our team to grow vertically within the team by spearheading new and interesting projects or to grow laterally by eventually moving other teams.\n\nThe best part about Clever is the people! Everyone is incredibly nice and there's a good culture built around inclusion. People at Clever genuinely care about the mission and helping to improve the education space.\n\nAlso—free lunch every day :)"], "odoo": ["Good place if you want to have autonomy and where your responsibilities have an impact, you are accountable for your own success.\nIt's a fast-growing company with a lot of opportunities to learn, especially if you're interested in an international marketplace.", "You work with great people, you're not expected to work long hours, office is nice", "Amazing people, 100% sure you’ll meet great people and have fun with them. The product is THE BEST. Team activities are fun.", "-Employees come from very diverse backgrounds, not just a caucasian club.\n-Some sales positions can yield decent commission pay\n-Not much corporate culture, (Odoo in the USA is laid back) and does not demand drinking the koolaid\n-The product is interesting and covers a wide scope, so there is much to learn\n-Beer Kegs that are usually stocked\n-Plenty of parking (unusual for san francisco!)\n-Good place to get a start in tech... they often hire people straight out of college, and a couple teams have intern positions also\n-Fantastic for spanish speakers because the LATAM departeent at odoo grows much faster than US and Canada", "-Freedom to be creative, present ideas and implement them\n-High schedule flexibility\n-Promotes diversity\n-Intelligent, caring and hardworking people\n-Opportunities to travel (this is optional)\n\nI have worked at Odoo for two and a half years, and this is one of the happiest work environments I have had.\n\nOdoo gives you the possibility to make an impact on the organization.\n\nEver since I started at the company, there has never been a dull day. The company is still growing at a fast speed, we are still making mistakes once in a while but we keep learning. I now manage a team that I have to keep motivating in order for them to also grow and make out of Odoo the best possible experience.\n\nI really admire my own manager because his door is always open to hear our concerns, frustrations and ideas. I never stop learning from him.\n\nThere is so much improvement that we can still do in the organization, but I do see changes going slow and steady. The most beautiful part of Odoo is not the product, is not revenue growing year after year...it's the people!\n\nI recommend Odoo if you are looking for a place with a great community of smart people, a great product, a fast-growing environment with unlimited things that you could do to impact."], "accenture": ["Great opportunities and a big supporter of diversity in the workplace", "There are a lot of pros working for Accenutre. They have great career opportunities, a never ending supply of interesting work, competitive compensation, wonderful benefits, great people, wonderful training programs, a tremendous number of brilliant professionals in their fields ready to help, and great core values.", "Solid place to gain experience with a variety of clients", "Great people, great energy, great place to work.", "You learn from great people and they have amazing resources at their finger tips."], "roche": ["-great place to meet other professionals\n-global projects\n-opportunity to work on more projects with other divisions\n-mentorship\n-friendly and caring group\n-flexible hours\n- great team\n-office is wonderful", "Very Professional, paid well, great management", "Stable and employees are treated with respect. Reasonable bonus", "Very friendly atmosphere. Highly skilled specialists. Excellent benefits. Management makes a lot of efforts to keep people happy.", "Great colleagues to work with and excellent compensation/benefits package."], "amazon": ["Friendly Environment. Time goes by quick due to the high volume of work.", "Really smart people, a lot of opportunity for growth, always encouraged to be innovative, think big, and create something new. Competitive salary and benefits with other major tech companies. 100% self motivating work environment. No dress code and 4 legged friends are welcome.", "I've been at Amazon for a month now, and I've seen none of the horror stories being communicated to the public, although Amazon is a large enough company that I'm sure there are good pockets and bad pockets. Everyone here is really smart, and wants to succeed both personally, and as a company. People collaborate and help each other, focus on data, and truly focus on the customer. Every company I've ever worked for talks about how important the customer is, but on day 2, they're forgotten. Amazon seems to genuinely focus on what's best for the customer, and it's awesome to be in meetings where people actually bring that up, and make decisions focused on long-term customer satisfaction.\n\nThe opportunities to learn here are literally unlimited, and the opportunity to take on new responsibility is as well. I honestly believe you can be as awesome as you want here.", "Jeff Bezos and his \"S-Team\" are brilliant and continue to make great decisions for long-term growth.\n\nYou work with smart people, you work on exciting projects, you are pushed to your limits...which can be rewarding when you accomplish great things. The diversity of the potential work and innovation can be very alluring. I've often called Amazon my \"Sexy Mistress...she's emotionally abusive, but she's so sexy that I go back for more punishment.\"", "Amazon is doing lot's of cool stuff...but lots of boring stuff too. There are really well run teams...and very badly run teams. The experience for software managers and engineers is all over the board, from really run low operational load teams to teams where people burn out after a year.\n\n - Amazon is built, quite deliberately, to be Darwinian. You can generally expect that anyone who's been here for more than 2 years is competent and motivated or they wouldn't have survived. You can count on them as long as your priorities are aligned. There aren't many slackers here, and they don't survive long.\n  - We work on so much stuff that there's always an opportunity to find amazing cool stuff to work on (note that it's an 'opportunity', one that you have to pursue)\n  - A chance to make a huge difference\n  - A place where you can learn a lot about all kinds of things, both technical and about yourself\n  - Amazon encourages high mobility - even your manager can't prevent you from moving to another team within 6 weeks (normally, more than a few months under unusual conditions).\n  - Your friends and family have actually heard of the place you work and have at least a vague notion of what Amazon does without you having to explain"], "chegg": ["Great place to work !\nGreat environment and work culture", "Great people and one of the best companies", "Great place to retire with great work life balance", "Chegg makes great business decisions. If you're lucky enough not to be involved in shared services I'd imagine you'll have a good experience.", "Good hourly pay for online tutoring"], "Cox": ["- Friendly environment & culture\n- Everybody was willing to make you succeed and help you out whenever you needed help\n- The department and managers were genuine and love to see you succeed and grow!\n- The internship program was an overall great experience and it allows you to open many new doors for opportunities!", "Motivating, life changer, Harmonious, Fun loving.", "Excellent company. Good benefits, work/life balance.", "Opportunity to get involved in projects and assignments that stretch your skills and abilities, very talented co-workers, financial stability and growth opportunities.", "Great work-life balance, many subsidiaries to move to within the Cox family of companies and company cares about the community (volunteer and other goodwill activities"], "samsara": ["Samsara is a tech unicorn and is currently massively growing. The environment is super fast pace and at the end of the day, I am amazed at how fast the day has gone by. People are extremely talented and bright. You choose how to involve you want to be in the culture with the vast amount of clubs and opportunities to network with other employees.", "Growing fast\nGood work life balance\nGreat CEO\nFriendly and eager to help management\nFun employees\nYoung company\nResponsive to customers\nGreat career pathway", "Room for growth within the company", "It's so clear that some of the recent reviews were written by people in their first job who may not realize work is not going to be fun 100% of the time or just don't like their position. Samsara is my third full time job out of college and it blows the other two companies out of the water. The entire company cares about your success and is willing to invest in your professional growth. You can change teams if you don't like your position. Some of the negative reviews around sales seem to focus on just not liking sales itself. At any company, sales will be grindy and you'll feel underpaid if you aren't hitting quota. Luckily, Samsara allows you to switch career paths within the company after just six months, so anyone who doesn't like sales can try a new path. Samsara has free lunch and tons of company activities and I really don't think there's much to complain about. Benefits are also completely above average (especially for a startup) and there's an extremely high caliber of talent and extremely intelligent people from the CEO down. Culture is great as well, everyone is friends and there's literally a slack channel to get automatically matched with a person you've never met so you can grab coffee. Plus, there's tons of clubs you can join if you want to be friends with your coworkers. Like any job or group, the culture is what you make of it and you can either take advantage of the perks or not.", "Amazing company to work for. Whip-smart, experienced leadership team that's down to earth + approachable. Super motivated colleagues excited to learn, challenge one another and collaborate. Product is complex, interesting and making a difference for an industry tech often overlooks. You have the opportunity to add real value starting on day one. Great benefits seal the deal."], "womply": ["Transparency in communication. I am one of there more tenured reps of over 2 years and this isn't due to lack of options for me. My base in my current position is valued at 50 to 65k. However the issues which many address here are clearly salesmen or women who can't follow instructions or simply follow orders to approach clients needs. They get released for poor performances and hence why glassdoor is loaded with this high school drama . Are you mad because you didn't do the best you could do? Enjoy podium or any other similar SaaS company and talk sour all day on slack! The skilled survive. The lames move on. It's this simple. If you want to empower and challenge yourself then welcome to a future worth fighting for. Tenure is a literal badge of honor. Job hoppers are the worst. If you hire someone whose been to 6 previous places of employment within a year, your companies glassdoor is next.", "Seems like the only people that are going on here and leaving bad reviews are the ones that just can't cut it here. It has nothing to do with the leadership or the company. The Womply software is very simple and straight forward and really does make an impact on a small business's revenue! I have seen it with my own eyes, anyone saying different obviously hasn't seen the results of our customers. As for working here....Yes it's work....Yes it's hard... IT'S SALES!! If you haven't been in sales before or can't handle hard work then don't work here. That being said if you can work hard and fight through a few no's and some leads that aren't always the best but want to make 90k a year....WORK HERE!!", "Snacks and drinks in break room provided", "--The people: I've been with Womply for around a year, and I love the people I work with.\n--Work-life balance: from what I've seen, the company sticks to their word and encourages you to \"unplug\" when you're not at work and take vacation days to recharge. The management I report to does seem to work long/hard but they are under a lot of pressure to produce results and grow, as you can imagine in a startup with 8 years under its belt. If you function best with a strict 8 or 9-hour workday, be sure to talk about that with the recruiter and/or your interviewer to make sure the expectations are understood by all parties, and then hold them to that when you get hired.\n--Casual dress code, relaxed atmosphere. I despise formal/stuffy business attire and this is a huge plus for me. (see below for downsides of casual/open office environment). If you are deeply offended by C level management wearing t-shirts/jeans/shorts/hoodies, look elsewhere for employment. You are certainly free to wear whatever formal business attire you wish.\n--Huge opportunity/potential for growth/chance to make a real difference. The benefit to small businesses who use the product is real and substantial. The \"startup culture\" and the resulting chaos (see \"cons\" below) means that if you're a self-starter and you see something that needs to be done, chances are nobody else is doing it or has seen the need for it, and you can spearhead some really significant initiatives, make a real difference, and get the credit you deserve.\n--The product provides real value. The data assets are huge and business owners. The concept is is a winner and has the potential to change the world for local businesses.\n--You will get credit/kudos/recognition for the work you do and the difference you make. Management is very open and free with praise and everyone is eager to share or even defer the credit for goals met and key projects completed. Nobody beats their chest and says it's all about me.\n--Freeloaders can snack/eat/drink soda for free all day long. Frequent food brought in for the office.\n--Company seems to be getting its feet under it and is in position to get it right and grow huge.\n--Decent money, good benefits.", "Amazing product. The changes that have been made, from top to bottom of the Company, in the last few months have created an amazing opportunity"], "everlaw": ["Lots of autonomy, great coworkers, good work environment.", "Great product and smart developers", "->Aggressive salary growth, with many employees receiving competitive equity in the company, even in entry-level positions.\n->Management philosophy that prioritizes open communication, listening to employee feedback, and making decisions based on company wide ideals\n->Excellent employee benefits. Vision, health dental paid for by the company, with free catered lunches, flexible spending accounts for medical and travel, hiring bonus for referrals, game lounge, office with a view, team event stipend\n-> Strong internal hiring and internal promotions\n-> Extremely fast growth. In one year, moved from 40 to 100 employees and received Series B funding.\n->Excellent product, with industry leading engineering team and compelling design\n->Competent, intelligent, friendly management team", "I feel super lucky because I love coming to work:\n-I am surrounded by intelligent, motivated, hardworking, fun, and genuinely good people\n-Management is invested in the growth of all employees\n-Collaborative work environment that truly values everyone's opinion\n-Amazing product", "Wonderful environment\nMotivated and smart people\nUnified vision and direction\nNo brogrammers"], "Winkler": ["- Winkler is a fast growing business. There are a lot of opportunities to grow your career if you're not afraid of rolling up your sleeves and executing on big projects. I started fairly junior and had the opportunity to get promoted fast through hustle.\n- Work life balance is also great."], "Adler": ["Environment, people, fast-pace, learning, location", "Team oriented & great perks", "Free admission to Chicago Museums, Nice view of the city.", "Everyone gets the same staff benefits - part time, full time, etc. Health insurance might be the only exception?\n\nSome perks include discounted Adler After Dark tickets ($5 for staff + guests instead of normal $20), free admission to the museum on days off, etc. 401k plans, PT sick days (per city ordinance). Other miscellaneous perks too.\n\nGREAT employee onboarding process with HR - they're speedy, efficient, and are really helpful and nice. Part-time employees aren't treated like they're less than full-timers", "- it's a space museum! how cool is that?\n- the view is incredible to see even when it's frozen outside.\n- the people who work, for the most part, there are genuine, kind, and super nerdy which makes the environment fun"], "Sapphire": ["snacks, drinks, coffee, PTO, Working remotely/from home", "If you think the food and perks are the best thing, it's a problem", "Flexible work/life balance, nice office", "Free snacks\nOpen PTO policy\nOccasional free lunch", "The company's senior leadership and HR genuinely try to make the people doing the work everyday happy and respond to feedback when it is unhindered. There is a genuine attempt to be lively and have a startup culture. The people are very friendly. Teams have full freedom to self govern."], "decathlon": ["Company culture\nManagement based on human\nFuture perspective\nDiversity of jobs", "Friendly people to work with", "Colleague are nice to work with, young, energetic, willing to help others. You have big opportunity to lead something", "Some limited flexibility in setting own schedule. Employee discount makes the already great deals incredible.", "1. Flexible schedule\n2. large room to develop\n3. Lots of opportunities"], "Champro": ["Great family values, and a place to be", "Great people at the ground level", "The people are really great. The company does nice things for you like shirts, meals, etc.", "Everything I learned here was a great learning experience. Internships like this are very rare in the Chicago area! It helped me through interviews and get a job right away in the fashion industry after I graduated!", "Easy work, safety is always put first, time goes by fairly quick, not much past related skills needed, inventory is easy to memorize"], "chime": ["Amazing focus on the wellbeing of the customer\nGreat people\nWonderful management\nAwesome office manager\nGood food", "Still good people there, positive outlook on the company, nice new offices.", "I'm honestly a little shocked at how well-run this company is! Many companies talk about having a transparent culture, but this is the first company I've worked at that lives and breathes it: cofounders and exec team are readily available and don't shy away from talking about tough issues, there are frequent all-hands updates on company financials and performance, and the whole company is kept abreast of things like confidential upcoming partnerships. It feels amazing to work for a company that is honestly helping average Americans and where the employees are eagerly pushing for more customer-friendly initiatives.\n\nI believe Chime is a true rocketship, and I'm impressed that it is doing so well without having everyone internally running around like their pants are on fire. I think it's one of those companies that will have a crazy financial success while still many people in the SF tech scene won't know of it - the team here has their head down doing good work. People work hard and are deliberate about getting things done in a data-driven way, but there isn't unproductive stress.\n\nAlso, everyone is SO friendly!", "Leadership is fantastic - experienced, transparent, engaging, etc.\nInteractions are great - manners and respectful behavior seem to be missing in so many places, but not here. You feel appreciated and that people really have your back here.\nTotal autonomy for the most part - trust is high here and, of course, combined with what's best for Chime.\nChime's progress, successful and not so successful updates alike are plentiful and regular without any spin. If there's any agenda, it's to address issues and work towards a solution if that's the case.\nI feel pumped to come in every day for myself, my team, and our customers, and I believe all of us are honored to be able to help our customers out anyway we can.\n\nBulletpoints because we all love them:\nLow ego + high standards\nCollaborative, transparent process\nGreat life/work balance (managing results, not activity)\nSupport from top-to-bottom for any and all\nGreat manager and IC training for job and company skills\nCompetitive compensation with benefits and a wide range of perks - especially team-building (but during regular hours for the most part, so respecting people's personal time)", "- Mission-driven. Feels good to go up against the big banks and help everyday Americans.\n- The (already great) company culture has only improved over time, even with the company tripling in size over the last year. Feels very positive, collaborative, transparent.\n- Not much turnover. People like it here and tend to stay.\n- Great health benefits and flexible PTO. I have a chronic illness and I've never had any issues getting time off to take care of my health.\n- Love the exec team. They're friendly, approachable, and great at what they do. Actually, this can be said for everyone at Chime.\n- Office dogs. ++++++"], "c3": ["Benefits ,money people bosses environment", "Paid $13 hourly until license came in and then paid at $17 hourly", "Great 4 day shift options with Fridays off.", "A lot of overtime", "The paychecks clear. Co-workers were great."], "Avispa": ["Avispa Technology is a company I am proud to have founded and is my absolute pleasure to lead.", "At Avispa the employees' overall well-being is just as important as the company's productivity. Complete transparency all the way up through management, and a very enjoyable work atmosphere. There is a strong collaborative spirit here, so everything from client services to company policies are openly discussed amongst the team in order to come up with the best strategies to improve our business model.", "Avispa Technology is a Company that encourages professional growth, teamwork, and strong communication. Avispa also fosters the idea of a transparent and open environment; ensuring that voices are being heard, and employee creativity can blossom.\nI personally love working for a company that focuses on building strong relationships. I also enjoy watching and being a part of Avispa’s growth, and seeing my fellow colleagues be successful and happy with their job.", "Teamwork: joining Avispa without a recruiting background, the team managed to make a person feel welcomed, supported and brought up to the task of finding the best talent and giving the best experience for candidates in no time.\n\nOpportunity to grow: with the previously mentioned teamwork AVISPA enables you to grow professionally as well as being a part of the company's growth and development.\n\nTransparency: You are being encouraged to ask questions and you will be given answers, as well as being updated on all current events.\n\nRewards: your work will be rewarded. Not only financially (and that is already above average!) but the team and the CEO will recognize and highlight your success.\n\nWork/Life balance: personal needs and emergencies are understood and there is quite a bit flexibility in your schedule if needed. Vacation/PTO days are appropriate.\n\nFun: Food ordering, team outings, beer Friday, yearly recognition event, endless snacks and lots of laughter add to an amazing work environment.", "Working at Avispa has been like being part of a big (and happy) family that celebrates and encourages all employees to do and become their very best. During the time that I've been working here I have had the opportunity to work with an amazing group of people and have enjoyed an outstanding work-life balance (rare to find in most companies these days). I've learned so much from everybody in the team and, thus, have continuously grown as an individual and as a professional. P.D.: There's just so much positivity: Restaurants visits/food ordering at least every month (if not every week), Music, Beer Fridays, Annual trips for employee recognition, a little more food ordering, task sharing and team bonding, food, etc."], "Edcor": ["Easy phone work and simi-private work space and reasonable schedule.", "They pay you (below $15 hr) , but you do get medical and vacation ( not Christmas).", "The work itself is extremely easy and it's steady employment. Sometimes you can read a book or literally sleep on the job as long as you're on your managers good side. If you can fake a smile everyday and act like the most happy go lucky person ever than you are good here. The paid time off is pretty cool too."], "Youth": ["By working here as intern, I got to know my strategy and planning skills"], "airbnb": ["Most people are extremely nice and driven at Airbnb.\n\nYou can really find whatever you are looking for in a team.\n\nThe tech stack is a priority for the company, which makes the company a great place to work as an engineer. We have tech talks at the office, open source projects, stipends to attend conferences, etc. We encourage novel/optimal technical solutions even when the project may take more time, and we (at least recently) are trying to build with the long term in mind.", "Work enviroment Money Job duties Facilities", "Coworkers are great.\nGood food program.\nNice offices.", "- Compensation: pays more than any other tech company (Google, FB, etc) PLUS new cash bonus PLUS can choose to take your equity refreshers (no cliff) in cash. They also bump everyone to above midpoint of the range, which is really kind and close any gaps for pay equity.\n\n- Business is doing really well: we're profitable, have money to invest in employees + new ventures, never worried about money. Not even having a round of funding for this far out is amazing.\n\n- Great benefits. Free airbnb credits (never expire), lots of PTO and time off, easy parking lot next to the building (they reimburse the price), free lyft credits, top notch food program, etc.\n\n- Management is honest about their pitfalls and is honest about fixing it. I appreciate this because they could sweep it under the rug.\n\n- We're heavily invested in our infrastructure as a 2019 focus. Even hired a CTO who has decades of infrastructure heavy lifting under his belt. Sweet!\n\n- People are really kind and helpful. Fairly rare. There are always going to be politics because people befriend eachother, but honestly you can set up a meeting with a director and they will help you resolve easily. As long as you speak out, people will listen.", "-One of the best companies that I have ever worked for regarding their mission and desire to provide the best customer support while embracing ingenuity\n-You will work with some of the nicest people in the industry who are truly exceptional\n-Great benefits including free lunch and snacks, quarterly travel coupons\n-The CEO truly cares about what the company is doing and it's mission; he holds regular Q+As with employees and makes a visible effort to connect."], "vonage": ["Customer Success Department management is very supportive and collaborative. Coming from a sales background and wanting to move into something more \"farming\" than \"hunting\" this role has been so fun to take on and truly making an impact for not only my customers but for Vonage as a company too. Our CSM department is growing and we have such a great vibe that it's enjoyable to come to work everyday. I love that we have support from all our other internal teams to drive the best customer experience. I feel like I'm part of a start up company with the resources of an enterprise. The company takes the initiative for continual education and feedback which I think is great - and they are receptive to it.", "Great Vision, great benefits, and good technology.", "Fantastic culture, Excellent training, Great benefits, Innovative organization. Smartest group of people I have ever worked with top to bottom. Work culture is the best I've ever been a part of as well. Striving to always be a destination workplace for all is just part of Vonage's DNA.", "The environment is fast paced and keeps you on your feet. You will always be in learning mode and looking for ways to improve the company through your own department. A lot of change with the acquisitions, but with that change is enormous potential to grow Vonage even further.", "Exhilarating to be part of transforming a company at its core.\n\nA start-up like environment with a relatively flat hierarchy.\n\nGSD attitude across most business units.\n\nGood benefits and comp."], "Avalara": ["The lists of pros is very long. Some highlights include the market proposition, the people, the culture and the working environments.", "Overall great culture! For a company with offices around the globe, Avalara puts a lot of effort into helping our teams work together to stay connected. Extremely smart and friendly people work here - we care about each other every bit as much as we care about our customers and it shows! We are encouraged to have fun, think outside the box to find innovative ways to contribute to Avalara's success. Avalara's software positions us as an industry leader in sales tax compliance - it's hard not to be proud of where we are today and the journey it took to get us here.\n\nRecent improvements in benefits is a huge plus (401K match), moving to our fantastic new office in Pioneer Square consolidated 3 office buildings (to everyone's delight) and it was no surprise to me that we won Geekwire's Geekiest office award for 2018! We are finding ways to be active in our neighborhood and give back to the Seattle community.\n\nMy hard work over the last year was rewarded with a significant pay increase. But pay isn't everything. I feel appreciated every day and that my voice and contributions are valued. Flexible work schedules with opportunities to work from home as needed provide excellent work/life balance. We have a mentor/mentee program in place and new employees are assigned an \"Ava Buddy\" to help them onboard.\n\nOur leaders are doing a much better job of communicating with our teams through monthly all-hands meetings. Questions are candid and answers are honest, which everyone appreciates.\n\nAvalara is a great place to work. Can we improve? Always.", "Great pay for what could easily be outsourced or automated. Work itself is extremely repetitive. Not ideal if you plan on climbing the ladder quickly.", "Orange is my favorite color", "Growing company.. plenty of room for advancement"], "quantcast": ["Quantcast has awesome perks. Catered lunches and snacks, great happy hours, and culturally oriented events define a dynamic and fun culture. My colleagues are one of the more educated groups I've seen in the industry. I work with Ph.D. and Masters graduates from top tier universities. Even better, instead of relegating these folks to a research role, Quantcast leverages them to be part of releasing production software.\n\nThe newly devised business strategy is compelling. With the recent change to leadership, in addition to getting back to our technical roots, we are making consumer-facing software endeavors that could remake the way publishers and marketers monetize their content on the internet.\n\nQuantcast is a place for gifted computer scientists to make a significant impact on exciting products. It's also a place where building software that non-technical end-users use. In short, it's a place where individuals can leverage their strengths to enhance a developing product suite.", "Smart people and a great base product", "Amazing food, people and fantastic work and culture.", "There are free lunches and snacks", "I’m very impressed with Quantcast, especially progress made the past 18 months. Here’s why:\n\nQuantcast has made significant strides across diversity and inclusion. They take this very seriously and I’m hopeful they continue on this course.\n\nThe leadership team has taken thoughtful steps to addressing transparency and accountability. They address hard questions and they are all accessible and will stop and work through any problem with you.\n\nCareer development here is a real thing. I’ve seen many people grow to take consequential leadership positions at the company and we consistently receive the support we need to continue developing as professionals and leaders.\n\nThe product has improved and that team is listening to market feedback and quickly developing products that are going to bring real value to the industry. Exciting things ahead."], "exabeam": ["Joined the company less than 6 months ago, great company culture. Being part of a company that is being disruptive in the SIEM market is very exciting. Fast paced environment, you are the \"quarterback\" running your deals. Every person in the company is focused on making sure you are successful and you if you need help to win a deal, they are there. We win together or we lose together. Compensation is good, benefits are competitive, full transparency from leadership. If you have an opportunity to join the company, jump on it.", "This place is awesome - we are solving a real problem created by legacy SIEM vendors and not only are we helping our clients improve their security posture, but we are helping them save money at the same time.\n\nFrom the very top down, there is a culture of excitement, passion, transparency, accountability and a shared vision. \"That's not my job\" are not words ever heard around this place. Everybody is fired up about what we are doing, there is a feeling that we are really making a difference and we are having a lot of fun in the process. That is why I like this size of companies - more than 100 employees, but less than 1,000 - everyone is empowered, there is no place to hide, the pace of the work is exhilirating, no two days are the same and the little speedbumps along the way make the successes that much sweeter.", "One of the best sales & engineering led leadership organisations in the industry, bar few; A solid and relevant product offering, with the strategy and execution to match. I appreciate that some of you reading this will think that as I'm a current employee, that it's likely I'll say positive things; well, rest assured that's not the case, I took this job on a pay cut, because I've not seen this level of product vision, execution and sales capability, since Netscreen, Fortinet, Fireeye, Palo-Alto and Splunk.... The culture is no-nonsense, you work hard, you perform, you give it your all, you'll make it; this business has been built on the ethos of \"whatever it takes\" and \"we're in this together\"; it's that drive that has seen the biggest financial and customer acquisition growth, in the pre-IPO market this past decade.", "Exciting vision to disrupt an antiquated market\nLots of positive hype around the company", "Lots of Imperva folks\nSales team is growing\nCatered lunch on Wednesday"], "Andromeda": ["Room for growth if you demonstrate you can handle it!\nGreat support from the top down\nVery flexible, no micro-managing!\nGreat benefits!", "Great flexibility and stability. Yearly company profit sharing (bonuses).", "Very relaxed, flexible and professional.", "Great management\nFamily friendly\nStable in its niche", "Great Team and work ethic!"], "Trunk": ["culture, unlimited time off, atmosphere", "Great culture, excellent work/life balance, ability to build your own business and make as much money as you want", "flexible schedules, unlimited vacation, fun/young coworkers (for the most part)", "Cool place to work, fun people, laid back environment", "there are lots of friendly employees"], "Seal": ["freedom of work and work culture", "- Good work environment\n- Well organized", "It is a itty-bitty tiny home grown company... so you know everyone in the \"Company\"", "Great place to work. Family environment. Nice benefits and people", "Great manager at Consulting Services."], "trianz": ["Good vision and strategy, decent set of leaders who are fully committed, good growth path for the last 3 to 4 years, enough opportunities if you are skilled on right technology and also the get upskilled", "Very Good company for freshers", "Intellectual peers and managers , independent working environment, professional and collaboration within the teams", "-Work Life Balance\n-Well known clients (largest tech companies in the valley)\n-Skills developed helped me land several roles after Trianz (manager at a fortune 10 company, and post-mba consultant role at a strategy consulting firm (without having a mba))", "Projects that offer Business and Technical expertise under one roof.\nA high growth path that has doubled the number of employees in 2 years.\nTop tier clients in High tech, Financial, Insurance, Retail, Public Services and more.\nStrong core values based on integrity, commitment to client success, one global entity, long term relationships and giving back to society."], "Wargaming": ["Coworkers are friendly.\nOpportunities for Learning.\nTeambuilding environment", "Incredibly opportunity to learn cross-cultural communications and international colleagues\nAmazing experience and opportunity to learn and grow with the needs of the organization\nGreat support network in Austin with an even better office culture\nGood work-life balance with a nice gaming atmosphere and tasty snacks", "1. Good benefits & Perks\n2 .Get Game Gold Account for free", "Its a job with benefits\nChicago is a nice city. winters are brutal.", "An amazing team of experienced professionals at Wargaming Seattle built a truly fun game through Alpha."], "Delphi": ["it was really really cool", "Great coworkers and engineering methods", "Pleasant work environment, trainings, helpful colleagues, good work-life balance, possibilities of professional growth", "Lots of overtime hours\nLow requirements for hire", "-pay and benefits\n-kind coworkers\n-manufacturing, testing, and development all on site, many learning opportunities"], "tapjoy": ["Tapjoy is invested in its employees and has done a lot of work to make sure the team jives and is inspired to grow together. Thanks to the company's size, employees have the flexibility to participate in different areas of the business and find their highest point of contribution. After refining strategy over the last year I think Tapjoy is set up to make waves in the industry. It's a great place to work, with huge opportunities for growth.", "Very smart guys, willing to move\nlocation, snacks", "Catered Meals Location, Company Events, Ok Product, Snacks", "- Great benefits\n- Smart people\n- Tough problems", "Amazing people to work with, really talented and care a lot about making impact in the industry. Really rewarding work as well - because of the size of the company, it is possible to get your ideas heard, specced, and built, and see it make real change that affects the whole ecosystem.\n\nAny problems that I had with products, people, communication, culture, planning (or really anything) would eventually get solved, because people cared about improving the company.\n\nI left because I received a big opportunity elsewhere, but it was truly one of the most difficult decisions I've ever made, because Tapjoy was like family - close knit, focused, and a really fun place to work (even when we were busting our butts!)\n\nWith recent changes to internal communication and a restructuring of priorities, I think Tapjoy is slated to make big impact in their industry and keep growing the business in a positive way!"], "Crestone": ["Full of people with good intentions and generally kind. Well capitalized from well matched investment group, and probably going to be around a few years given their position. Good healthcare. Comfortable work-life balance generally.", "CEO is a good man, passionate and motivated. Good pay and benefits carried over during transition."], "fundbox": ["Solving a real problem for businesses. Revenue in core product and new product growing like crazy. a chance to build a huge company.", "Building something unique and huge. Much bigger vision than it initially seemed when I applied. Sharpest people I worked with. Mission is inspiring and there is electricity in the air.", "Friendly intelligent and capable co-workers - small company makes it so that individuals can have greater impact - cool projects - good work life balance", "Core product is good but doesn't really help our customers.", "Good office location. Some free snacks."], "dolby": ["overall great people, friendly and intellectual. mostly low drama. allows me to flex as needed and 9/80 schedule. working on product that will be live for many years in 1B+ devices is satisfying.", "Top of the line headquarters and audio lab.\nEvery other Friday off. (work 9 days out of 10)", "Really love the people I work with and the technology we are working on. I was not looking but when the recruiter called me and told me about the opportunity I decided to take a chance and I am so glad I did.\nIt is very different here, there is so much talent, and yet not a lot of egos unlike my last company. I genuinely enjoy coming to work every day. Also i am not expected to put in crazy hours just to prove myself. The work life balance is real and yes we really do get every other Friday off (I was skeptical at first)", "Office (theater, gym, cheap food)", "- Work life balance; having every other Friday off is an amazing perk! While an email might come through here or there, in my experience, you really get a 3-day weekend every other week!\n- The San Francisco office is bright, full of artwork, and offers free snacks and refreshments in kitchens throughout the building. It creates an engaging environment to work in. Also, there are screenings of new movies in the attached movie theater, which is a great experience!\n- The culture is hard-working and very collaborative; people here are willing to go out of their way to help.\n- Technology-wise, I have had no complaints and feel well set up to do my job."], "Raytheon": ["require 40 hours a week. good benefit packages", "Job Security, Good pay for Tucson location", "-Large company with lots of opportunities\n-Exciting products to work on", "Great first job out of college\nTaught me the basics.", "New Richardson Building, Flex Hours, Remote work options, advancement opportunities"], "box": ["Great people, Great leadership team and amazing product", "Great leadership and even better culture.", "Open work culture.\nGood engineering team.\nGreat food.", "Flexibility, autonomy, benefits, company values and people. Focus on Customer POV and needs", "great culture, very supportive, good office environment"], "Chronicled": [""], "getaround": ["Dynamic energy, very dedicated people, feels like a family when you come to work", "- Hard workers are rewarded\n- People care about your career path (I've had 3 distinct roles, and a say in what I'm doing)\n- The smartest people I've ever worked with", "I decided to take a job at Getaround because of the passion, intelligence and genuine spirit of the people I met with during my interview process. Working there has only been more inspiring and motivating, this is a great place for people who want to contribute to a truly special company and vision.", "I’ve been working here a couple years and love the company. There is tremendous opportunity for career advancement and I’m surrounded by a whole bunch of really smart people who make each other better.\n\nThe company is growing super fast, which is really fun and also challenging. This really isn’t the environment for people looking for a place to relax and collect an easy paycheck. Getaround is a marketplace business with hardware, software and operations that all move quickly and have a lot of interesting challenges and fun problems to solve. Everyone seems to be working hard and there is great teamwork both within and between teams.\n\nLike so many other startups, there are a bunch of cool perks... the free lunches and unlimited snacks are awesome. Plus free credits to use for Getaround cars.", "Curious group of people, doing great work. It feels like executives and my manager really hear concerns and act on them quickly.\n\nCompensation is reasonable and improving. So is the information flow around product updates. There's virtually no politics.\n\nBenefits and perks are competitive."], "thumbtack": ["Thumbtack is a growing company that cares about its employees. The food is incredible! Such an incredible perk", "- Pivotal learning experiences\n- Inspiring and smart people who I’ll always be grateful to know\n- Benefits are above par + some unique additions", "Exciting place to work alongside super smart and interesting people. Also, the food really is as good as everyone says.", "Everyone here is super empowered to contribute. Everyone over-communicates. And the brain power here and confidence is unrivaled.", "Great environment, people are super friendly, flexible work arrangement."], "Piper": ["The people of this organization are truly why I chose to work here and I have not been happier in my career... ever! This is truly an organization that allows everyone to impact the company... everyone has a voice... everyone has a say... everyone has a the ability to make a great income and find balance in their lives. The Teams are comprised of GREAT people doing GREAT things. I feel privileged to work with such a talented group of professionals! I always feel respected. I always feel heard. I enjoy the work I am doing and feel as though I have a purpose! The company allows for work-life balance which allows me the freedom to get the job done but still be present with my family. I hope to be part of this growing organization for a long time!", "Work-Life Balance is great! There is a level of trust built in here that I have never felt in any other company I have worked for. If you have a legitimate reason to leave early or need to be somewhere you are more likely to get a good luck or a congrats then a where are you going from management.\n\nUpdated Technology and Facilities! Our employees are all given the latest technology to use and to help make them the best at their job that they can be. Also Piper Companies has new and modern facilities in all 4 markets that they occupy.\n\nThe people! Piper Companies and ZP Group as a whole just have knowledgeable, professional, and honest people working for them. They know how to work hard and how to reward their employees for a job well done.\n\nWhere the company is headed! Now is the perfect time to join as Piper and ZP Group are beginning to really see the fruits of their labor and solidify themselves as a market leader in IT Recruiting and Consulting Services.", "My experience with Piper thus far has been phenomenal to say the least. As one of the early members of the Baltimore office, I have had the privilege to watch us grow and expand substantially, both in revenue and headcount. Our office has done an incredible job of maintaining a great culture—a culture centered in a team mentality. Not only do we push each other each and every day, we hold each other accountable to be our best. Even more importantly, with the volatile nature of staffing, we help pick each other back up during the lows, scrape the dust off, and move on to the next position. I cannot imagine a better team to be a part of, and even during the worst of slumps, I genuinely look forward to heading to the office to work with my team.\n\n-Compensation structure\n- Team & culture\n-Room for internal growth opportunities\n-Access to best in market recruiting tools\n-Work life balance/flexibility\n-Management very receptive to feedback", "The culture in the Columbia, MD office is bar-none the best I've worked in throughout my career. You have the ability to set your own goals and are surrounded by a team which provides you with the support to actually achieve them. Everyone here is driven and it motivational!", "BEST Company Culture I have been a part of in over 10+ years of staffing\nEXCELLENT colleagues and positive energy in the entire office\nGREAT Leadership from our office leader\nAwesome accounts to work on that will keep the money coming to your pocket\nAn overall AMAZING place to work & couldn't be happier!"], "etsy": ["Awesome people, great benefits, fun atmosphere.", "Awesome office environment & every body I worked with was incredibly smart & capable in their roles.", "1. Positive mission and purpose, the customers are inspiring and loyal. And there is still a lot of potential in the marketplace to help them thrive.\n\n2. The engineering team is full of collaborative and talented people.\n\n3. The compensation, benefits, work/life balance and facilities are all really solid and a good model for others to follow.", "Great compensation, generous RSU packages. Remote work. Amazing corporate culture and fun people to work with.", "Working at Etsy is incredible. There is nonstop momentum, and you work for a company that ultimately does good in the world. The BK HQ is lovely, the food and atmosphere is inspiring."], "slack": ["Love Slack and everyone on team!", "- Wonderful co workers\n- Truly believe in management, the product and our mission\n- Incredible perks and great work life balance", "Friendly atmosphere\nSteady income\nOpportunity to advance", "Lots of diversity, good pay, great location, good product", "• Extremely strong, once-in-a-lifetime business. From a market perspective, there's no reason Slack can't be the next MSFT/Salesforce. MSFT presents some competition in the space, but it's Slack's market to lose. You definitely have job security here.\n• Compensation and perks are great. Fitness reimbursement, education, phone data, etc. You'll save a lot of money by working here. Office spaces are luxurious and thoughtfully designed.\n• You get to work on a product (many!) people actually use and care about\n• There are some truly extraordinary people working here that are a pleasure to work with and learn from.\n• Stewart is as \"unique\" and inspiring as he seems from the outside. Some other executives are the same way.\n• Slack is no longer a startup so it's less likely you'll need to work startup hours (e.g. 9a - 5p will swing it for most roles)\n• The bar for tech companies is lower than sea level, but Slack is still above it. From a total package perspective, there are few opportunities as good as this in Silicon Valley, even despite its many flaws."], "Rethink": ["Forward thinking, great company culture, collaborative"], "atlassian": ["Really have it together especially the recruiting & people teams on getting employees onboard and set up properly.", "Lots of flexibility, ownership and autonomy. Great working relationships - Atlassian employs some of the smartest, most empathetic people I've ever worked with. I have grown more here than the rest of my career combined, and have more trust and autonomy to get things done than I ever have before.", "Real chance to make a difference for our clients. You can build the future you want.", "Great company to work for", "Great values, good facilities, and good work culture."], "Career": ["CTI allows you to expand your skills and grow within the company as much as you would like to. They give recognition for hard work and effort and they will listen to any ideas that could make CTI a better organization over all.", "Good pay good with time", "they do offer decent benefits.", "Students, You pick up on some good sales strategies.", "Their aren't any pros about CTI"], "sony": ["Management has really turned the company around from a financial perspective. Over the last four years, the company has been focuses heavily on ethical and crafty business practices. Competitive Salary and strong bonuses last few years. 401k match is probably the best in the industry, ends up being 7.5% of salary + bonus.", "San Diego weather. Trying to work on employee development opportunities.", "Sony is an outstanding company. It has progressive, intelligent management, with a diverse and talented group of employees. Sony is going to the top of the sensor market.", "Great brand, great people, great office gym", "Excellent products, coming back after some tough years"], "roblox": ["1.) Very efficient recruiting process, Bette is definitely the best HR I have ever worked with. She is always pretty responsive, helpful and considerate. I also had a CEO interview for a non-manager role, I can tell this place really respects and values their candidates just from the recruiting process.\n\n2). A lot of delicious snacks, drink, and fruits in the kitchen. They even have some ice creams which I like the most. Free lunch, a lot of choices. You can order delivery with eatclub too when you are too busy to go to the cafeteria.\n\n3). Good for my career. I am working on the platform played by millions of users, this makes me feel very proud. A lot of challenges need to be taken as well, I believe I can learn a lot here.\n\n4). Good work and life balance.\n\n5). Transparent communication. I love my team, they are super smart, easy to get along with and work with.", "It is so wonderful to be surrounded by such great minds - an amazing group of very smart and savvy colleagues. I have learned so much and have grown so much in the last year and half of being at Roblox. Seeing the impact of what we have created in the player community is so exciting and look forward to being apart of the growth at Roblox.", "The people are passionate, knowledgeable and fun. Career growth opportunities are endless.", "Fun place to work. Proud to be apart of such an inspiring company. Roblox offers anyone who wants to build games the chance to do so. They provide so much opportunity for young developers to essentially build there own business. It's great to be apart of such a vision!", "Kids love the product and you should be proud"], "zipcar": ["An inclusive, dynamic group of people who are passionate about the mission and can navigate ambiguity. A willingness to make hard choices in the short term for long term gains.", "work life balance is great, most managers are really empathetic human beings. real work, solving real challenges in the consumer mobility space = exciting times.", "Great people working on a worthwhile mission.", "The work-life balance is pretty good.", "Was a terrific experience to start a couple of years ago. They still have some bright people but getting fewer and more far between. Operationally has been very efficient to contain costs and hit EBITDA, and keeping things bare to meet parent company expectations."], "Doran": ["Rapidly growing company providing innovative solutions to their clients\nHardworking, highly professional and very responsive staff - special kudos to Matt Johnson", "Doran Jones is a great place to gain insight and experience in the software development and QA/software testing areas.\n- Interesting work, in general, and very qualified people;\n- Diverse and knowledgeable coworkers;\n- Innovative products and interesting Markets.", "Doran Jones is ever evolving, provides an opportunity for those seeking new challenges, gives opportunities to learn and develop. I have been working here for 6 months, but feels like I have been a part of DJ family for long time. I like working at DJ. The culture of this company is great. Everyone I work with are amazing including the management level. Any ideas we come up with are always welcomed by the superiors and we are given chance on implementing new things we come up with.", "Interesting clients in financial field.", "The senior management of the company used to be good (when I started) but the good managers left and the ones that remain do not appear to care about their employees.\n\nThey have hired junior testers with little to zero experience and then trained them. Giving new people a chance to break into the market. They also promoted some of these junior people to lead roles if they showed they were capable."], "taulia": ["Taulia is a place that truly tries to put the effort in to everything it does. The people here invest a lot of work and compassion into the company and their fellow colleagues, which can often promote a really inclusive culture built on relationships. The leadership is incredibly transparent and hold Q & A's called \"Fireside Chats,\" where we can all gather (through videoconference as well) and discuss issues or questions we all have as employees. They make the roadmap and strategy of the company available to us and involve us all in the process.\n\nTaulia is composed of so many good people all over the world who generally care about the well being of others.\n\nOpportunities for professional development.", "I have been working here for over 4 months and completely love it!!! They offer amazing benefits, great salary, and amazing perks!! Love that we each get a Macbook Air, $100 per month for our phone bill, plus three-weeks vacation. Work-life balance is great as well. One of the most fun companies I have ever worked for.", "Great Culture - teams have fun, work hard, and honestly enjoy working together. Great product. - solutions are best in class and evolving. Growing business - fun to be part of a winning company with constant growth. Good managers - people management is getting better as company grows. Positive impact on customers business - customers are winning and greating great value. Taulia is a place where your ideas are heard and you can make a difference. Leadership is very open and communicates well. Every employee is given clear visibility into the company goals and plans, future direction and vision, and the current status of the overall health of the business. Overall a very good place to work with smart people who believe in the company mission and make it happen every day.", "Talented people\n\nBest early payment product in the market\n\nTransparency into company goals/objectives & expectations to ensure individual/team goals align\n\nGreat opportunity to learn and expand career\n\nAs still in it's \"young adult\" phase, great opportunity to make a difference and build the playbook", "- People (including managers) are fun, friendly, helpful, intelligent and understanding\n- Generous bonus and good health care\n- Gives recognition and celebrates hard working/helpful people and company achievements\n- Work flexibility\n- Good Product\n- Well stocked pantry with lunch provided on some days"], "Snapsheet": ["The best part about Snapsheet is the people that work there, I can honestly say I have become friends, not just coworkers with so many people. It has nice perks (fun lunches, happy hours, game room). When I started it was unlimited PTO but as a company grows, they have to have some regulation on that but I still am allotted a healthy amount of days off. (This is something misconstrued in a lot of reviews, it’s not only CSO that doesn’t have unlimited PTO, the only whole department that has unlimited is tech) Every year I’ve worked here, I’ve never actually used all of my PTO days anyway. I work for a team that shows they care about me whether it’s my work or personal life. Working for Snapsheet allowed me to move from a black hole of a town to Chicago and I really appreciate that.", "The leaders will work with you if you show up ready to work each day. Put in your best effort and you can move up quickly. Those who think you’re just going to have some cake job working from home, you’re wrong.", "Beautiful office, great location, happy hours, free lunches. There are nice people you can meet working there. The CEO is nice and very approachable. Management may give you the shifts you want but you to wait and be persistent.", "- Getting to work with a wide range of new technology\n- Good level of autonomy\n- Biweekly hack days\n- Supportive management\n- Happy hour every Friday", "-Working Remote\n-LESS stress by far!!\n-Flexible with time off /shift switching for personal appts/plans\n-Good pay $$$\n-Cross Training opportunities\n-Gifts mailed to remote employees just because\n-1 on 1 meetings w/mgmt to discuss progress"], "square": ["Work-Life Balance, Culture, Benefits, Opportunity", "Square is building amazing products that have a direct impact on the economy, specifically small businesses. Working at Square gives you the opportunity to see how ecommerce and payment solutions can change the world and how fintech can be, dare I say it, FUN!?!? The workplace is the most diverse I have ever experienced, people of all different walks of life, age groups, educational backgrounds, and socioeconomic classes thrive here. It is also a very balanced work environment with people putting themselves and their lives before work while also being inspired and able to work on amazing things while in the office.", "Company is designed for internal growth- lots of opportunities", "Square was one of the best places I’ve ever worked. The culture is amazing and there are great opportunities for growth and internal transfers", "Food is provided - lots of options for breakfast and lunch, as well as snacks in micro kitchens. Also, the people you work with are pretty wonderful, too."], "Wheelwell": [""], "mixpanel": ["Fast paced and tremendously growing startup, open and collaborative culture, ample opportunities and practically every person in engineering/product/design is working on key strategic projects. Laser sharp focus on addressing product gaps reported by customers.\nSmart co-workers which includes a ton of Carnegie Mellon, Georgia Tech and Twitter alums.", "Great people, perks, and pay. I enjoy the people at the office so much I rarely work from home, even though it’s an option if need be.", "Friendly people, lunch about every day, snacks...", "Mixpanel is an entirely different company than a year ago. We’re listening to customer feedback but also balancing the basics with innovation. The new leadership team is seasoned and knows what they’re doing. Even more importantly, they’re humble and open-minded. Everyone makes bad decisions sometimes, but instead of acting like they never happened, the execs discuss learnings from the big ones at company all hands.\n\nAll the people we're hiring are smart and motivated, across all functions. Global expansion is happening quickly, which is helping us better serve markets where time zones limited us in the past.\n\nThere’s a real company strategy. It also makes sense and is communicated to everyone so they can align their work to it. Having everyone focused on the same objectives seems easier than it actually is at companies our size in a fast-moving market, so it’s great to see it coming together.", "People are great. The new leaders seem like the right people to get Mixpanel back into the huge growth it knew early on."], "Crossroads": ["Great coworkers and great benefits"], "Symbia": [""], "Empower": ["Flexible working hours, great environment to work in, challenging and satisfying work", "The pay was great and benefits were nice.", "Coworkers were great. Great schedule. Weekends off. Overtime. Some prevailing wage jobs.", "Great Staff lunches, and wonderful students", "Good work environment with a collaborative group of employees. Competitive pay and decent benefits. Decent opportunity for career development here."], "braintree": ["Awesome environment, supportive managers, and focus on diversity and inclusion", "The people and culture are great.", "- Some amazing, incredibly smart people who deeply care about their teammates and the product\n- Commitment to D&I is better than most places I've worked. There's still a lot of work to be done, but this was one of my favorite parts of working at Braintree\n- Good work life balance, excellent benefits including discounted stock (mostly thanks to PayPal)", "good people, they care about you", "- Free daily lunch\n- ESPP up to 10% of your salary (especially with a growing stock like PYPL)\n- Great overall team camaraderie\n- Tech office\n- Transit reimbursement\n- Work from home (depending on which team you are working for)"], "Smartlink": ["Smartlink does well on their part to ensure that every employee is taken care of. They take their employees out to lunch, they send out birthday cards, they ask about the job they hold and whether or not it is a good fit.", "Dynamic team and fun work environment. There is room for children to play, when you have to look after kid. Then you can bring kid to work and they can play in that room."], "microsoft": ["Good company to work for. Very flexible", "1. If you love tech, this is a great place. No doubt you'll talk tech (mostly the MSFT stack) from enterprise to consumer - from PCs to phones to Xboxes - from datacenter to desktop.\n\n2. What were GREAT benefits are now VERY GOOD (took a small step down) but still probably better than you'll find at 99% of large corporations. If you've got family - the value of the benefits is even higher. 401k match is nice.\n\n3. Even with it's struggles MSFT is still a cash printing machine. This means if you can keep your nose clean and do reasonable work, you can have a stable job, pay your bills, feed your family, and not worry (too much) about layoffs. The stock you own likely won't tank, but probably won't go up much either. You'll get a bonus each year and some stock. It's a decent life if you aren't looking to light the world on fire.", "Culture is becoming more transparent, authentic & vulnerable.\nNew projects are exciting, high energy\nLeadership is working to be more self-accountable\nStock price", "smart people around and growth", "Great benefits - takes great care of employees."], "Bully": ["-Company focuses on building employees with wide skill sets, allowing people to learn new areas and grow quickly\n-Org. structure is fairly flat, allowing for meaningful interaction with senior staff + partners\n-Partners + senior staff regularly hold office hours + Q&As to explain decisions and answer questions\n-Hard Work + Success are recognized and well compensated\n-Benefits + PTO are generous\n-Staff is friendly and works across teams", "Every top name client goes through BPI in some way.", "Surrounded by great and amazingly smart people.", "BPI is very committed to employee training\nCool clients\nGreat team", "-Great opportunities for individuals to grow and be recognized for contributions\n-Work with some of the smartest people in the industry\n-Work for a mix of political, non-profit and corporate clients\n-Focus on training and developing skills, especially in paid Fellowship program\n-Unique perspective on ad/comms industry\n-Business outlook stability and greater company growth expectations compared similar DC firms"], "gobble": ["- High engineering standards which translate to learning how to write code that is maintainable, well-tested, and readable.\n- Because it's a lean team, you're given plenty of opportunities to learn about different aspects of the business. Despite being hired as an engineering intern, I've learned about data science, marketing, and growth in my short time here (3 month internship).\n- Direct interaction with senior leadership who you can lean on for asking questions, and who are willing to do 1-on-1 mentorship discussions.", "I liked my schedule and the inventory manager was the best in the warehouse. He definetly has his team's best interest at heart .", "They will mislead their employees.", "Working with brilliant people who give their 100% to everything they do. Lean and dynamic where you are encouraged to show your skills, creativity and take initiative. You'll learn new things every day.", "Working with a bright, dynamic and highly motivated team with diverse skills. Open to ideas from employees on business growth."], "splunk": ["good company to work for they provide free lunch on monday and weds and friday is free lunch the employees are friendly and my manager is excellent", "Financials and stock have been strong. Good pay and benefits. Maternity and paternity leave is fully paid for 20 weeks. The people are highly passionate about what they do across any org.", "Great benefits and great people. Innovative product.", "At Splunk you have the opportunity to continuously grow professionally and personally. Splunkers who intentionally focus on being adaptable and embrace the constant change will find themselves leveraging the multitude of resources available to them. This typically results in innovation and creativity leading to success within their current role and beyond.", "Great people; amazing purpose. I think the leadership are very authentic! Great working environment."], "Getaround": ["Dynamic energy, very dedicated people, feels like a family when you come to work", "- Hard workers are rewarded\n- People care about your career path (I've had 3 distinct roles, and a say in what I'm doing)\n- The smartest people I've ever worked with", "I decided to take a job at Getaround because of the passion, intelligence and genuine spirit of the people I met with during my interview process. Working there has only been more inspiring and motivating, this is a great place for people who want to contribute to a truly special company and vision.", "I’ve been working here a couple years and love the company. There is tremendous opportunity for career advancement and I’m surrounded by a whole bunch of really smart people who make each other better.\n\nThe company is growing super fast, which is really fun and also challenging. This really isn’t the environment for people looking for a place to relax and collect an easy paycheck. Getaround is a marketplace business with hardware, software and operations that all move quickly and have a lot of interesting challenges and fun problems to solve. Everyone seems to be working hard and there is great teamwork both within and between teams.\n\nLike so many other startups, there are a bunch of cool perks... the free lunches and unlimited snacks are awesome. Plus free credits to use for Getaround cars.", "Curious group of people, doing great work. It feels like executives and my manager really hear concerns and act on them quickly.\n\nCompensation is reasonable and improving. So is the information flow around product updates. There's virtually no politics.\n\nBenefits and perks are competitive."], "samsung": ["Good pay, Great benefits, Growth, Diversity", "It is a good place to work with influx of tech. And a diverse environment. Recommended.", "Great health care, and 401k; Quick milage reimbursement; Fair pay and yearly raises.", "Great health insurance\nMatching 401k\nInnovative products", "Many opportunities to learn technologies."], "Venesco": ["Excellent management, team oriented company!", "The Venesco team is a pleasure to work with.", "I've talked to my management on the phone many times and met the contract's POC once in person and they are always a pleasure to talk to. The company is full of very motivated and friendly people.", "Venesco is an ethical company with integrity.", "Although it is rapidly expanding, Venesco cares about each individual employee. Excellent benefits and a great work/life balance. Would 100 % work for this company again."], "nurx": ["The company has incredible market fit and an absolutely brilliant leadership team. It's an exciting time to be a part of such a fast growing company where everyone is truly working to have a positive impact on healthcare.\n\nFounders have acknowledged past missteps, but the company is so large now that those seem to be in the past.", "The people are great. Everyone is genuine and works hard. Nurx is a Mission driven company that is making a real impact and it shows in the people the people they bring to the team. Fast-paced, fun and open office environment.", "- Mission-driven organization\n- Impressive new leadership\n- Strong growth company\n- Free lunch and breakfast\n- Great perks (401K, health benefits)", "Incredible benefits\nIncredible perks and work environments\nLots of autonomy as long as you get your work done", "-Amazing perks and benefits - comparable to what you'd find in a much larger tech company - wellness benefit, commuting benefit, lunches, fully stocked kitchen and lots of team building activities\n-Mission and vision that I believe and at my core want to support.\n- Opportunity to really make an impact on many levels and really push yourself to achieve amazing things while learning and developing your skills\n- The people - rare to find a company where all the people are working hard, genuinely nice and fun to be around\n- Flexible work schedule and definitely work/life balance - people work hard here but the company's culture doesn't value micromanagement. Employees have a lot of autonomy and have some flexibility to work from home when needed\n\nThe company as a whole is moving in the right direction. They were missteps and mistakes but it seems these are acknowledged, recognized and improvements have been made to resolve some of the issues others have pointed out in their reviews.\n\nI truly believe it's an exciting time to be part of this company and things will only get better."], "Agentis": ["- Understanding and effective leaders that want to see employees grow, both personally and professionally\n- Employees feel like they are contributing and that they are important to company and leaders\n- Big picture vision that makes us competitive in an interesting market\n- Not a lot of bureaucracy, easy to pivot\n- Small company atmosphere, even when staff is growing...fun company events\n- Great benefits package\n- Fun office environment with easy access downtown location", "Culture - The management is professional, competent, and most importantly they place a lot of trust in their employees. No one micro-manages and they are great about giving the support you need to be successful.\n\nMarket - Things are really taking off. The company has doubled in size and we're planning on doubling again. I've never worked somewhere where the clients talk so highly about our products. Seriously, people love it.\n\nCompensation - Right at the market average for tech companies in Chicago. Flexible WFH is a huge plus.\n\nWork/Life - Some long hours here and there when deadlines are looming but not anything crazy and its not frequent enough to be a major concern.\n\nValues - Its awesome working for an energy that practices what they preach. A \"Green Technology\" company that does a lot in terms of conservation around the office, and volunteer work outside of it.", "Agentis is a great place to work because it is a fun and fast-paced environment that allows for creativity and innovation. At Agentis you are encouraged to take on new challenges and discover your strengths. The people are very sharp and inspiring to be around!", "- Great company culture\n- Positive environment\n- Lots of opportunities to grow\n- Solid exposure to the tech and energy efficiency industry"], "eventbrite": ["Everyone is passionate and excited about the work they do here. People overall have a positive view on the goals we are trying to reach as a company and look forward to what's coming down the pipeline and eager to tackle. Folks are kind and have a team oriented attitude. For a tech company, there's a fair amount of diversity and they are working on increasing even more in that area.", "Eventbrite offers many benefits for employees to take advantage of", "Great career opportunities here - lots of intracompany mobility. There are a lot of really tenured engineers at Eventbrite because people like the work culture, their coworkers, and with all of the opportunities within the company there's always an interesting next project.", "- We have a great educational culture. For me, the most important thing I was looking for was investment in my engineering education, and that's happened on both a team/manager level and department wide. We have many internal educational programs (lectures, workshops, funding for conferences and educational materials, mentorship program, access to Udemy courses, etc), and my managers have been fully supportive of helping me transition to fullstack engineer. I mean, I am working right now with one of the founders on Django on an educational project. That's so awesome in and of itself.\n\n- We have a great engineering culture. We have a healthy culture of feedback and discussion - I feel like we are always discussing the best way to accomplish things, and people are really passionate about finding the right way forward that's the best for everyone.\n\n- I really believe in the product and mission. Our goals are to help create live experiences as well as support our event creators, which is something I can definitely get behind, having been an event planner in a previous life.\n\n- I get to bring my whole self to work, and get to do all the things I'm interested in. I'm not only interested in coding - I also love education and diversity initiatives, and have been allowed work time to accomplish things like an internal mentorship program and bringing diverse groups into our space.\n\n- We have a great culture overall. Management is celebratory of the work we do, without being too over the top and flashy (unlike some other companies in the area). We have lots of great internal events as well. Also, I really feel like management cares about both the employees and customers. Management is constantly asking for feedback and acting upon it.\n\n- I have lots of opportunity for growth and promotion, and options available to pursue the career path I want - either continuing to be an individual contributor or go into management. I've also had multiple directors across different departments take interest in my career growth and offer their help.\n\n- I feel like I'm being paid very fairly and there are great benefits. Good medical, and lots of really nice perks around the office - smoothie bar, in house massages/chiro, lunch is provided, snacks, commuting benefits, wellness stipend, etc.\n\n- I am really listened to by my manager and upper management. I was rather unhappy on a project due to extenuating circumstances, and was switched to a different project that was more in line with what I want to accomplish. All of which I feel very grateful for.\n\n- Good work-life balance. Sometimes there's a project deadline and people have to work really hard to get stuff out of the door, but in general managers are really respectful of work life balance. We also have a really good culture of being flexible with time off and working remote.\n\n- I get to build cool stuff, working for our R&D department.\n\n- The interview process was one of the best I've ever been through. They were willing to meet me where I was at (being a junior engineer), and my first phone screen was with a director, not a recruiter. That really left a lasting impression on me.\n\n- Lastly, the people. I LOVE the people I get to work with - they are so incredibly knowledgeable, kind, and supportive. Also, just really freaking cool. Everyone has something that they are passionate about, both inside and outside of work. I have met so many amazing and inspiring people at work, and genuinely feel like I have made friends. This is probably one of the biggest factors of what's going to keep me around for a long time.\n\nAll in all, I can't recommend Eventbrite enough. I love it here, plain and simple.", "Benefits, company culture, basically everything."], "autodesk": ["We're given a lot of freedom and our feedback is listened to. I've made fairly large decisions based on my research and experience. My managers have always trusted my decisions and supported any changes I've proposed. We get to participate in quarterly calls with the CEO staff as well as a call with our specific department heads. I feel connected, trusted, and valued.\n\nThe pay, bonus, and vacation benefits are great and the medical benefits are amazing.", "Awesome working environment and learned from great people.", "This company is full of passionate, smart people. We continue to expand the solutions we offer to a wide variety of industries. We do good in the world, in addition to doing well for investors.", "People are smart, educated, driven, and techincal challenges are awesome and fun ... office is awesome too", "Great culture. Very professional. Benefits are amongst the best you can get."], "Veolia": ["Great co workers to work with", "Employee friendly. Good pay", "Great hours and great employees", "The pay is pretty good\nLove the work", "Working in the Environmental Services division for nearly 20 years I always had a sense of being apart of something big and contributing to society."], "Dependable": ["Listens to employee feedback and adjusts when able", "Very accessible. Quick to provide assistance with challenges. Up front and honest. I have been with the company for less than a year but everyone from my first level manager to HR and HQ Execs have been helpful and upfront in replying to all of my questions. I feel like they are more like friends than upper level management.", "Benefits and pay are good. Always treated well"], "shippo": ["Shippo is a company where you can learn a lot, while growing professionally, and you'll work with nice, smart, and very talented people! My experience has been that the executive team, not just the executive I report to directly, personally want to see me achieve both my personal and career goals. In my experience it's somewhat rare to find such an approachable executive team that sincerely cares about your growth and will help you achieve your goals in the way I've seen it play out at Shippo.", "There is a big market opportunity in an exciting space/industry. One of the biggest fears in PR and communications is fatigue in the media for your own industry segment. A major pro here (and challenge) is not only creating the category itself, from a communications perspective, itself but positioning the company as a leader in it. There is a TON of work to be done here.\n\nWith that said, the environment is suitable for people who want to create the playbook rather than ask for the playbook (there isn't one).\n\nShippo was a supportive employer throughout my pregnancy and maternity leave. The company is also supportive of working parents and ensures that team members feel comfortable taking care of personal and family matters-- flexible time off, etc.\n\nOne of the nicest most, collaborative group of people I've ever worked with. Has dexterously done away with bro-culture entirely.", "You get lunch and snacks", "1. Good product/market fit\n2. Good fun individual contributors, although the retention rate is so low they probably won't be there for long.", "Promising business potential and plentiful opportunity to find a place among their competitors."], "Cloudreach": ["- Exciting industry\n- Great work/life balance and flexibility\n- Transparency (frequent Q&A with leadership, quarterly business updates, etc.)\n- Communication & Collaboration made really easy with cloud-based solutions\n- Unlimited PTO, comprehensive benefits (medical, dental, etc.)\n- Big emphasis on promoting your personal growth. If you express an interest in a subject, you are encouraged to learn about it\n- Leaders trust their employees\n- Fun offices (some are dog friendly)\n- Relaxed environment without sacrificing hard work\n- Individuality is respected and valued\n- Colleagues across the globe", "Unlimited time off\nQuarterly events were fun but not sure how long they will continue for the leadership was beating around the bush about it\nSome interesting projects", "still some great people here (though seems like they are getting pushed to the background for new blood though which is a shame).", "They value tech talent and are willing to invest in tech training", "None. Googling for solutions is their tool. They know how to use the search engine well."], "zendesk": ["The company is passionate. They really care about the employees and when we are inside the company, we know that Zendesk truly live it values. Marketing & Sales very well aligned as a company and as a Marketing professional I do feel that the company empowers the area and gives us accountability of the results.", "snacks\ncool brand\ninteresting possibilities w/ the product suite", "Good salaries and packages. Good culture with diversity and volunteering. Feeling of working for a good company. Great work/life balance and associated benefits.", "Fast growing company, a lot of opportunity", "Worked on a small team of great people. Great work/life balance. Beautiful office space."], "ripple": ["Very bright and senior coworkers, VERY collaborative office, such friendly staff, some truly amazing leadership! ICs are given trust from leadership to do what they were hired to do. PERIOD.", "- Ripple has found the necessary balance between new tech like blockchain and the needs of slow-changing financial institutions\n\n- There's tons of space for new projects and individual initiatives despite already being a relatively large startup\n\n- Direct access to leadership is possible, frank conversation encouraged, and people do not tend to have fragile egos\n\n- This is a truly global organization from the start. With offices and teammates from all over the world, plus a focus on cross-border payments, it will only get more so.", "Excellent on-boarding process that really gets you to meet and learn from everyone, including leadership. Friendly, bright colleagues that are more than happy to collaborate across business units. Modern technology and tool flexibility. Clear vision and plans to change the world.", "Seamless recruiting process from start to finish with brilliant people. Very dynamic pace but exciting at the same time as company grows and scales, The culture is that of caring about employees and being very transparent with them. Overall great positivity.", "Company has a great, important, and globally relevant mission. Smart people working fast to accomplish A LOT and it's really happening. I'm happy to be in a place where there's a lot of positive energy and momentum."], "Mavenir": ["great people, great management, love what i do", "Start up mode work, new technologies, lot of challenges", "Flexible hours, work from home when needed", "Agile environment, learning culture, young teams", "Mavenir makes good powerpoint slideware"], "university of texas at austin": ["Interact with students, get closer to professors (for letters of recommendation)", "Flexible hours, great community, helpful coworkers", "People are amazing and lots of learning opportunity", "The topics and the research group.", "Beautiful campus with intelligent and creative coworkers"], "Manhattan": ["too many here as its great", "A great place for someone new to media and who wants to learn at an entry level", "Flexible, resourceful and well-equipped.", "-A good place to get your feet wet.\n-Some coworkers are pretty great!", "Great community\nFreedom to develop new ideas\nAccess to top of the line equipment\nGreat workshops\nmany of the staff members are knowledgeable about the production world"], "Lightning": ["Lightning Bolt is a dynamic and quality industry leader that has been recognized as first in automated physician scheduling for two consecutive years. Staff and consumers alike are both loyal and enthusiastic about the product. The environment was positive and lead to a lot of growth for me professionally. Salaries are competitive and I was promoted several times during my employment at LB. Management provides training and support to ensure employee and company growth while investing in each individual's career path. Confidence is now at an all time high now that new leadership is in place.", "Prefacing this review with: It seems like a lot of these reviews are either 1* or 5*. Let's be realistic everyone, Lightning Bolt is not the best of the best and cannot compete with other 5* places like Google. But it is also a cool place to learn & work and by no means is a 1* company.\n\nAttempting to be as unbiased as possible, as a lot of these reviews are either mad ex-employees OR current employees whose job is to make LB look enticing (you can tell who these two groups are if you've worked here...)\n\n-Bright coworkers. Warm, friendly environment. Very easy to get along with (most of) your coworkers.\n-Work from home Tuesdays & Thursdays\n-Flexible WFH, if wanting to take \"half-breaks\" maybe working from your hometown, etc.\n-Snacks available in the office (chips, drinks, fruit, etc. Small lunch items available to make an OK lunch. Catered lunches about 1-2 times per month.\n-Software idea is cool and is probably the best for the specific/niche market that LB is in\n-Old management is being cycled out. For good or for worse, that's up to the individual. Personally, I think new management will be much better for growth in the long term\n-Promotions/raises are looking quite good recently (past 6 months) as a point to combat other people's reviews saying low raises/promotions. BUT maybe this is only due to the employee turnover all at once\n-Extremely easy to give feedback to seniors/leads/management and you will almost always get immediate changes if it's truly a good change\n-Opportunities to work on side projects of interest: client facing, internal facing, sales, etc.", "-Advancements in your career and growth as an employee. I started out part-time, and I am now part of our management team. In fact, most management started at entry-level and have worked their way up. You're also given the opportunity to gain experience in other aspects of the company that you're interested in. If someone feels their position is \"dead-end\", then that's most likely on the employee.\n\n-Work-life balance is huge-- especially with the option to work from home. This is probably more of an outcome of the overall culture of caring for the employees. Any company should know that their employees are their most important asset, and Lightning Bolt embraces this.\n\n-Working with great people that you can learn from. You're surrounded by very intelligent and bright people who bring different backgrounds and experience with them. There are a lot of friendships here, and we all want to help make sure each other succeed. If there are staff who are detrimental to moral, productivity, and the overall culture, management will make sure to address it.\n\n-Easy access to management and the ability to have a voice within the company. All staff have one-on-one meetings with their managers. Anyone here can talk with the CEO if you want-- something I would've never imagined at my past positions.\n\n-The office has been great to work at! I know most of it has been built with suggestions and feedback from the staff, and it's always getting updated based on suggestions from the team. The pool table is easily the most used toy we have!", "Great work/life balance, get to work from home every Tuesday & Thursday.\n\nNewly remolded office with lots of space to work silently or as a team.\n\nThe incredibly smart team, always willing to answer any questions you may have.\n\nFully stocked kitchen; one side of the office is dedicated to leisure (ping pong, huge projection screen, basketball hoop, fully stocked bar (albeit with bottom-shelf liquor), in-house gym).\n\nOpportunities to give your own input and be creative with projects.", "Fantastic Management (sales)\nFlexible\nTeaches work life balance to prospects and encourages the same principles for the employees.\nThe office offers a great work environment\nThe incredibly smart team!"], "Levy": ["Great company to work for.", "Community of employees and overall experiences", "Fun people, easy to commute to", "All about he customer, so usually have the power to to whatever it takes to make things a wonderful experience, within reason.", "The quick-paced setting makes the time fly, people were great to work with, energetic environment and good hourly/tips earnings compared to other server positions at other restaurants."], "salesforce": ["Great Benefits, people, and the culture is amazing", "Salesforce is a destination company and there are few places where you will find so many truly interesting and gifted people in one firm. There is a real effort to continue to promote the company's values, including trust and equality. Support for philanthropy is significant (although I would agree with the reviewer who noted that \"volunteer\" activities are often anything but voluntary but rather expected/required. (Not to say that giving back is anything other than positive, but it's just worth noting that most company activities include it as part of the agenda.)\n\nThe customers are interesting and the tech is pretty solid. The benefits are what you would expect from a firm that wants to hire top talent, in other words, extensive and high quality.\n\nThe company continues to grow at quite a fast rate, and that is an imperative. The acquisitions are part of that and it's quite clear that they are necessary since there is only so much organic growth coming out of the core businesses. If you are in a \"good\" territory / team / department, this may in fact be a dreamjob. There are quite a lots of employees who are able to devote many hours (days) to volunteer causes, company social functions, training opportunities and so on. This is particularly the case if you are employed in one of the hub offices.", "Great benefits, culture, lots of opportunity.", "Interesting and Challenging work\nFriendly and Qualified co-worker\nGreat work life balance\nGreat growth opportunity\nExcellent overall benefits", "I’ve worked at Salesforce for 14 years and it’s been quite a ride! The company is fast-paced, values-oriented, and full of opportunity. I’ve always felt confident that the company bases its decision making on what is right for our customers and the future of the company. People who are motivated, collaborative, and hard working will succeed here. As Salesforce has transitioned to a larger company, a lot of effort has been put in place to integration and foster collaboration across the company. Salesforce has maintained and strengthened its culture with growth, something that is not easy to do. It’s a pleasure to work here."], "eaze": ["- Great team: nice people to work with, they are strong contributors and care for each other.\n- Good work/life balance and unlimited PTO: there are times when the team has to put some extra hours but most of the time we're flexible and we encourage each other to take time off then we need.\n- Beautiful SF office!\n- Extremely interesting industry\n- The company is maturing and transitioning from the typical startup to a more structured org\n- The team is growing fast", "- Fast-paced environment with tons of interesting problems to solve!\n- I find myself surrounded by an amazing, passionate group of people who really care about each other and the work we do.\n- It’s an extremely exciting time in the cannabis industry and as a leader in the space, every person on the team has the opportunity to make a massive impact.\n- Lots of autonomy - a very rewarding experience for self-motivated folks looking to stretch themselves forward in their career.", "Unusually high degree of autonomy.\nI've worked here for two years and the thing I love most is the ability to push initiatives and have a direct hand in how the company operates. Company culture is quite unlike any place I've worked previously. There's a lot of camaraderie and in-jokes among the engineering team, without going so far that people seem unprofessional or immature.\n\nWork life balance is quite decent. There's crunches at times, but we don't glorify them. On call support works on rotation, and has improved dramatically in my time here (rather low stress these days).\n\nCareer growth opportunities feel pretty exceptional here if you're able to take a lot of ownership. I've felt fortunate to find a place I can focus more on the work than playing politics and fighting for raises. Engineering managers do a decent enough job of being advocates, and not micro-managing.\n\nOverall I believe this place does well at rewarding people who communicate clearly, directly, and in good faith. I'd say it especially favors people who are willing to do more than simply execute on tech specs and are willing to get their hands dirty with the \"glue work\" as it were.\n\nOverall, in engineering at least, I'm pretty happy this place hasn't become a stereotypical tech bro playground, as may be often assumed by outsiders.", "- The nature of the industry means that Eaze tends to attract risk-takers, innovators and people who are genuinely passionate about cannabis (rather than the type who are simply looking for a big exit)\n\n- I've been at a number of companies that advertised a \"fun\" culture, Eaze is the only one that lives up to that promise (especially within Product & Engineering)\n\n- Managers and leadership that are compassionate, care about employees' well-being and willing to work with you when personal needs come up\n\n- Amazing new SF office\n\n- Fantastic work-life balance: there are crunch periods like any other start-up, but efforts are recognized and breaks are encouraged.\n\n- Lots of opportunities to grow, challenge yourself, and figure out new solutions to problems you've never seen before.\n\n- You get to work in cannabis!", "* The employees are the nicest I've ever worked with\n* Lots of autonomy\n* Tons of challenging problems to solve\n* Lots that's left to build and create (you're not just maintaining an already working system)\n* Great work/life balance\n* Beautiful office and views"], "Sandata": ["Career development/lateral opportunities significant\nCompensation is great\nGood, nice people\nRemote work flexibility\nOpen-minded to change, new ideas\nFirst to market advantage - company has been around a long time, customer loyalty", "Benefits (employee events, clubs, etc)\nSupport from management and coworkers\nWork load is great, nothing that can't be handled in a timely manner\nHour paid lunch", "Senior management truly cares about the Sandata employees and frames their actions in that manner. They are transparent about the highs and lows of the business, and they love to brag about extraordinary employees and their extraordinary efforts that make Sandata #1.", "Great department, Great insurance, Supervisors that are easy to speak to, and amazing team.", "The people. The amount of care the HR department puts into everything they do."], "fastly": ["If you're one of the ~100 engineers here you'll be making a big contribution to the system that runs 10% of the internet. There are scale problems here that happen at very few companies this size. Your peers are competent and kind.", "Amazing Tech\nvery smart people\ngreat place to learn", "Super smart management team\nGrowing rapidly\nGreat technology making a real impact on major customers\nExcellent work/life balance\nGood culture and infrastructure for working remotely", "The team tends to be mature and experienced, and there are a lot of smart folks.\n\n* Tons of knowledge sharing/mentoring\n* Doing things at scale\n* Transparent, candid culture\n* Working with people around the world helps broaden your perspective\n* Executive support for core investment, diversity and continued cultural maturity", "- Management is extremely supportive, and executives regularly avail themselves to help with day-to-day efforts\n- Processes and tools in place to support remote employees very well\n- Great compensation and quality of life\n- Excellent focus on hiring great people, who focus on customers and make you feel good about what you do"], "Springshare": ["Supportive environment, great coworkers, overall a very nice working environment. Working with libraries and schools, so supporting education and helping others succeed. Very good salary and benefits package. Working from home a nice plus.", "You will work on great technologies and would be a good learning experience.", "Springshare has a great reputation in the library world. Super flexible vacation & schedule policies, good pay.", "Work remotely, but that's changing\nlow turn over rate, but that was before\ncollaborate and friendly working env.\nstill the marketing lead. e.g. libguides"], "Chartio": ["- Rapidly evolving company\n- Exciting changes happening every day\n- Challenging work (great if you embrace challenge)\n- Scrappy team does what it takes to hit goals\n- Incredible product\n- Strong presence in the market\n- Abundant growth opportunities\n- Team is very close; feels like a family\n- Catered lunch", "Convenient San Francisco location, free lunch daily, unlimited PTO, great product potential. A lot of effort/resources is put into building 'culture'.", "- Super engineering and product team, nice and smart people\n- Engineers can be as involved as he/she wants from the design stage to deploy stage\n- Amazing work-life balance, unlimited vacation\n- Can choose equipment & free lunches", "Chartio has been a good experience thus far. The company is fairly small, with ~35 employees which I personally like. It’s large enough to have some specialization in sales, marketing, customer success and engineering but not so large that those teams don’t collaborate. I’ve really enjoyed working with people across the entire organization thus far.\n\nThe product itself is also exciting. It’s fun to be in the business intelligence / data analytics market. Chartio’s roadmap and vision are compelling to me personally, as I’ve seen numerous past companies struggle to use their data effectively.", "Smart team with a lot of talent and a fun environment to work in. Strong product with the potential to make a big difference in the market. The CEO does not follow your typical Silicon Valley arrogant stereotype. He is a genuinely nice person who cares about the people who work for him, but can also make difficult decisions to move the organization forward. The new leadership team has a lot of passion and experience to take the company to the next level and the team is already having a positive impact on culture. Do not shy away from the company due to some of the vocal negativity of disgruntled former employees."], "metabiota": ["Subject matter experts across such a diverse range of skill sets, from the hard sciences of epidemiology, microbiology and public health to the exploratory sciences of data, AI, machine learning, etc, and everything in between, including insurance, government services, consulting, technology.", "-Great people to work with\n-Company has lots of potential", "The work I was a part of had a decent amount of travel opportunities and a lot of hands on experience, plus (on the surface level) a great culture, but that was really dependent on the people you worked and if you were lucky and on the right side of management making the calls.", "- Great people with exemplary values\n-Powered by a mission that gives meaning to everyday tasks\n- Flat organization with lots of room for growth\n- Great location and office amenities, as well as flexibility in work arrangements", "The company has a noble mission supported by smart people."], "Adaptive": ["The chance to be yourself and grow with the firm\nVery collaborative team\nThe projects are very cutting edge with the newest tech out there", "No limitation in buying licences for developer tools.\nA lot of communications with other offices and clients.\nHigh level of English, fruits and beer in the office.\nAbility to work from home.", "I have never worked at a company before who cares more about their staff welfare. Every time I have needed help, or someone else needs help, the management team jump into action. From HR to the CEO, everyone is willing to help, and will do whatever they can to make things better for you.\n\nThe C-level management team are very accessible to everyone. They have grown quickly, and are all busy, but never too busy to listen to you or have a chat. It is lovely to have such a down to earth management team, who do not have a trace of arrogance, and make an effort to listen to your input and ideas, then thank you for them! I personally, have had many a meeting with the CEO, who has asked my opinion, listened to it, and made decisions based on it. How refreshing is that!?\n\nI love the diversity within the company. As a woman in tech, the workplace can sometimes be a lonely place, but here at Adaptive there is a broad spectrum of people from all walks of life, and this makes for a fabulous and diverse workplace.\n\nPeople here are seriously smart. Seriously. It is such a luxury to work with a bunch of superheroes who need little to no management oversight, get on with the job, and do a fantastic one at that.\n\nPeople here are also very friendly, and work together as a team, with a huge amount of mutual respect. There are plenty of social things that happen as well.\n\nIt's a great office in London, with fab views out over the city.", "I've enjoyed working for Adaptive Consulting for now more than one year. No hierarchy (no \"boss\"). The collaborators are let free to organise their work as it best suits them. I've worked on a project using trending technologies and very challenging, having the opportunity to work with great people (some of them located in the London office) and learning a lot.\nMoreover, the company is growing and in constant evolution with more clients and more and more projects.\nA very nice atmosphere where respect is always present. I sometimes travel to the London office, and the feeling there is also very good.\nI highly recommend.", "I came on board at Adaptive on a fairly large and challenging project. Now, I've been around in financial services for a long time, and I know how most companies in the sector operate; I fully expected to be left high and dry, desperately trying to deliver an ill-thought through project while being whipped through constant 14 hour days, and seven day weeks.\n\nConsequently, I was stunned when it become clear that that the absolute opposite was true. In fact, the directors had my back throughout. When I needed support, they were there, and did their absolute best to do whatever they could to help. They set the strongest possible example, always thinking of their employees first - and by the way, such strong examples are what really sets a company's culture. At all times, I was empowered, supported, and (maybe most importantly) trusted. Here, delegation is of both authority and responsibility; I have seldom seen environments that are both so respectful, and so empowering. I can't stress enough that the ethos and culture of this company is genuinely something unusual in the sector, and I count myself extremely fortunate to have ended up here.\n\nCareer opportunities? They are definitely there, if you want them. The company is growing quickly, and if you want responsibility, you can step up, and it's yours for the taking. On the other hand, if you want to just come in, do a great job, and preserve your work / life balance - that's OK too. Meanwhile pay is high, and benefits are strong.\n\nI honestly can't recommend Adaptive enough - I'd certainly refer the best and brightest people I've ever worked with here, and I can't think of a better endorsement than that. I feel privileged to be here, and hope it will continue for a long time into the future."], "gusto": ["-great base pay\n-unlimited PTO\n-amazing company culture\n-catered healthy lunch every day/ free snacks\n-AWESOME people\n-growth and promotions\n-ability to feel always included", "Gusto is awesome - and for me, it is the perfect blend of \"small startup fun\" and still having enough structure/ resources that it is not madness.\n-Very good work-life balance (PTO, schedule flexibility, WFH etc)\n-Genuinely challenging work (While not the flashiest space, the domain is complex)\n-Amazing people (both nice and smart)\n-Equity! (Slice of the pie of a 2 billion company)\n-No micromanaging\n-Diversity and Inclusion top of mind and actually walk the walk\n-Great benefits (catered lunch, free travel at 1 year anniversary, healthcare, etc)", "+ Amazing product. Gusto is needed in the market - we have an intuitive, easy to use product that is truly helping the lives of so many small businesses. When you can believe in your company and the product, it makes your passion for work so much more!\n\n+ growing company means a lot of opportunity for career opportunities. I've had the opportunity to work within 2 different organizations and have had my team's full support for my career growth and progression. The timing made sense for me professionally as well as aligning with the business need.\n\n+ Welcoming environment. Gusto is inviting, inclusive and welcoming to all Gusties. Coming to work every day to welcoming faces is just an added benefit of loving the job.", "-Awesome people to work with\n-So much to learn!", "I've been a full time employee at Gusto for over 3 years. I love that I work at a company that is actually solving a meaningful problem for an underserved market. Gusto is a mission driven company and genuinely focuses on doing the right thing for our internal employees and our customers.\n\nWhat has kept me at Gusto? I get to work with talented people, working on a challenging problems, and have had incredible career growth along the way. I love that my day to day work has a high level of ambiguity, ownership, visibility, and impact .\n\nEven though we have grown quickly I feel like Gusto has stayed authentic to our values and maintained a consistent culture. For example, we are still a shoe-less office which might seem crazy given that we are over 850 employees. At the same time, I appreciate that we have kept the tradition alive because it aligns to our collaborative approach to work and \"no egos\" mentality.\n\nOn a personal note, Gusto has been a sustainable long-term career fit for me because I have flexibility when it comes to taking time off and working from home when needed. We have \"flexible PTO\" and I typically take off, ~4 weeks/ year. When life happens and I can't make it into the office, my manager has always been understanding and supportive."], "Riskonnect": ["My most important boxes were checked when I accepted a position at Riskonnect. I have the flexibility to chart my professional path, support when I make a mistake or succeed, and feel like a part of a team.\nI love what I do, I am challenged daily, and enjoy the people I interact with internally and externally.\nThis organization, like most, is what you make it. You decide to dive in and be a star and you will be rewarded.", "Good people, industry leading product, good client relationships", "Pretty decent client base, liked the people in the office, and good office space.", "Culture and an opportunity to grow! It is an exciting place to be where employees can add value and learn something new every day.", "The product solutions are FANTASTIC. Riskonnect as a integrated risk management solution is making leaps and bounds. If you enjoy working in Salesforce.com and you like being on the leading edge of technology, this is an exciting place to be.\n\nThe new CEO Jim Wetekamp is actively moving the company in the right direction. I'm sad that I won't be there to be part of the forward movement.\n\nI really enjoyed working with the other Account Managers and Technical Consultants, in addition to all the other departments (i.e., accounting, data services, internal operations, sales). As a smaller company, the environment feels very welcoming if you build solid working relationships. Leaving Riskonnect was a difficult decision because I had so many friends and close colleagues.\n\nOther benefits offered are nice too and worth mentioning. For example, flexible work-from-home schedules, lunch ordered from restaurants in the area tax-free instead of a cafeteria, beer tap in cafe, dogs permitted in the office, beautiful walking trail and lake outside the office space which is great for lunchtime walks."], "marsh": ["Global company, approachable execs, good communication", "benefits are not bad overall", "Top insurance brokerage and exposure to large client base", "Benefits program and workplace flexibility", "Flexible\nGetting away with anything, people can do nothing all day and not get in trouble"], "doximity": ["-Fast paced environment with solid leadership that is open to listening to ideas no matter your level in the company\n-True collaborative environment\n-Senior leadership is incredibly welcoming and made me feel apart of the team from day 1\n- Co-workers are eager to answer questions and help you in any way they can\n-Fun perks and an understanding of work-life balance\n-Although it's a growing company, there is a lot of importance placed on staying true to the mission, values, and culture", "surrounded by smart, driven people who are passionate about their jobs\nfree lunch\nWork from home Wednesdays\ntravel quarterly for team offsite", "Great people. Solid team. Cares about employees. Work from home Wednesdays for the entire company. Commute stipends. New 10k Fertility and Adoption benefits. Growing client base with deep pockets. Fun Offsites throughout the US to connect with remote employees.", "- the incredible amount of trust given to us by the CEO\n- working in a real industry with real problems (and real opportunities)\n- working with some of the nicest, smartest people I've ever met", "- Overall a fun place to work. Great people who are competent, know how to get things done, and know the importance of having a good time.\n- An individual's success/enjoyment may depend on their team's style. The overall culture is appealing. But, if you're interviewing, try to understand how your team approaches its process and internal management. What are the expectations? How will they support your growth?\n- The perks are legitimate, but anyone can find something they don't care for or wish could be better. We all have our share of suggestions. Many of them seem to be taken into consideration. Some are not.\n- A very promising business model, and the company proves its value quarter after quarter."], "yelp": ["Great culture, supportive management, and lots of perks", "I am writing this review 6 weeks after leaving Yelp and about 4 at my new company so I feel like I have had some time to digest, compare, and reflect on my experience.\n\nTHE GOOD:\nPeople - A pro and a con, we will get to that later. I have made some of my dearest friends and amazing mentors working there. Everyone is around the same age, has similar goals as you, and for the most part your peers encourage you to succeed.\n\nOffice- The office is beautiful and filled with snacks, beer and games. There's a barista there all day everyday and a great facilities team that keeps the office shiny.\n\nEvents - Again, pro and con. Drag queen lunch, happy hours, team outings, you name it. There were a ton of fun events that I know people who were not from the NYC area really benefited from since they got to meet new people and explore cool new spots around the city.\n\nTraining - Yelp offers a 2 month, extremely intensive training program that teaches you the ins and outs of sales. You learn to become a better communicator, have thicker skin, and set goals.", "You can make a lot of money with the right accounts and good timing", "Great sales script. Amazing, smart managers. Great culture and recruiters really find great people to fill training classes.", "Lots of opportunity for growth as a professional. From learning how to sell, how to present to a floor, how to self diagnose, how to handle stress, etc., you have access to trainings and opportunities that can greatly impact your career.\nYou always have access to someone when you are struggling (your manager, a top performing rep, your director, other managers, etc).\nWhen it comes to growth opportunities, there is management, different parts of the organization (National, Local Client Partner). You can also stay put and have the opportunity to make uncapped commission."], "Cresco": ["OUTSTANDING work environment. From the company comping lunch daily to being able to wear jeans everyday this place just gets better and better. Ask any employee from veteran to just hired and everyone says the same...BEST PLACE EVER! Industry is booming and this is THE place to be!"], "Allied": ["-Senior Advisors know their stuff and are willing to help you build your practice\n-Your practice is your own practice; you can build it however you wish with the clients you want and the business model that works for you\n-Ongoing training to help you keep up to date with markets, regulations, laws, and products.\n-Good comp compared to other companies\n-Plenty of room for growth\n-Entrepreneurial role", "Choice of products to sell to your clients including access to insurance providers and mutual funds.", "Great people and culture very inclusive.", "Open Architecture for product usage. Decent freedom to make your schedule.", "Great training, awesome management, a great place to bring a book of business. Good place for those wishing to enter into finance. Great pay out percentage"], "Centura": ["I like working at the hospital.", "Employee wellness program, great culture, good benefits package with discounts for good health", "Big organization. Growth and change opportunity", "-Management has been down-to-earth. I have never felt like I was being talked down to.\n-Good pay and benefits are decent.", "Allowed to do job with minimum supervision"], "credible": ["The environment, company, people, food, events", "Good to employees . Free meals on Thursdays.", "Catered lunch\nGreat people\nAwesome office parties\nRecognition for hard workers\nValue their employees\nRoom for advancement", "Free catered lunch\nFree snacks\nClose to bart\nSome great people", "- Helpful and amazing co-workers.\n- Flexible work schedule\n- Get to work on individual modules"], "opendoor": ["Incredibly smart AND kind people\nGood Size\nInteresting Work\nLots of funding\nNot corporate\nAllows for flexible lifestyle", "Very smart, driven and fun team. While work hours can sometime be a little long, the incredible talent of your coworkers and their dedication makes up for it.", "Marketplace employees are smart, hard-working and friendly. Company concept is great on the surface.", "love working here and all the people", "- Good work life balance, most people work < 8 hours a day\n- Unlimited vacation that gets borderline abused\n- Work by yourself on a project and deliver it in isolation (this is a con as well)\n- Good food, decent benefits\n- Good top level exec leaders\n- People are generally inoffensive"], "Argonne": ["Great overall experience at lab", "Argonne has wonderful benefits. I am proud to work here because of all of the important research they do which benefits the environment, etc.", "Great benefits, passionate colleagues, interesting work environment", "Professional. Decent pay compared to university.", "Some of the best science in the world takes place here; world-class facilities. People generally good minded and focused. Great global recognition."], "curology": ["Honestly by far the best company I've ever worked for and I can't see myself working anywhere else. The company has a great collaborative atmosphere, awesome perks and benefits that you can't get in most companies.", "I see myself at Curology long-term! I feel like my work is valued and I have a personal opportunity to grow my skills, experience and leadership at this organization. Our company culture is awesome and teamwork is really emphasized! I love our team events!", "Company makes an effort to show they care. Great benefits offered, flexibility and catered lunch daily.", "Flexibility, lunch every day, team events, good pay, benefits, and a team that genuinely cares about you! What more could you ask for?", "Innovative environment where you can thrive, learn and be creative"], "Artifact": ["Normally I don't post these things after reading some of the recent poor reviews felt like I had to respond.\n\nThere's a new management team and they are doing things differently than the old management team. That's OK.\n\nThe company is focused on growing what is already a good business into a great business. Growth creates opportunities, and while things are different than when I first started, I have confidence that management will get it right, even if it takes a few tries.", "If you’re junior in your career and looking for a stepping stone to learn than AU maybe a good place for you. If you are more senior, you will get bored quickly.", "- The individual contributors through the company are talented, hardworking and overall great people\n- The benefits are excellent (medical / dental insurance 95% premiums, 401k match, team bonding events, product discounts, etc.)\n- Lots of exciting work to do\n- Office perks - drinks, snacks, occasional lunches\n- Delivering meaningful product to the world is very rewarding", "-Strong camaraderie within the team and fun, supportive peers\n-Committed, humble employees who execute quickly and are open to new ideas\n-High- quality product that stands out in a commoditized market\n-A lot of potential to grow the business through low-hanging fruit\n-Good benefits and some nice perks (team ski day, retreats, employee discount, 401k match\n-Fast-paced environment so you're never bored", "You’ll meet some cool people doing good work. Unfortunately, those people aren’t on the leadership team and are likely on their way out. The original founders and the impact they left behind is inspiring."], "ridecell": ["The people and culture are superb, the tech is fun, generally a great place to work with a few issues.", "- Product is interesting, meaningful and has a ton of potential\n- Industry is exciting, growing rapidly, global and relevant\n- People are all talented, genuine and hard working\n- Perks are generous and competitive", "Ridecell has some very interesting opportunities. They have fingers in the ridesharing, carsharing and autonomous vehicle pies, so there's a lot of potential long term to work on some interesting problems.\n\nGenerally speaking they have a culture that is the right mix of playful and business minded. I like my co-workers for the most part. And it is easy to not see the problems in the organization as a result.\n\nThe company used to be better at encouraging collaboration but mismanagement has destroyed that aspect of the culture.", "Great place to work for", "Employee happiness is of paramount importance in this company. Being a fast paced startup in the cut-throat mobility industry , it's easy to ignore the aspirations of each employee but the CEO and the executive team inculcated a culture of putting employee happiness as a top priority for every manager.\n\nThe company's biggest strength is their founding team who stood intact through the ups and downs since the beginning of the new age mobility industry (since the birth of Uber, Lyft) and are now on the path of being the pioneers in the mobility industry.\n\nThe company has a rich engineering diversity that includes full stack developers, design teams, hardware engineers and the new Autonomous Driving Division. This gives a great amount of exposure and learning resources for any new employee.\nThe company is on a high growth curve right now , every team is growing exponentially. So if you want to accelerate your career and learn on the go, this is a right time to be in this place."], "Palantir": ["Enjoy the people and the problem solving.", "- Three meals provided each day, either catered or prepared on-site.\n- Endless opportunities to travel on behalf of the business.", "I learned how to code on the internet about 2 weeks before they hired me, and was still able to have a great experience! I was surrounded by people of similar experience levels so we were all able to learn together.", "I love working here. You are surrounded by incredible, driven people who share your values and are working towards improving the world. I haven't been in an environment this exciting since I went to college. Benefits are amazing too.", "Smart people who care about the mission"], "Syapse": ["> Exciting vision to help people fighting cancer while building the world's leading precision medicine data company\n\n> New senior leadership that is dedicated to strategic growth and supporting engaged employees\n\n> Innovative partnerships in the US and Asia with life science companies and health systems\n\n> Really smart mission-driven people all over the company\n\n> A spacious new headquarters in SF with lots of in-office perks like an outside deck, free lunch 3x week and lots of great snacks!\n\n> Solid benefits, competitive pay", "- Location\n- Location\n- Location\n- Fighting cancer\n- Team leads are generally nice", "• Syapse is headed in a great direction has a lot of positive momentum with recent deals\n• The mission and values are cemented in the company and all the work we do is tied back to it\n• We just moved into a new office and HR has been doing an incredible job transforming the workplace: more catered food, more social events, and more resources for self-development", "> Above market pay\n> LUNCH is free!\n> Management is great. Multiple layers.\n> Easy to refer your friends.\n> After 2.5 years, you get 10% refresher over 4 years. Good way to earn more options.", "NONE.. you read it right 'ZERO'."], "sojern": ["Such a positive and rewarding place to work. Management really cares about company and employees and it shows! Can’t say enough great things about this company!", "Doesn't get any better than this! Incredibly smart and transparent leadership team, solid products and solutions, solving very interesting industry problems alongside smart and driven people. One of the best company cultures you can imagine. Everyone is so nice, success is celebrated in a big way, and employees live the core values. Excellent perks and travel industry benefits. Tons of opportunities to learn and grow.", "-Lots of runway in dynamic space\n-Seasoned Leadership team that wants to win and cares about employees\n-CEO and his team are very approachable and willing to help or answer questions\n-Profitable and strong growth trajectory\n-Great location for SF office", "Incredible growth opportunities, forward thinkers, inspiring leadership, great culture, a company that teaches you something new everyday.", "Everyone is super sweet and friendly."], "asurion": ["They have many activities or groups you can participate in", "Real opportunity for career advancement\nManagement actually listens to employees", "Benefits, environment, volunteer opportunities, and training", "Shifts. Pay. Location. People. Overall experience.", "Great opportunities to introduce new technologies to the company\nLots of training opportunities and I can attend at least one major conference per year which has been very beneficial\nOpportunities to code in multiple languages\nChallenging business problems to solve which often need solutions leveraging newer industry technologies\nFlexible work schedule\nTalented coworkers\nWork is in Nashville which is big pro for me\nCompany has to support locations across the globe, and I have enjoyed working with people of other nations\nSolutions needed for multiple platforms and cloud providers\nCompany has opportunities in a lot of areas\nGood pay and stock options, but not very clear on when stocks are granted."], "uber": ["Really, really smart people to work with.", "Experienced employees, collaborative teams, mission-driven, welcoming", "You can affect change on a high scale\nYou get to be yourself\nYou want to brag about what you do\nAmbiguity\nGrowth Potential", "Benefits. Professional Development. Flexibility. Culture.", "Very collaborative teams\nManagers that listen\nMany tools available to us\nReasonable KPIs\nHiring Managers really want to partner with Recruiting"], "bolt": ["Opportunity to grow\nYoung management\nsmall teams, lot of learning", "- Personal and professional growth\n- Great leadership style\n- Strong company values and culture\n- Mission you can easily get behind\n- Flat structure\n- Everyone is heard and valued, anyone can contribute to decisions being made and anyone can challenge anyone (with good reason)\n-High level of responsibility on all positions", "The industry and the problem they are solving is very interesting and the markets are challenging.\n\nThe tools used are good and modern and the equipment is new and good\n\nCool office and company events\n\nYou have awesome young people around you", "Flexibility on schedule. Goal oriented management. Huge international exposure and on-hands immediate impact.", "Work benefits, great local teams, overall start up culture"], "Glu": ["- Great team: the team I work on is like a family in many respects - team members genuinely care about each other and look out for each other, and legitimately enjoy spending time together at the office and at team events\n- Work/life balance: unlike some other places I've worked at, Glu does a good job of limiting overtime, getting people out of the office at a reasonable hour, and accommodating folks with families\n- Generous benefits: from my own experience and from other coworkers I've spoken with, compensation is typically market-competitive to above-market, with a wide range of additional benefits like free lunches and snacks, 401(k) matching, and annual performance bonuses", "There were sometimes good snacks and some fun people to work with.", "Catered lunch, free snacks and drinks, company parties, decent corporate structure for benefits, PTO/vacation, etc.", "Catered lunch, cultural aspect has been improved tremendously over the past 2 years", "Collaborative and fun work environment\nGreat co workers\nFlexibility to work on cool projects"], "Cerium": ["good benefits and great company to work for", "Best Sales engineers in the business", "If you do your job they leave you alone", "The people you work directly with are wonderful. There is a wealth of knowledge inside the organization.", "Some good people, but doesn't help the destruction of everything else."], "Experian": ["The people I work with are all wonderful. Benefits include FTO, 401K, Health, Dental, Vision, along with Perks and Work and other perk programs. We regularly celebrate different cultures. Yoga classes are offered. Flexibility with working from home. This is the best job I have ever had.", "Good company, great benefits", "- Competitive benefits\n- Collaborative environment and engaged leadership team\n- Interesting work and talented colleagues\n- Fast paced and entrepreneurial but large, stable org", "Great team/co-workers\nGreat products that solve customer problems\nGood for short term professional growth", "Great benefits and compensation. Managers who care."], "samasource": ["-the best coworkers: intelligent, mission-driven, all around wonderful humans\n-incredible leadership who take a personal interest in your well-being\n-effective and impactful model: Samasource is changing lives in a sustainable way\n-org wide commitment to excellence, transparency, and innovation\n-approach to international development is built on respect and empowerment\n-autonomy and creative freedom in your role\n-flexibility to work from home\n-paid a living wage (which is saying a lot for a nonprofit in SF)", "Supportive Culture and AMAZING people.", "-great colleagues and work environment", "As somebody who has been at Sama for many years, I can say quite sincerely that the org, the leadership and culture has evolved substantially in my time here, and that I feel very happy and fortunate to be here. I'm also looking forward to being part of Samasource's future as a leader in the world of social impact, as well as a provider of high quality services in the world of tech and machine learning in … \n\n\n\nShow More", "I thoroughly enjoyed everyone I worked with. My co-workers were smart, dedicated, and fun to be around. I feel the organization is making a meaningful impact in the world. Management actively seeks out feedback from employees and works to improve areas that are challenging for employees."], "Stride": ["The company has a budget for engineers' professional development so for example somebody can work on an open source project and get paid for it. So this was a huge deal for me.", "- Most people are genuine, smart, and helpful.\n- There is not a lot of pressure put on you by management to work overtime, good \"work-life balance.\"\n- There is a decent amount of transparency from leadership.\n- If you are a software developer, there is a lot of room to learn and grow - Stride prepares you to be VERY marketable when you decide to look for a new job.", "- Incredibly inspiring CEO\n- Lots of learning\n- Awesome people\n- Variety of projects\n- Democratic decision making\n- Zero tolerance harassment policy (safe space to work!)", "* Exposure to different code bases, business problems, clients, and work environments.\n* Supportive community of developers.\n* Supportive and encouraging management.\n* Learning.", "Great communicative company leadership that genuinely cares about its employees and understands that our success is their success.\n\nGreat pay, and leadership that trusts you to manage your own schedule.\n\nEver improving portfolio of great clients.\n\nLots of room for growth and career advancement.\n\nSuper interesting and emptheic co-workers with diverse skills and backgrounds.\n\nAll clients are in NYC and you don’t have to travel."], "Inspire": ["Flexible scheduling and preferences taken into consideration. Quick training and hiring process. Timely payments and good compensation, ability to work with other capable carers.", "Co-workers are friendly, I love how they throw meetings every 4 months where there is great food and awesome giveaways. Bonuses are given when criteria is met during reviews every 4 months."], "Applecart": ["Everybody here is smart and friendly. Applecart is a young and energetic company.", "The single best thing at Applecart is the people, cheesy as that sounds. People are incredibly smart, really driven about what they do, and are very supportive. The tech work is interesting and definitely challenging. The mission on the political end is also very rewarding.", "- Given the size and growth of the company, you're given a high degree of ownership and autonomy.\n- The political side of the company provides a strong sense of mission and accomplishment that is not present in most adtech companies.\n- The work environment and culture is top notch. Everyone is friendly, hard-working and helpful.", "Echoing previous reviews: a lot of very brilliant people working on open-ended problems. The company is growing rapidly but hasn't lost the feeling of being a united team. I've never felt like I was stagnating in terms of professional or personal growth, and because of the rapid growth, there's a ton of room for owning and leading different projects that really matter.", "1. Amazing company culture. Everyone is intelligent, innovative, and will help you whenever they can.\n\n2. Company pays for outings such as baseball games, parties, and celebrations.\n\n3. The intern program is structured and projects are constant.\n\n4. Team leaders and founders are superb."], "Remote-Learner": ["Small company. Good culture and people. A lot of technologies to learn. Support from executive to help master said technologies (LAMP, Web Dev, MOODLE, etc.).", "A company that is being forced to change direction because of prior bad decisions and a lacking product. RL's future vision is great. Company does give back to the community and charity.", "Small company with friendly and hardworking coworkers. Creativity is somewhat valued as is loyalty to some degree.", "Flexibility with work schedule", "You can work from home."], "plenty": ["Staff sale on clothes 50% on their house brand and 30% on branded (champion, stussy, obey)", "Great discount\nNo hourly quota", "Non stressful environment\nEasy communication\nNice people", "Great team\nGood discount\nReachable sales goals", "- really good work environment\n- good benefits/discount\n- flexible schedule\n- understanding manangement"], "Crawford": ["Long-established company that specializes in helping marketers --- LOVE THAT!\nWONDERFUL co-workers, everyone is focused on helping each other and doing great things together.\nGreat vibe in the office, stress-free environment.\nFlexible with awesome work/life balance.\nManagement is supportive and the company is growing.", "Contacted me regarding consulting assignment", "The Crawford team provides solid support while you work under their umbrella.", "Good opportunities. Nice recruiters. Good support during project. Pleasant account director.", "$10.00 Prescriptions\nLow employee cost\nEasy access to benefits and your policy and coverage online\nBig choice in options\nEasy to reach when you have questions\nVery Knowledgeable Management when asking about benefits (pre and post hire)-Very important to me.\nCan tell Crawford Group really cares about it's employees and their health and well being\nGoes above and beyond to help you chose what is best fit for you and your needs"], "palantir": ["Enjoy the people and the problem solving.", "I learned how to code on the internet about 2 weeks before they hired me, and was still able to have a great experience! I was surrounded by people of similar experience levels so we were all able to learn together.", "I love working here. You are surrounded by incredible, driven people who share your values and are working towards improving the world. I haven't been in an environment this exciting since I went to college. Benefits are amazing too.", "Smart people who care about the mission", "many dynamic colleagues and great perks"], "facebook": ["It's an energetic and open company.", "- Incredible benefits\n- Excellent compensation that rewards strong performance\n- Lots of autonomy\n- Tons of room for growth\n- Very transparent from the top down\n- Strong leadership\n- Intelligent and caring colleagues\n- The most fair and well thought out review process you will find everywhere\n- Exciting work", "I'm a 55 year old working in a company where the average age is 28, and I've never been happier. I have always wanted to work in a company where I wasn't the proverbial square peg, and after nearly 30 years in the work force, I believe that I have found the company that complements my ideology for how a company should operate. Here are the \"Pros\" as I see them...\n\n- Leadership: Mark Zuckerberg, Sheryl Sandberg, Chris Cox and the rest of the leadership team. Inspiring, smart and totally real.\n- The Culture: The openness is a real thing, we're trusted to do the right thing, mistakes are expected, being yourself is important and encouraged, humility is encouraged and expected, building trust is paramount, the mission of making the world a more open and connected place isn't just a cool phrase because it guides everything. It's not about us, it's about everyone else.\n- The People: Smart and nice is what I find. The diversity is better than any other company I've worked at and it's getting better. Those that are figuring out how to make what we do better for everyone are really good at implementing their ideas. Two years ago I didn't know what this company really was or if it had a secure future. I can clearly see now that they have what it takes to last, and it's sincere.\n- Management: Managers are hired because they're good managers and not because they're good at something else. The management track is different than the contributor track and they're equal in importance.\n- Benefits: Working in the Valley it's hard to differentiate all the benefits employees receive and Facebook is at least equal to all the major tech companies, but coming from Seattle the benefits are nothing short of incredible.\n\nGranted, I haven't been with the company for very long and I'm still in the honeymoon period, but I can tell what's real and what's not; this place is for real.", "Creative, enthusiastic, efficient, appreciative, inventive", "I love meeting new people. Making new friends and I love spending time on the internet.."], "kiva": ["exactly what you need from an internship", "Staff and interns, especially long timers, are passionate, supportive and kind.\nImpactful organization that has done well and has new, exciting initiatives.\nVery strong internship and fellowship program.", "Amazing place to work at!", "Kiva is an amazing organization with a great mission and vision; not to mention its impact.\nHigh calibre of talented colleagues all over the world\nGreat location and office", "Great people who are talented, humble and hard-working; opportunities to contribute and grow in a lot of different ways; exciting new projects for the org; and a good benefits package."], "Octo": ["Forward-thinking, Agile, Supportive, Astute Technologists", "Fun culture, I believe the CEO does care for the overall well-being of the employees. A lot of perks, food, fun, travel with lots of wins and potential for success.", "Salary is good. Benefits are average.", "Decent benefits\nDecent pay\nGood at winning new work", "Friendly environment, fast growing organization"], "adobe": ["Experienced management and engineering team, good for junior engineers to learn and grow.\n\nCompany encourages you to learn and grow by providing learning funds and online courses\n\nNo drama from what I've experienced", "Jake Reni is the best leader I've ever worked with. It's fun to come to work every day when you work for someone like him.", "Great work environment, good people and supportive community.", "Great work life balance at Adobe", "-Food is good\n- Gym is good\n-Life balance can be good and flexible especially for managers. I have seen people take 2 months off a year"], "comscore": ["many opportunities to learn, organized, friendly environment", "Data Analysis, Problem-solving, high-level SQL Queries, Report generation, work at home.", "it has a great balance for work and life, no push to work. enjoy your life", "Some of the smartest and brightest talent out there", "unlimited PTO. just a bunch of time to kill"], "Hi": ["Best team to work with!\nProduct constantly updated and feels like the company is in the right direction"], "affirm": ["Mission oriented team, fun colleagues and great perks.", "Exciting growth and learning environment", "Smart, passionate and caring teams. Talented and mission-driven", "Everyone is passionate about the mission and excited to go to work!", "The company has experienced a lot of growth which has allowed for getting to work on very interesting projects with many users."], "synack": ["First off... The culture is 2nd to none! Nice people, friendly and willing to invest time ensuring your success.\n\nGreat Compensation - Great perks - happy hour, catered food.\n\nFlexible schedule - \"do what helps you be the most productive\" type of attitude is what you'll see and hear.\n\nWork Culture- Hard work and commitment is highly appreciated and rewarded.\n\nManagement- Great leaders who not only focus on the company and it's customers, but value their employees most! Something not typically found at companies in Silicon Valley.\n\nPeers- No politics, fair people, always ready to help.", "Flexible hours, great perks, overall very positive attitude towards the future of the company", "Great company culture. Everyone is a pleasure to be around", "-Everyone in the company (regardless of department) is easy to get in contact with and have a conversation with. Whether it is work-related or not.\n-Great leadership team to help with any aspect of your work.", "People are friendly and everyone knows everyone.\nThere seems to be a genuine belief in the company/product across the company.\nFlexibility with hours and work from home.\nExecutive team is open to having conversations.\nFree lunch everyday."], "Intrepid": ["Good leadership, good products, good work environment", "Free snacks, drinks from vending machine, Ramen bar, milk, cereal, fruits, etc. At Intrepid there are great benefits and work-life balance. Family feel for a medium-sized company. Intrepid provides unique events, such as meetups, kids camp, LAN parties, monthly birthday celebrations (boxes of donuts, yum!), etc. Internal training is provided to help employees and customers to understand our product line. Overall, Intrepid has a great working environment, friendly coworkers, and free snacks and drink.", "Relaxed work environment, friendly employees, awesome benefits and perks!", "Flexible hours, good training, exciting projects, lunches ordered", "Intrepid is a great company with great people and they really know how to make you feel like family. It is a great opportunity for the curious and there are many training sessions that employees can attend."], "asana": ["-Unified and welcoming culture, always have team building events going on and not cliquey at all!\n- Executive coaching offered to employees 6x/ year is awesome, love that they invest in not only executives but ALL employees\n- Breakfast/lunch/ dinner and all gourmet cooked by in-house Asana employees (not catered) is AMAZING, always something new, all of it cooked fresh and feels super healthy.\n- Management that is very much open to feedback and suggestions to make us all more effective.\n- Dog friendly offices I thought would be so distracting but they're actually so great and well-behaved and its nice to see a cute friendly face throughout the day\n- A sales team thats not only hitting but exceeding their quotas!! And leaders that want to keep that up.", "• The mission is legit and most people do care about helping other teams thrive/succeed by using the product.\n• Higher management is full of smart & experienced people. Lots to learn from if you try hard enough to learn from it.\n• Software is internally used to manage your daily workload (and it works!)\n• Your teammates are generally fun\n• Lots of opportunities to grow your skill-set if you're in Ops", "Almost everyone seemed genuinely happy at the company. People worked, took time to relax both at work and at home. Company parties were great.", "No micro-management and an abundant amount of opportunity for those willing to go the extra mile. Leadership will listen (even if it takes a while to get time on their calendar) and treats employee ideas with thoughtful consideration and reflection. The ability to create your own path is available for anyone that's ambitious and driven.\n\nCulture is good, food is the unimaginably delicious, and your co-workers are happy and positive. Great vibes when entering the building.", "One of the most thoughtful, intentional groups of people you'll find anywhere. Dustin Moskovitz is the best CEO in Silicon Valley – smart, dedicated, and also (shockingly) humble."], "google": ["Great culture and nice co worker", "1) Food, food, food. 15+ cafes on main campus (MTV) alone. Mini-kitchens, snacks, drinks, free breakfast/lunch/dinner, all day, errr'day.\n\n2) Benefits/perks. Free 24:7 gym access (on MTV campus). Free (self service) laundry (washer/dryer) available. Bowling alley. Volley ball pit. Custom-built and exclusive employee use only outdoor sport park (MTV). Free health/fitness assessments. Dog-friendly. Etc. etc. etc.\n\n3) Compensation. In ~2010 or 2011, Google updated its compensation packages so that they were more competitive.\n\n4) For the size of the organization (30K+), it has remained relatively innovative, nimble, and fast-paced and open with communication but, that is definitely changing (for the worse).\n\n5) With so many departments, focus areas, and products, *in theory*, you should have plenty of opportunity to grow your career (horizontally or vertically). In practice, not true.\n\n6) You get to work with some of the brightest, most innovative and hard-working/diligent minds in the industry. There's a \"con\" to that, too (see below).", "* If you're a software engineer, you're among the kings of the hill at Google. It's an engineer-driven company without a doubt (that *is* changing, but it's still very engineer-focused).\n* The perks are amazing. Yes, free breakfast, lunch, an dinner every weekday. Aaaaaamazing holiday parties (at Waldorf Astoria, NY Public Library, MoMA, etc.); overnight ski trips to Vermont; overnight nature trips to the Poconos in the summer; summer picnics at Chelsea piers; and on and on and on. I don't see this going away unless the company starts hurting financially.\n* Speaking of which, the company is doing quite well, which reflects in bonuses and equity grants.\n* There a huge diversity of work ranging from defending independent journalism worldwide (Google Project Shield) to crisis response during disasters (see Maps during Hurricane Sandy or Tsunamis), to the best machine learning experts and projects in the world, to more mundane revenue-driving projects in advertising, there's really something for everybody.\n* It's easy to move around within the company as long as you're in good standing (the vast majority of engineers are).\n* The company is amazingly open: every week Larry Page and Sergey Brin host what's called TGIF where food, beer, wine, etc. is served, a new project is presented, and afterward there's an open forum to ask the executives anything you want. It's truly fair game to ask anything, no matter how controversial, and frequently the executives will be responsive.\n* No, nobody cares if you use an iPhone, Facebook, shop with Amazon, stream using Spotify, or refuse to use Google+. The company is amazingly open and flexible.\n\nNeither pro nor con, but general information on work-life balance, promotions, and advancement.\n* Work life balance can be what you want it to be on most teams. (Some teams are in more competitive sectors and require more crazy hours all the time - but very few of them). If you do what's expected, you'll be fine at least for a handful of years. Working a roughly 40 hour work week is possible, and many people do it. There are also people who are hyper-motived and work like crazy just because they love it, or because they're competitive, or they want to get a promotion. If you work 40 hour weeks without putting in anything extra, you'll fall behind them as they advance and you stand still - and maybe that doesn't matter, so it works out for everybody. But at least know where you would realistically stand.\n* If you excel and work your butt off, you'll be compensated and promoted. If you let yourself be a code monkey, and just sit coding with your head down all day, you'll be fine but won't advance. A big complaint from some Googlers is about not being able to advance \"even at Google\" with pure coding. Sure, if you're the uber genius who created MapReduce and Bigtable, you're going to advance like a rocket without having to do anything but coding; but if you're like most engineers at Google -- smarter than average, but just average compared to other Googlers -- you're just a good coder and not revolutionary. Code monkeys are important to actually get stuff done, and to be sure you absolutely need to be a good coder as a software engineer (it's the minimum requirement), but code monkeys won't advance because they're not leaders and they're easy to replace. To get promoted you need to lead and do more than just code. There are plenty of ways to lead other than being an official tech lead, so this isn't actually _that_ hard, so the real point is just that you can't just sit there coding what other people tell you to code all day and expect to advance.", "You can't find a more well-regarded company that actually deserves the hype it gets.\n\nYou'll work on cutting edge projects / solve important issues that impact your community and the world\n\nYou'll meet interesting people who are your colleagues, managers, and senior management.\n\nYou'll open the paper and see your company in the news almost every day, and read about projects you're working on, which is a cool thing\n\nYou'll see Larry and Sergey at TGIF and you'll admire how they lead the company. They are brilliant, goofy, low key but intense, and likeable.\n\nThere are 22 cafes (more or less), the food is excellent, and it's free.\n\nYour pay will typically be competitive, though it needs to be tweaked up a bit since the economy has improved.\n\nGoogle cares about how it treats its employees.\n\nThe campus is like an academic campus in many ways.\n\nThere are tons of activities on campus, like authors speaking about their books, films after work, and gyms where you can work out - but you'll need to make sure to carve out time to do these things.\n\nYou'll get plenty of external validation from people who suddenly think you're smart and rich because you work there, even if you're not rich and you're as smart when you didn't work at Google.\n\nIf and when you leave, you'll never regret having that company on your resume. It opens doors.\n\nThe company is flexible - if you're lucky, you won't have a micromanager boss and you can be somewhat flexible in how you work - but don't get me wrong - you'll work a LOT. But you don't have to do all of it chained to your desk.", "Great benefits.\nMostly great managers.\nTalented coworkers.\nGood culture that tries to make things better, with leaders that take action to try to make things better."], "The": ["Great Place to jump start your career if you are young! Great mission, awesome co-workers, everyone is nice and a team player. If you do a good job you will be able to advance and they will appreciate your job and make sure you stay ! You get to do a lot of things and learn how to wear different hats. They like to promote people within the organization instead of hiring from the outside. Amazing work life balance which helps with the non-profit salary. New CEO is on his way in and will definitely improve the organization. It's an exciting time to join TWC,", "Wonderful people work at TWC! Everyone at TWC is passionate about the work and works hard to make it happen for the students.", "As an alum mentor you work to help internationally students develop while in the process developing yourself and discovering new skills and talents.\nTeam and staff was very supportive and helpful. You can definitely count on them.", "-Excellent benefits (health insurance has no deductible, stipend given for wmata, etc)\n-Friendly work culture", "You work with great people from all backgrounds. If you take initiative, you can can take charge of your own projects. You have countless opportunities to make a really positive impact on the lives of college students. The networking opportunities are amazing! I really grew and enjoyed my time working at TWC."], "Oktana": ["Talented developers and UI/UX designers.", "Good pay\nThe people who don’t run the company are great.", "This company not have any pro's", "- Decent pay, due to contractor status. No employee benefits or security.\n- Lots of great people to work with and learn from, not the higher ups.", "Salaries and equipment is very good. Flexible hours. Lots of projects. Opportunities to grow to different positions."], "cloudflare": ["Cloudflare hires intelligent employees who are nice and enjoy their work. It's a great place to work because everyone is invested in the mission to help create a better internet and is willing to help out with problems across the company.", "Lots of opportunities to make your own journey and a lot to learn. The company is very fast paced and I haven't been bored once since I joined. All colleagues are very smart and driven. Internet security & performance is also a very important and interesting topic.", "If you like being part of building things from scratch, taking ownership of projects yourself, helping build structure and sustainability for the long-term, this is a great place to work.\nIf you want to be challenged to learn about how the Internet really works, at one of the few places where everyone really needs to learn how the internet works, this is the place to be.\nIf you like working with people who really care, and are building an enduring company, but are not ruthless or arrogant, you will fit in here.", "While going through the recruitment process, I was concerned by a few of the postings I read on Glassdoor, specifically about the CEO, and how he engages with employees. I reached out to a good friend who works at Cloudflare, and they took the time to go through the negative reviews and share their perspective with me. That conversation helped alleviate some concerns, still, I feared that after joining things might take a turn for the worse.\n\nMy concerns went away my first week during orientation. Upon hearing the CEO speak to our onboarding cohort it became evident he's a passionate, intelligent, caring, and thoughtful leader. Throughout the week it also became clear that Cloudflare is full of equally passionate, intelligent, caring, and thoughtful individuals.\n\nEvery day I come into the office, excited for the work I'm doing, and for the people I have the privilege of doing it with. I have regular experiences (daily) which validate my decision to work here. Cloudflare is AMAZING and the people who work here are genuinely good human beings — intelligent, capable, and inspiring — and a delight to work with. I couldn't be happier!", "Great Company culture, nice office, great people to work with, very good product."], "Mattersight": ["Kind and knowledgeable co-workers, employee engagement events, free beer and snacks, fun games!", "The concept of behavioral routing was very sexy and opened all sorts of doors at prospective companies. Great office location in Chicago. Lots of super smart people.", "Intelligent peers, a lot of team building but navigating channels within company is difficult.", "Opportunity to learn lots of new technologies", "Smart, smart people\nBeautiful office (Chicago)\nSocial culture\nLots of cool data"], "upstart": ["Definitely the people! Smart folks who remain humble and down to earth. Lots of challenges which means lots of opportunities to grow for the sort of person who is willing to face them head on.", "1. people - everyone is intelligent yet humble at the same time. Engineering, product, and data science teams have good sense of camaraderie\n2. business - growing rapidly! Path to IPO is much more apparent than in most startups as executive team puts an emphasis on growing the business economically/sensibly over wasteful endeavors\n3. mission - ultimately aiming to create a fairer system with respect to who can access credit and at what price.", "young, engaged people. flexible with shifts and time-off requests. Occasionally catered food", "Professional development is definitely a plus", "Company Culture:\n- Lower managers and the people here are fun to work with and genuinely good people.\n- Lots of banter on the office floor which keeps shifts fun.\n- The environment is relaxed, you can wear casual clothes\n- Hours and schedule are flexible.\n\nTechnical Info:\nShifts are: 6 - 2:30, 11:30 - 8 for credit analyst. You may have to work a weekend day.\n- There is a lot of contract workers. As a contractor, you will make $18 - 22 an hour. Once converted you will start at $23. The length of time it takes to get converted and the amount of work it takes to get converted will vary."], "zymergen": ["Fully stocked pantry\nGreat work-life balance\nUnlimited PTO\nPeople like to share their knowledge", "I enjoy working here because it expands on the skills I've learned at my previous job. The work life balance is great and the people you work with are inspiring.", "Good environment with friendly people. Free food", "Great goals. Great tech. Great people.", "I have a pretty sweet job. I am in software.\n\nVery competitive pay, friendly team with competent managers, flexible time/some WFH allowed, pretty good at sticking to 40hr work weeks, reasonable work loads, dedicated hours to work without meetings or interruptions."], "Kaplan": ["Great people; flexible; merit based pay resulted in a 120% raise in one year.", "Very professional management team and training program", "Awesome pay.\nRemote/ Online\nGood communication", "No real hands-on interaction with superiors, so you have control over much of the work", "Enjoyed flexibility with hours and pay was good"], "Silicon": ["I got good opportunity to learn the technology in the depth."], "nuna": ["Terrific team, using scale data to make value-based care affordable for millions. Trusted by partners - insurers, state and fed leaders - and yes providers. A great place for engineers, data scientists, innovators to learn/contribute.", "- Genuinely mission-driven environment\n- Amazing people: smart, down-to-earth, accessible, and fun\n- Opportunities to learn and work cross-functionally\n- Very approachable, accessible leadership team\n- Generous benefits, especially for being a start-up\n- Family-friendly environment\n- We have an investor who is very involved and hands-on\n- Exciting milestones and growth seen every year", "The thing that convinced me to join Nuna in the first place was the people that work there. Nuna has a great mission to fix the US healthcare system which attracts the right kind of people: talented, genuine and mission-driven people.", "This is a truly amazing company, I have interviewed at several companies in healthcare from EHRs to mental health platforms. What I have seen is that the EHR companies in the Bay Area are full of hype, their product is buggy and lacking features and they have extremely low penetration in the market and lack of actual innovation and thus sales heavy. Nuna is truly revolutionzing healthcare and is well funded.", "Nuna is a mission-driven company trying to make the US healthcare space a better place through data analytics that benefit the actual patients receiving healthcare, not just the employer, payer or provider. Knowing this makes it very easy to get out of bed in the morning. Employees and management are caring and good listeners. There is an emphasis on being sensitive to each others' needs and to constructive problem solving and open communication. Certain new products have the possibility of being truly disruptive and profitable in the marketplace."], "khoros": ["Overall, I think Khoros has a great future ahead of it. It's not the right place for everyone, so I would suggest anyone looking to join ask questions in the interviews to make sure you think it's a good fit for you.\n\n* Amazing opportunities for all levels of the organization to grow in their career\n* A lot of learning and options to expand your knowledge of how businesses work\n* Decent benefits (including 4 / week lunch, access to gym, collaborative spaces, etc)\n* Vision for what the company can be is phenomenal", "Great company with lots of perks", "Work life balance. Competitive pay. Great leadership.", "- Downtown office with parking.\n- Some of the people who work there are creative, collaborative, and smart.\n- Amazing SXSW parties.\n- 100% covered health insurance.\n- Free lunch 4 days a week & snacks.", "USED to be an awesome culture and workplace.\nExecutive team had a vision"], "trifacta": ["I am impressed with the energy level at this company! Everyone is friendly and enthusiastic, and the company clearly has a winning product.\n\nThere is a culture of sharing product information internally through LunchNLearns, and an eagerness to listen to feedback.", "an innovative product that helps customers", "REALLY smart, engaged people.\nHighly collaborative teams, I talk to people on our teams all over the world every day\nEveryone is very engaged and moving in the same direction\nBest in class product", "Hardworking, incredibly smart teams who genuinely care about the product. Stellar benefits, competitive salaries, and encouragement for professional growth. Cutting edge technology that reaches into AI and beyond. Engaged management team that has a strong desire to see everyone succeed.", "CEO, strong engineering , interesting problem"], "Richmond": ["Worked for many years, big family", "Close to home.\nPlenty of staff parking.\nSmaller facility, comfortable atmosphere.\n1199SEIU benefits.", "Staff feels like family. New member, are welcome when they present.", "Co-Workers are very nice people.", "Nice environment to work in."], "Vertafore": ["Love my coworkers\nGood benefits\nFlexible schedule", "Job is fun, most people are cool", "The location downtown is decent.", "Pretty healthy work/life balance, great coworkers, collaborative environment, open to ideas, egos are in check, management (in my department) is very functional, nice facilities and location, decent benefits.", "Vertafore hires a lot of junior developers, so if nothing else it's a good place to get a foot in the door. Once you get 6 months to a year of experience, move on to a company that might actually care about your professional growth."], "Getty": ["The digital marketing team is very forward-thinking. A great team to be a part of.", "Great co-workers and free pop.", "Benefits\nWork life balance\nGreat colleagues\nClient relationships\nWith the right manager, you can be independent", "Global brand, good work/life balance, passionate people.", "Stimulating subject matter & industry."], "fitbit": ["wonderful people, amazing product, changing lives", "- great brand and product history\n- yummy snacks and cool office", "- Great work life balance\n- Opportunity to roll up your sleeves and get work done\n- Opportunity to work with some really nice and talented people\n- Mission-driven and people really care about it\n- Flexible WFH policy", "good compensation\ngood flexibility\ngood movement depending on your org", "Good people\nStill some talent left\nGood location"], "formation": ["--flat organizational structure\n--many smart people", "Working impressively as a team, even when there is conflict\nStaying focused on the most important deliverables\nFinding ways to include fun in with all the hard work -- it still is a startup", "- Amazing product that is proven to deliver significant to large organizations\n- Great teamwork and fun atmosphere\n- Nice office in the heart of SoMa\n- Solid benefits package", "Culture of camaraderie\nRedefining a new space with hyper personalized customer interaction technology\nWork Life Balance", "- Wonderful opportunity that was squandered\n- Many smart, dedicated people\n- Good pay and benefits\n- Centrally located in SF"], "averna": ["A rapidly growing business working as a strong cohesive team.\nDecisions are made quickly and efficiently.\nA balanced focus on business results and people.\nOpportunities to learn, grow, and work on a diverse set of applications.\nNearly everyone has the opportunity to work directly with the customer", "Most of the engineers are knowledgeable and well motivated\nGood variety of projects to work on\nFlexible time\nZero micro-management", "Friendly work environment with balanced working load.\nOpportunities to learn, grow, and work on a diverse set of applications.", "Huge diversity of projects...you will never become bored being stuck in the same old job doing the same thing over and over. Front-line employees are a great team of people to work with. Business model in flux, which creates opportunities for enterprising individuals.", "Great people-good collaboration among peers. Friendly atmosphere."], "webpass": ["- Great team/family atmosphere\n- very good compensation and benefits\n- Great product.", "Great co-workers. Great atmosphere. Benefits and Perks have improved.", "Peers are easy to work with and salary was good.", "You really can't find a better company to work for, especially in Miami. They truly care about every employee and in turn, everyone is happy to work their butts off to make Webpass the best. And the product? It speaks for itself!", "The benefits and the great future techno"], "Stanley": ["your schedule was always flexible", "Lots of Type A former GE and UTC leadership and employees bring in a culture of high expectations and long hours. If you like working with people who deliver with what they promise, this is a good place for you.", "Good people and decent pay", "Easy job, convenient location, good hours and lots of overtime", "Got some experience with SAP and Salesforce"], "sonder": ["- A lot of autonomy to build\n- Very collaborative teammates\n- Emphasis on culture and principles\n- Leadership is extremely transparent with company's financial standing\n- Very open lines of communication and set expectations\n- Better \"work-life harmony\" than other startups I've worked at", "Culture, Communication, Daily Challenges, Creativity, Diversity, Flexibility, and Opportunities.\nThis company has shown me what it's like to work somewhere that genuinely cares about your well being in every way. I'm constantly being pushed to challenge myself and broaden my overall experience in my professional and personal life; I've developed skills I didn't even know I had -or- could have.\n\nI would recommend this company to anyone that is interested in being part of a fast-paced, challenging, and creative team with a lot of opportunity for growth.", "From my first interview, I could tell how different Sonder is to other startups. The people are extremely intelligent and capable, yet down to earth as warm. Everyone is genuinely excited about what we are building. Teams are fired up about the massive growth Sonder is experiencing and there’s a humble sense of pride. The benefits are great and the culture is amazing. You get autonomy to do your thing but the leadership team is very responsive and supportive if you need them. I’m personally thrilled to contribute to scaling Sonder up. We are going to crush it in 2019!", "Sonder has accomplished a very difficult feat: it has scaled competence. Every engineer is extraordinarily capable. Individuals and sub-teams move autonomously in the same direction. At all levels, leadership is strong. I have a clear understanding of what is expected from all teams.\n\nI am not sure what to say about the strongly-worded negative reviews. My experience is limited to the engineering team, but I've never felt overlooked or overworked. As for the discussion of not vesting, I feel there should always be an understanding that vesting is not unlike an optional clause to extend a contract -- if you've proven your worth, you should never expect to be let go.\n\nAt the end of the day, we are helping travelers experience the world by redefining hospitality. It's a good gig.", "The excitement is growing as we continue to expand globally! We're winning a ton of Best Place to work awards because we love working at Sonder."], "honor": ["I worked for this company when it was just Indecare. Great staff! Very supportive. They will work with you with everything. Great job if you’re a college student: THEY WILL GIVE YOU HOURS!!!", "This has been by far one of the best companies I've ever worked for! It can be tough finding a start-up company in Austin that builds its foundation with compassion and the importance of culture. I feel incredibly grateful to have found Honor. There are so many tech start-ups in Austin but most of their products and services are for the millenial generation, which is great, but Honor is using technology to help the aging adult population receive the care they deserve. Every day I wake up, no matter how tired I may be, I am so excited to come to work because I know I have an incredible team of talented, kind, and empathetic individuals and the work we are doing has a direct impact on families and their loved ones. It's truly rewarding work and the company not only treats its clients with compassion but compassion is shown to everyone throughout the organization. There's never a time I have walked into work. no matter what office I was in, and wasn't greeted by someone with a warm smile. We are fed lunch every day that encompasses all dietary needs (gluten-free, vegetarian, and vegan), the organization is incredibly diverse, and there is so much opportunity for individual growth. I am happy to not only call honor my job but also my home.", "Team transparency is very high and work environment is highly collaborative. There is strong dedication to an iterative testing workplace focused on not getting too comfortable and constantly pushing the boundaries. The mission of the organization is wonderful and aims at a higher purpose than most Bay Area start ups. The senior leadership is also incredibly accomplished and focused on changing a broken system so that life for our parents, and each and every one of us is better as we age. Industry is also ripe for technological advances, making the work interesting and challenging on both a micro (daily) and macro level.", "Our work doesn't just have purpose, it has tangible impact. We spend each day focused on setting up our caregivers to provide great care so that our clients can stay at home longer and so that their family members can have both mental and physical respite.\n\nExecutives and management are actively engaged in our professional development. There is a lot of transparency around strategy and how we are growing. I'm particularly impressed by the amount of focus on professional development at Honor. There is a lot of coaching and feedback available. I feel like my manager is a partner in my growth and is expanding the job opportunities available to me.\n\nThe team is fun, supportive, and everyone challenges each other to be better.", "Honor is trying to change an industry that needs more light to be shined on it."], "Liventus": ["Great company to work for!", "Great company environment. Great support from peers. H1B sponsorship", "Have been working here for over 10 years. Nice and friendly co-workers with a great management team all striving for one goal. Definitely an environment for those who love challenges and the opportunity to learn.", "Liventus is a amazing place to work. The job is constantly challenging and the work environment is pretty friendly. If you aren't comfortable with the volatility, job security and salary a start up would provide but at the same time isn't sure if the aggressive and competitive enviroment a big company would have, Liventus has that good balance of a mid-size company with the pros of both worlds. Your input will be heard and many of the developers are always pushing to use new and exciting technologies.\n\nThey are very flexible when it comes to vacation days and sick leaves so that's a plus as well. The company culture is very friendly, I recommend checking the Facebook page to see a glimpse of the many events thrown by the company.", "Liventus is a great place to work if you are a real go-getter type of person. This is not a place for anyone that just wants do a regular 9-5 job. You will a have a job title, but the responsibilities will go above and beyond that. So people that like challenges will really enjoy working here. The company is always looking to grow and become better. Which is proven with how much the staff has grown and the addition of remote offices in the past few years."]}